{
  "general": {
    "something_wrong": "Kaut kas nenostrādāja kā vajadzētu, bet neuztraucieties – jūsu svarīgā informācija ir drošībā.",
    "try_again": "Ļaujiet man mēģināt vēlreiz jūsu vietā",
    "contact_support": "Esmu šeit, lai palīdzētu, ja jums nepieciešama palīdzība",
    "no_data_lost": "Labā ziņa ir tā, ka nekas no jūsu darba nav pazudis",
    "temporary_issue": "Šķiet, ka tā ir īslaicīga problēma, kas drīz tiks atrisināta"
  },
  "network": {
    "connection_lost": "Izskatās, ka jūsu interneta savienojums tika pārtraukts. Jūsu darbs ir saglabāts, un mēs automātiski atjaunosim savienojumu.",
    "slow_connection": "Jūsu savienojums šodien šķiet nedaudz lēns. Es pacietīgi pagaidīšu, kamēr viss ielādēsies.",
    "server_busy": "Mūsu serveri šobrīd ir nedaudz noslogoti, bet es turpināšu mēģināt jums palīdzēt.",
    "timeout": "Tas aizņēma ilgāku laiku nekā gaidīts. Ļaujiet man pamēģināt citu pieeju."
  },
  "validation": {
    "required_field": "Jūsu ģimenei būs nepieciešama šī informācija – vai varat palīdzēt man to aizpildīt?",
    "invalid_email": "Šī e-pasta adrese neizskatās pareiza. Vai varat to vēlreiz pārbaudīt?",
    "invalid_phone": "Man ir problēmas ar šī tālruņa numura formātu. Vai varat mēģināt to ievadīt citādi?",
    "invalid_date": "Šis datuma formāts man neder. Vai varat mēģināt MM/DD/GGGG?",
    "password_weak": "Padarīsim jūsu paroli nedaudz stiprāku, lai jūsu ģimenes informācija būtu īpaši droša.",
    "file_too_large": "Šis fails ir nedaudz par lielu, lai to apstrādātu. Vai varat mēģināt mazāku versiju?",
    "unsupported_file": "Es nevaru strādāt ar šāda veida failu. Vai varat mēģināt PDF vai attēlu?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Pašlaik neizdevās saglabāt informāciju par šo īpašumu, bet turpināšu mēģināt. Jūsu ģimenes informācija man ir svarīga.",
      "load_failed": "Man ir grūtības ielādēt jūsu īpašumus. Ļaujiet man pamēģināt vēlreiz pēc brīža.",
      "delete_failed": "Neizdevās izdzēst šo vienumu tagad. Vai vēlaties, lai mēģinu vēlreiz?"
    },
    "documents": {
      "upload_failed": "Šis dokuments netika augšupielādēts pareizi. Neuztraucieties – palīdzēšu jums mēģināt vēlreiz.",
      "processing_failed": "Radās problēma, apstrādājot šo dokumentu. Fails ir drošībā, un es mēģināšu vēlreiz.",
      "access_failed": "Pašlaik nevaru piekļūt šim dokumentam. Ļaujiet man paskatīties, ko varu darīt, lai palīdzētu."
    },
    "family": {
      "save_failed": "Pašlaik neizdevās saglabāt šīs personas informāciju. Mēģināsim vēlreiz – jūsu uzticības loks ir svarīgs.",
      "invite_failed": "Pašlaik neizdevās nosūtīt šo ielūgumu. Palīdzēšu to mēģināt vēlreiz, kad būsiet gatavs.",
      "access_failed": "Man ir problēmas ar ģimenes piekļuves iestatījumiem. Ļaujiet man to sakārtot jūsu vietā."
    },
    "will": {
      "generation_failed": "Pašlaik neizdevās izveidot jūsu testamentu. Neuztraucieties – visi jūsu lēmumi ir saglabāti, un es mēģināšu vēlreiz.",
      "save_failed": "Pašlaik neizdevās saglabāt izmaiņas testamentā. Iepriekšējā versija ir drošībā, un es turpināšu mēģināt.",
      "legal_check_failed": "Pašlaik neizdevās pārbaudīt juridiskās prasības. Ļaujiet man mēģināt vēlreiz vai arī varam lūgt palīdzību mūsu juridiskajai komandai."
    }
  },
  "emotional_support": {
    "frustration": "Zinu, ka ir nomācoši, kad mēģināt izdarīt kaut ko svarīgu savai ģimenei. Esmu šeit, lai palīdzētu jums to īstenot.",
    "time_pressure": "Saprotu, ka jums nav daudz laika tehniskām problēmām. Ļaujiet man to ātri atrisināt jūsu vietā.",
    "overwhelm": "Tehniskas problēmas var šķist pārāk apgrūtinošas, kad jau nodarbojaties ar svarīgu ģimenes plānošanu. Ieelpojiet dziļi – es to sakārtošu.",
    "discouragement": "Neļaujiet šai tehniskajai problēmai jūs atturēt. Tas, ko darāt savai ģimenei, ir pārāk svarīgi, lai atteiktos."
  },
  "solutions": {
    "refresh_page": "Dažreiz palīdz lapas atsvaidzināšana. Jūsu darbs ir saglabāts, tāpēc nekas netiks zaudēts.",
    "try_different_browser": "Ja tas turpinās, mēģiniet izmantot citu pārlūkprogrammu. Parasti Chrome vai Firefox darbojas vislabāk.",
    "check_internet": "Vai varat pārbaudīt savu interneta savienojumu? Dažreiz ar to pietiek.",
    "contact_support": "Es ar prieku palīdzēšu personīgi. Varat sazināties ar mūsu atbalsta komandu, kas parūpēsies par jums.",
    "try_later": "Ja jums steidzami jāiet, varat mēģināt vēlreiz vēlāk. Viss, ko esat izdarījis, ir droši saglabāts.",
    "alternative_approach": "Ļaujiet man ieteikt citu veidu, kā to paveikt, kas varētu darboties labāk."
  },
  "recovery": {
    "auto_save_worked": "Labā ziņa ir tā, ka viss, ko ievadījāt, tika automātiski saglabāts.",
    "backup_available": "Man ir jūsu darba rezerves kopija no pirms dažām minūtēm, ja tā nepieciešama.",
    "progress_preserved": "Visa jūsu gaita ir saglabāta – jums nebūs jāsāk no jauna.",
    "data_secure": "Jūsu ģimenes informācija paliek pilnībā droša neskatoties uz šo tehnisko problēmu."
  }
}
