{
  "general": {
    "something_wrong": "Níor éirigh le rud éigin i gceart, ach ná bí buartha – tá do chuid faisnéise tábhachtaí slán sábháilte.",
    "try_again": "Lig dom triail eile a bhaint as duit",
    "contact_support": "Táim anseo chun cabhrú leat má theastaíonn tacaíocht uait",
    "no_data_lost": "Is é an dea-scéal ná nach bhfuil aon rud a rinne tú caillte",
    "temporary_issue": "Is cosúil gur fadhb shealadach í seo a réiteofar go luath"
  },
  "network": {
    "connection_lost": "Is cosúil gur cuireadh isteach ar do cheangal idirlín. Tá do chuid oibre sábháilte agus nascfaidh muid arís go huathoibríoch.",
    "slow_connection": "Tá do cheangal beagáinín mall inniu. Fanfaidh mé go foighneach agus gach rud á lódáil.",
    "server_busy": "Tá ár bhfreastalaithe beagáinín gnóthach faoi láthair, ach leanfaidh mé orm ag iarraidh cabhrú leat.",
    "timeout": "Thóg sé sin níos mó ama ná mar a bhíothas ag súil leis. Lig dom cur chuige eile a thriail."
  },
  "validation": {
    "required_field": "Beidh do theaghlach ag teastáil ón eolas seo – an féidir leat cabhrú liom é a líonadh isteach?",
    "invalid_email": "Ní cosúil go bhfuil an seoladh ríomhphoist sin ceart. An bhféadfá é a sheiceáil arís?",
    "invalid_phone": "Tá deacracht agam leis an bhformáid uimhir ghutháin sin. An bhféadfá é a chur isteach ar bhealach difriúil?",
    "invalid_date": "Ní oibríonn an fhormáid dáta sin domsa. An bhféadfá MM/LL/BBBB a úsáid?",
    "password_weak": "Déanaimis do phasfhocal beagán níos láidre chun faisnéis do theaghlaigh a choinneáil breis slán.",
    "file_too_large": "Tá an comhad sin beagán ró-mhór domsa le láimhseáil. An bhféadfá leagan níos lú a thriail?",
    "unsupported_file": "Ní féidir liom oibriú leis an gcineál comhaid sin. An bhféadfá PDF nó íomhá a úsáid ina áit?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Níorbh fhéidir liom eolas an tsócmhainne sin a shábháil faoi láthair, ach leanfaidh mé orm ag iarraidh. Tá eolas do theaghlaigh tábhachtach dom.",
      "load_failed": "Tá deacracht agam do shócmhainní a lódáil faoi láthair. Lig dom iarracht eile a dhéanamh i gceann tamaill.",
      "delete_failed": "Níorbh fhéidir liom an mhír sin a bhaint anois. Ar mhaith leat go ndéanfainn iarracht arís?"
    },
    "documents": {
      "upload_failed": "Níor uaslódáladh an cháipéis sin i gceart. Ná bí buartha – cabhróidh mé leat é a thriail arís.",
      "processing_failed": "Bhí deacracht agam an cháipéis sin a phróiseáil. Tá an comhad sábháilte agus déanfaidh mé iarracht eile.",
      "access_failed": "Ní féidir liom rochtain a fháil ar an gcáipéis sin faoi láthair. Lig dom féachaint cad is féidir liom a dhéanamh duit."
    },
    "family": {
      "save_failed": "Níorbh fhéidir liom eolas an duine sin a shábháil anois. Déanaimis iarracht eile – tá do chiorcal muiníne tábhachtach.",
      "invite_failed": "Níorbh fhéidir liom an cuireadh sin a sheoladh faoi láthair. Cabhróidh mé leat é a sheoladh arís nuair a bheidh tú réidh.",
      "access_failed": "Tá deacracht agam le socruithe rochtana teaghlaigh. Lig dom é seo a láimhseáil duit."
    },
    "will": {
      "generation_failed": "Níorbh fhéidir liom d’uacht a chruthú anois. Ná bí buartha – tá do chinntí go léir sábháilte agus déanfaidh mé iarracht eile.",
      "save_failed": "Níorbh fhéidir liom na hathruithe ar an uacht a shábháil anois. Tá an leagan roimhe seo sábháilte agus leanfaidh mé orm ag iarraidh.",
      "legal_check_failed": "Níorbh fhéidir liom na riachtanais dlíthiúla a fhíorú anois. Lig dom iarracht eile a dhéanamh, nó is féidir linn cabhair a fháil ónár bhfoireann dlí."
    }
  },
  "emotional_support": {
    "frustration": "Tá a fhios agam go mbíonn sé frustrach nuair atá tú ag iarraidh rud tábhachtach a dhéanamh do do theaghlach. Táim anseo chun cabhrú leat é a chur i gcrích.",
    "time_pressure": "Tuigim nach bhfuil mórán ama agat do fhadhbanna teicniúla. Lig dom é seo a réiteach go tapa duit.",
    "overwhelm": "Is féidir le fadhbanna teicniúla a bheith róchumhachtach nuair atá tú cheana féin ag plé le pleanáil teaghlaigh thábhachtach. Glac anáil – tá sé seo faoi smacht agam.",
    "discouragement": "Ná lig don mhí-ádh teicniúil seo thú a mhíspreagadh. Tá an rud atá á dhéanamh agat do do theaghlach ró-thábhachtach le géilleadh."
  },
  "solutions": {
    "refresh_page": "Uaireanta cabhraíonn sé an leathanach a athnuachan. Tá do chuid oibre sábháilte, mar sin ní chaillfidh tú aon rud.",
    "try_different_browser": "Má leanann sé seo ar aghaidh, bain triail as brabhsálaí difriúil. Oibríonn Chrome nó Firefox de ghnáth is fearr.",
    "check_internet": "An bhféadfá do cheangal idirlín a sheiceáil? Uaireanta is leor sin.",
    "contact_support": "Ba bhreá liom cabhrú leat go pearsanta. Is féidir leat teagmháil a dhéanamh lenár bhfoireann tacaíochta a thabharfaidh aire mhaith duit.",
    "try_later": "Má tá deifir ort, is féidir leat triail eile a bhaint as níos déanaí. Tá gach rud atá déanta agat sábháilte.",
    "alternative_approach": "Lig dom modh eile a mholadh chun é seo a dhéanamh a d’fhéadfadh obair níos fearr."
  },
  "recovery": {
    "auto_save_worked": "Is é an dea-scéal ná gur sábháladh go huathoibríoch gach rud a chuir tú isteach.",
    "backup_available": "Tá cúltaca agam de do chuid oibre ó cúpla nóiméad ó shin más gá duit é.",
    "progress_preserved": "Tá do dhul chun cinn go léir sábháilte – ní gá duit tosú ón tús.",
    "data_secure": "Fanann faisnéis do theaghlaigh go hiomlán slán in ainneoin an fhadhb theicniúil seo."
  }
}
