{
  "general": {
    "loading": "Nóiméad amháin agus mé ag ullmhú gach rud duit...",
    "processing": "Táim ag obair ar seo duit...",
    "saving": "Ag coinneáil seo slán do do theaghlach...",
    "uploading": "An fhaisnéis thábhachtach seo a stóráil go slán...",
    "analyzing": "Ag athbhreithniú seo chun cabhrú le do theaghlach...",
    "generating": "Ag cruthú seo go speisialta do do theaghlach...",
    "connecting": "Ag ceangal go slán chun d’fhaisnéis a chosaint...",
    "syncing": "Ag déanamh cinnte go bhfuil gach rud cothrom le dáta duit...",
    "initializing": "Ag ullmhú gach rud duit...",
    "updating": "Ag nuashonrú an eolais seo do do theaghlach..."
  },
  "contextual": {
    "assets": {
      "saving": "Ag cur an fhaisnéis thábhachtach seo le taisceadán do theaghlaigh...",
      "loading": "Ag bailiú faisnéise tábhachtaí do theaghlaigh...",
      "calculating": "Ag tuiscint cad is brí leis seo do do theaghlach...",
      "updating": "Ag nuashonrú sócmhainní agus sealúchais do theaghlaigh...",
      "organizing": "Ag eagrú gach rud ionas gur féidir le do theaghlach é a aimsiú go héasca..."
    },
    "documents": {
      "uploading": "Ag stóráil an doiciméid seo go slán do do theaghlach...",
      "processing": "Ag eagrú seo ionas gur féidir le do theaghlach é a aimsiú go héasca...",
      "analyzing": "Ag athbhreithniú an doiciméid seo chun cabhrú le do theaghlach...",
      "scanning": "Ag léamh tríd an doiciméad tábhachtach seo...",
      "encrypting": "Ag cosaint an doiciméid seo le slándáil bhreise..."
    },
    "will": {
      "generating": "Do uacht a chruthú go cúramach bunaithe ar do mhianta...",
      "saving": "Ag caomhnú do chinntí tábhachtacha do do theaghlach...",
      "reviewing": "A chinntiú go léiríonn gach rud a bhfuil uait...",
      "updating": "Nuashonrú ar do mhianta do do theaghlach...",
      "finalizing": "Ag cur na ndeireadh leis an obair ar do uacht..."
    },
    "family": {
      "saving": "Ag cur an duine iontaofa seo le foireann tacaíochta do theaghlaigh...",
      "loading": "Ag bailiú eolais faoi chabhróirí do theaghlaigh...",
      "updating": "Ag nuashonrú líonra tacaíochta do theaghlaigh...",
      "connecting": "Ag tógáil naisc le caomhnóirí do theaghlaigh...",
      "organizing": "Ag eagrú córas tacaíochta do theaghlaigh..."
    },
    "guardian": {
      "adding": "Ag cur an duine speisialta seo leis chun cabhrú le do theaghlach...",
      "updating": "Faisnéis an chaomhnóra á nuashonrú...",
      "verifying": "A chinntiú gur féidir leis an gcaomhnóir seo cabhrú nuair is gá...",
      "connecting": "Ag bunú an chaidrimh thábhachtaigh seo..."
    }
  },
  "emotional": {
    "first_time": "Táim ag ullmhú gach rud go foirfe do do chéad chuairt...",
    "returning": "Fáilte ar ais! Táim ag ullmhú do chuid faisnéise...",
    "complex_task": "Is obair thábhachtach í seo - táim ag tabhairt aire do na sonraí go léir...",
    "sensitive_area": "Tuigim gur rud pearsanta é seo - láimhseáil le cúram breise...",
    "almost_done": "Beagnach ann - ag déanamh cinnte go bhfuil gach rud foirfe...",
    "taking_time": "Tógann rudaí maithe am - táim ag déanamh go maith ar son do theaghlaigh..."
  },
  "transitions": {
    "dashboard_to_assets": "Féachfaimid ar rudaí tábhachtacha do theaghlaigh...",
    "assets_to_family": "Anois smaoinímis ar na daoine a fhéadann cabhrú...",
    "family_to_will": "Am chun do mhianta do do theaghlach a dhoiciméadú...",
    "will_to_review": "Déanaimis athbhreithniú ar gach rud le chéile...",
    "section_complete": "Dul chun cinn iontach! Tá do theaghlach níos ullmhaithe anois...",
    "saving_complete": "Tá sé seo stóráilte go sábháilte do do theaghlach...",
    "starting_complex": "Is obair thábhachtach í seo do do theaghlach - glacaimis ár gcuid ama...",
    "navigating": "Ag tabhairt ann thú anois..."
  },
  "progress": {
    "starting": "Ag tosú le plean cosanta do theaghlaigh...",
    "quarter": "Ag eagrú d'fhaisnéise...",
    "half": "Ag cur plean cosanta do theaghlaigh le chéile...",
    "three_quarters": "Ag cur gach rud i gcrích do do theaghlach...",
    "complete": "Tá do phlean cosanta teaghlaigh réidh!",
    "step_complete": "Céim eile críochnaithe do thodhchaí do theaghlaigh..."
  },
  "microInteractions": {
    "buttons": {
      "save": "Coinnigh seo slán do do theaghlach",
      "delete": "Bain seo go cúramach",
      "share": "Cuir do theaghlach ar an eolas faoi seo",
      "edit": "Nuashonraigh an fhaisnéis seo",
      "add": "Cuir le plean do theaghlaigh",
      "continue": "Lean ort ag tógáil do phlean",
      "back": "Téimis ar ais",
      "next": "Bog ar aghaidh le chéile"
    },
    "validation": {
      "required": "Tá an fhaisnéis seo ag teastáil ó do theaghlach",
      "invalid_format": "Lig dom cabhrú leat leis an bhformáid cheart",
      "too_short": "An bhféadfá beagán níos mó sonraí a chur leis faoi do theaghlach?",
      "too_long": "Coinnímis é seo gonta ar mhaithe le soiléireacht",
      "success": "Foirfe! Breathnaíonn sé seo go hiontach.",
      "checking": "Lig dom é seo a sheiceáil duit..."
    }
  },
  "errors": {
    "recovery": {
      "general": "Níor oibrigh rud éigin i gceart, ach tá do chuid faisnéise sábháilte...",
      "retry": "Lig dom iarracht a dhéanamh arís ar sin duit...",
      "save_failed": "Ná bíodh imní ort - déanfaidh mé cinnte go ndéanfar é seo a shábháil i gceart...",
      "network": "Trioblóid ag ceangal - ach ná bíodh imní ort, níl aon rud caillte...",
      "timeout": "Tá sé seo ag glacadh níos faide ná mar a bhíothas ag súil leis - lig dom cabhrú leat..."
    },
    "reassurance": {
      "data_safe": "Tá do chuid faisnéise go hiomlán sábháilte",
      "no_loss": "Níl aon rud caillte",
      "we_can_help": "Is féidir linn é seo a shocrú le chéile",
      "try_again": "Déanaimis iarracht arís nuair a bheidh tú réidh"
    }
  },
  "encouragement": {
    "overwhelmed": {
      "take_time": "Níl aon deifir ann - glac an t-am ar fad atá uait",
      "here_to_help": "Táim anseo chun cabhrú leat i ngach céim den bhealach.",
      "one_step": "Céim bheag amháin ag an am",
      "doing_great": "Tá rud éigin iontach á dhéanamh agat do do theaghlach."
    },
    "confident": {
      "great_progress": "Tá dul chun cinn den scoth á dhéanamh agat!",
      "almost_there": "Beagnach críochnaithe - tá tú ag déanamh go hiontach!",
      "well_done": "Maith thú as an rannóg seo a chríochnú!",
      "family_protected": "Tá do theaghlach níos cosanta anois"
    }
  }
}
