{
  "tos": {
    "title": "Vilkår for bruk",
    "effectiveDate": "Ikrafttredelsesdato: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Aksept av vilkår",
        "body": "Ved å få tilgang til eller bruke LegacyGuard Heritage Vault, godtar du å være bundet av disse vilkårene for bruk."
      },
      "service": {
        "title": "2. Beskrivelse av tjenesten",
        "body": "LegacyGuard Heritage Vault tilbyr tjenester for digital arveforvaltning, inkludert dokumentlagring, opprettelse av testamenter og sikker deling av viktig informasjon med utpekte mottakere."
      },
      "responsibilities": {
        "title": "3. Brukeransvar",
        "body": "Du er ansvarlig for å opprettholde konfidensialiteten til kontoinformasjonen din og for alle aktiviteter som skjer under kontoen din."
      },
      "privacy": {
        "title": "4. Personvern og databeskyttelse",
        "body": "Personvernet ditt er viktig for oss. Les vår personvernerklæring for å forstå hvordan vi samler inn, bruker og beskytter informasjonen din."
      },
      "liability": {
        "title": "5. Ansvarsbegrensning",
        "body": "LegacyGuard Heritage Vault er ikke ansvarlig for indirekte, tilfeldige, spesielle, følgeskader eller straffeskader som oppstår som følge av din bruk av tjenesten."
      }
    },
    "disclaimer": "[Dette er en plassholdertekst. Vennligst kontakt en juridisk rådgiver for å utarbeide fullstendige vilkår for bruk.]"
  },
  "refund": {
    "title": "Returpolicy",
    "effectiveDate": "Ikrafttredelsesdato: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Oversikt",
        "body": "Kundetilfredshet er vår prioritet. Denne returpolicyen beskriver kriteriene og prosessen for å be om refusjon."
      },
      "eligibility": {
        "title": "2. Kvalifikasjoner for refusjon",
        "body": "Du kan være kvalifisert for refusjon innen 30 dager etter det opprinnelige kjøpet, dersom du ikke har brukt premiumfunksjonene i stor grad. Refusjoner gis etter vårt skjønn."
      },
      "process": {
        "title": "3. Refusjonsprosess",
        "body": "For å starte en refusjonsforespørsel, kontakt vårt supportteam på support@legacyguard.com innen 30 dager etter kjøpet. Inkluder e-postadressen til kontoen din og årsaken til forespørselen."
      },
      "nonRefundable": {
        "title": "4. Ikke-refunderbare tjenester",
        "intro": "Følgende tjenester kan ikke refunderes:",
        "items": {
          "item1": "Månedlige abonnementer etter de første 30 dagene",
          "item2": "Engangsgebyrer for dokumentbehandling",
          "item3": "Notarial- og juridiske rådgivningstjenester"
        }
      },
      "processingTime": {
        "title": "5. Behandlingstid",
        "body": "Godkjente refusjoner behandles innen 5–10 virkedager og krediteres den opprinnelige betalingsmetoden."
      }
    },
    "disclaimer": "[Dette er en plassholdertekst. Vennligst kontakt en juridisk rådgiver for å utarbeide en fullstendig returpolicy.]"
  }
}
