{
  "general": {
    "something_wrong": "Kažkas nepavyko visiškai tinkamai, bet nesijaudinkite – jūsų svarbi informacija yra saugi.",
    "try_again": "Leiskite man pabandyti dar kartą už jus",
    "contact_support": "Esu čia, kad padėčiau, jei jums reikia pagalbos",
    "no_data_lost": "Gera žinia ta, kad niekas iš jūsų darbo nebuvo prarasta",
    "temporary_issue": "Panašu, kad tai laikina problema, kuri turėtų greitai išsispręsti"
  },
  "network": {
    "connection_lost": "Atrodo, kad nutrūko jūsų interneto ryšys. Jūsų darbas išsaugotas, ir mes automatiškai vėl prisijungsime.",
    "slow_connection": "Jūsų ryšys šiandien atrodo šiek tiek lėtas. Kantriai palauksiu, kol viskas užsikraus.",
    "server_busy": "Mūsų serveriai šiuo metu šiek tiek užimti, bet ir toliau bandysiu jums padėti.",
    "timeout": "Tai užtruko ilgiau nei tikėtasi. Leiskite pabandyti kitą būdą."
  },
  "validation": {
    "required_field": "Jūsų šeimai reikės šios informacijos – ar galite padėti man ją užpildyti?",
    "invalid_email": "Šis el. pašto adresas neatrodo visiškai teisingas. Ar galėtumėte jį dar kartą patikrinti?",
    "invalid_phone": "Man kyla problemų dėl šio telefono numerio formato. Ar galite pabandyti įvesti kitaip?",
    "invalid_date": "Šis datos formatas man netinka. Ar galite pabandyti MM/DD/MMMM?",
    "password_weak": "Sustiprinkime jūsų slaptažodį, kad jūsų šeimos informacija būtų dar saugesnė.",
    "file_too_large": "Šis failas yra šiek tiek per didelis, kad galėčiau jį apdoroti. Ar galite pabandyti mažesnę versiją?",
    "unsupported_file": "Negaliu dirbti su šio tipo failu. Ar galite pabandyti PDF arba paveikslėlį?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Nepavyko išsaugoti šio turto informacijos dabar, bet ir toliau bandysiu. Jūsų šeimos informacija man svarbi.",
      "load_failed": "Šiuo metu man sunku įkelti jūsų turtą. Leiskite pabandyti dar kartą netrukus.",
      "delete_failed": "Nepavyko pašalinti šio elemento dabar. Ar norėtumėte, kad pabandyčiau dar kartą?"
    },
    "documents": {
      "upload_failed": "Šis dokumentas nebuvo tinkamai įkeltas. Nesijaudinkite – padėsiu jums pabandyti dar kartą.",
      "processing_failed": "Turėjau problemų apdorojant šį dokumentą. Failas saugus, ir pabandysiu dar kartą.",
      "access_failed": "Šiuo metu negaliu pasiekti šio dokumento. Leiskite pažiūrėti, ką galiu padaryti, kad padėčiau."
    },
    "family": {
      "save_failed": "Nepavyko išsaugoti šio asmens informacijos dabar. Pabandykime dar kartą – jūsų patikimas ratas yra svarbus.",
      "invite_failed": "Nepavyko išsiųsti šio kvietimo dabar. Padėsiu jums pabandyti dar kartą, kai būsite pasiruošę.",
      "access_failed": "Man kyla problemų dėl šeimos prieigos nustatymų. Leiskite man tuo pasirūpinti už jus."
    },
    "will": {
      "generation_failed": "Nepavyko sukurti jūsų testamento dabar. Nesijaudinkite – visi jūsų sprendimai yra išsaugoti, ir pabandysiu dar kartą.",
      "save_failed": "Nepavyko išsaugoti testamento pakeitimų dabar. Ankstesnė versija yra saugi, ir toliau bandysiu.",
      "legal_check_failed": "Nepavyko patikrinti teisinių reikalavimų dabar. Leiskite pabandyti dar kartą arba galime paprašyti pagalbos iš mūsų teisinės komandos."
    }
  },
  "emotional_support": {
    "frustration": "Žinau, kad tai gali būti apmaudu, kai bandote padaryti ką nors svarbaus savo šeimai. Esu čia, kad padėčiau jums tai įgyvendinti.",
    "time_pressure": "Suprantu, kad neturite daug laiko techninėms problemoms. Leiskite man greitai tuo pasirūpinti už jus.",
    "overwhelm": "Techninės problemos gali atrodyti pribloškiančios, kai jau rūpinatės svarbiu šeimos planavimu. Atsikvėpkite – aš tuo pasirūpinsiu.",
    "discouragement": "Neleiskite, kad ši techninė problema jus atbaidytų. Tai, ką darote dėl savo šeimos, yra per daug svarbu, kad pasiduotumėte."
  },
  "solutions": {
    "refresh_page": "Kartais padeda puslapio atnaujinimas. Jūsų darbas yra išsaugotas, todėl nieko neprarasite.",
    "try_different_browser": "Jei tai kartojasi, pabandykite naudoti kitą naršyklę. Paprastai „Chrome“ arba „Firefox“ veikia geriausiai.",
    "check_internet": "Ar galite patikrinti savo interneto ryšį? Kartais to pakanka.",
    "contact_support": "Mielai jums asmeniškai padėsiu. Galite susisiekti su mūsų palaikymo komanda, kuri gerai jumis pasirūpins.",
    "try_later": "Jei skubate, galite pabandyti dar kartą vėliau. Visa, ką padarėte, yra saugiai išsaugota.",
    "alternative_approach": "Leiskite pasiūlyti kitą būdą, kuris gali veikti geriau."
  },
  "recovery": {
    "auto_save_worked": "Gera žinia yra ta, kad viskas, ką įvedėte, buvo automatiškai išsaugota.",
    "backup_available": "Turiu jūsų darbo atsarginę kopiją iš prieš kelias minutes, jei jums jos prireiktų.",
    "progress_preserved": "Visa jūsų pažanga yra išsaugota – jums nereikės pradėti iš naujo.",
    "data_secure": "Jūsų šeimos informacija išlieka visiškai saugi nepaisant šios techninės problemos."
  }
}

