{
  "general": {
    "something_wrong": "Coś nie zadziałało tak, jak powinno, ale nie martw się – Twoje ważne informacje są bezpieczne.",
    "try_again": "Pozwól, że spróbuję jeszcze raz",
    "contact_support": "Jestem tutaj, aby pomóc, jeśli potrzebujesz wsparcia",
    "no_data_lost": "Dobra wiadomość jest taka, że nic z tego, nad czym pracowałeś, nie zostało utracone",
    "temporary_issue": "Wygląda na to, że to tymczasowy problem, który powinien szybko się rozwiązać"
  },
  "network": {
    "connection_lost": "Wygląda na to, że Twoje połączenie internetowe zostało przerwane. Twoja praca została zapisana, a my połączymy się ponownie automatycznie.",
    "slow_connection": "Twoje połączenie wydaje się dzisiaj trochę wolne. Cierpliwie poczekam, aż wszystko się załaduje.",
    "server_busy": "Nasze serwery są teraz trochę zajęte, ale będę nadal próbować Ci pomóc.",
    "timeout": "To zajęło więcej czasu niż się spodziewałem. Pozwól, że spróbuję innego podejścia."
  },
  "validation": {
    "required_field": "Twoja rodzina będzie potrzebować tych informacji – czy możesz mi pomóc je uzupełnić?",
    "invalid_email": "Ten adres e-mail wygląda na niepoprawny. Czy możesz go dla mnie sprawdzić?",
    "invalid_phone": "Mam problem z tym formatem numeru telefonu. Czy możesz spróbować wpisać go inaczej?",
    "invalid_date": "Ten format daty nie działa. Spróbuj MM/DD/RRRR.",
    "password_weak": "Zróbmy Twoje hasło trochę silniejsze, aby dodatkowo chronić informacje Twojej rodziny.",
    "file_too_large": "Ten plik jest trochę za duży, żebym mógł go obsłużyć. Spróbuj mniejszej wersji.",
    "unsupported_file": "Nie mogę pracować z tym typem pliku. Spróbuj użyć pliku PDF lub obrazu."
  },
  "contextual": {
    "assets": {
      "save_failed": "Nie udało mi się zapisać tych informacji o aktywach, ale będę próbować dalej. Informacje Twojej rodziny są dla mnie ważne.",
      "load_failed": "Mam problem z wczytaniem Twoich aktywów. Spróbuję ponownie za chwilę.",
      "delete_failed": "Nie udało mi się usunąć tego elementu. Czy chcesz, żebym spróbował ponownie?"
    },
    "documents": {
      "upload_failed": "Ten dokument nie został poprawnie przesłany. Nie martw się – pomogę Ci spróbować ponownie.",
      "processing_failed": "Miałem problem z przetworzeniem tego dokumentu. Plik jest bezpieczny i spróbuję ponownie.",
      "access_failed": "Nie mogę uzyskać dostępu do tego dokumentu w tej chwili. Zobaczmy, co mogę zrobić, aby pomóc."
    },
    "family": {
      "save_failed": "Nie udało mi się zapisać informacji o tej osobie. Spróbuję ponownie – Twój krąg zaufania jest ważny.",
      "invite_failed": "Nie udało mi się wysłać tego zaproszenia. Pomogę Ci spróbować ponownie, gdy będziesz gotowy.",
      "access_failed": "Mam problem z ustawieniami dostępu dla rodziny. Pozwól, że się tym zajmę."
    },
    "will": {
      "generation_failed": "Nie udało mi się stworzyć Twojego testamentu. Nie martw się – wszystkie Twoje decyzje są zapisane i spróbuję ponownie.",
      "save_failed": "Nie udało mi się zapisać zmian w testamencie. Poprzednia wersja jest bezpieczna i będę próbować dalej.",
      "legal_check_failed": "Nie udało mi się zweryfikować wymogów prawnych. Spróbuję ponownie lub możemy poprosić o pomoc nasz zespół prawny."
    }
  },
  "emotional_support": {
    "frustration": "Wiem, że to frustrujące, gdy próbujesz zrobić coś ważnego dla swojej rodziny. Jestem tu, aby to naprawić.",
    "time_pressure": "Rozumiem, że nie masz dużo czasu na problemy techniczne. Pozwól, że szybko się tym zajmę.",
    "overwhelm": "Problemy techniczne mogą być przytłaczające, gdy zajmujesz się już ważnym planowaniem rodzinnym. Weź oddech – mam to pod kontrolą.",
    "discouragement": "Nie pozwól, aby ta drobna awaria techniczna Cię zniechęciła. To, co robisz dla swojej rodziny, jest zbyt ważne, by się poddać."
  },
  "solutions": {
    "refresh_page": "Czasami odświeżenie strony pomaga. Twoja praca jest zapisana, więc nic nie stracisz.",
    "try_different_browser": "Jeśli to będzie się powtarzać, spróbuj użyć innej przeglądarki. Chrome lub Firefox zwykle działają najlepiej.",
    "check_internet": "Czy możesz sprawdzić swoje połączenie internetowe? Czasami to wszystko, czego potrzeba.",
    "contact_support": "Chętnie pomogę Ci osobiście. Możesz skontaktować się z naszym zespołem wsparcia, który dobrze się Tobą zaopiekuje.",
    "try_later": "Jeśli się spieszysz, możesz spróbować ponownie później. Wszystko, co zrobiłeś, jest bezpiecznie zapisane.",
    "alternative_approach": "Pozwól, że zaproponuję inny sposób, który może działać lepiej."
  },
  "recovery": {
    "auto_save_worked": "Dobra wiadomość jest taka, że wszystko, co wpisałeś, zostało automatycznie zapisane.",
    "backup_available": "Mam kopię zapasową Twojej pracy sprzed kilku minut, jeśli jej potrzebujesz.",
    "progress_preserved": "Cały Twój postęp został zachowany – nie musisz zaczynać od nowa.",
    "data_secure": "Informacje Twojej rodziny pozostają całkowicie bezpieczne pomimo tego problemu technicznego."
  }
}

