{
  "tos": {
    "title": "Warunki korzystania z usługi",
    "effectiveDate": "Data wejścia w życie: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Akceptacja warunków",
        "body": "Uzyskując dostęp do usługi LegacyGuard Heritage Vault lub korzystając z niej, zgadzasz się na przestrzeganie niniejszych Warunków korzystania z usługi."
      },
      "service": {
        "title": "2. Opis usługi",
        "body": "LegacyGuard Heritage Vault oferuje usługi cyfrowego zarządzania spuścizną, w tym przechowywanie dokumentów, tworzenie testamentów i bezpieczne udostępnianie ważnych informacji wyznaczonym beneficjentom."
      },
      "responsibilities": {
        "title": "3. Obowiązki użytkownika",
        "body": "Użytkownik jest odpowiedzialny za zachowanie poufności danych logowania do konta oraz za wszelkie działania podejmowane za jego pośrednictwem."
      },
      "privacy": {
        "title": "4. Prywatność i ochrona danych",
        "body": "Twoja prywatność jest dla nas ważna. Zapoznaj się z naszą Polityką Prywatności, aby dowiedzieć się, jak gromadzimy, wykorzystujemy i chronimy Twoje dane."
      },
      "liability": {
        "title": "5. Ograniczenie odpowiedzialności",
        "body": "LegacyGuard Heritage Vault nie ponosi odpowiedzialności za jakiekolwiek szkody pośrednie, przypadkowe, szczególne, wynikowe ani karne będące skutkiem korzystania z usługi."
      }
    },
    "disclaimer": "[To jest symbol zastępczy. Aby utworzyć kompleksowe Warunki korzystania z usługi, skonsultuj się z doradcą prawnym.]"
  },
  "refund": {
    "title": "Polityka zwrotów",
    "effectiveDate": "Data wejścia w życie: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Przegląd",
        "body": "Satysfakcja klienta jest naszym priorytetem. Niniejsza Polityka Zwrotów określa kryteria i procedurę ubiegania się o zwrot pieniędzy."
      },
      "eligibility": {
        "title": "2. Uprawnienia do zwrotów",
        "body": "Możesz ubiegać się o zwrot pieniędzy w ciągu 30 dni od daty zakupu, jeśli nie korzystałeś intensywnie z funkcji premium. Zwroty są przyznawane według naszego uznania."
      },
      "process": {
        "title": "3. Proces zwrotu pieniędzy",
        "body": "Aby złożyć wniosek o zwrot pieniędzy, skontaktuj się z naszym zespołem wsparcia pod adresem support@legacyguard.com w ciągu 30 dni od daty zakupu. Podaj adres e-mail swojego konta i powód wniosku o zwrot pieniędzy."
      },
      "nonRefundable": {
        "title": "4. Usługi nie podlegające zwrotowi",
        "intro": "Następujące usługi nie podlegają zwrotowi:",
        "items": {
          "item1": "Subskrypcje miesięczne po pierwszych 30 dniach",
          "item2": "Jednorazowe opłaty za przetwarzanie dokumentów",
          "item3": "Usługi notarialne i doradztwo prawne"
        }
      },
      "processingTime": {
        "title": "5. Czas przetwarzania",
        "body": "Zatwierdzone zwroty zostaną przetworzone w ciągu 5–10 dni roboczych i zwrócone na oryginalną metodę płatności."
      }
    },
    "disclaimer": "[To jest symbol zastępczy. Aby stworzyć kompleksową Politykę Zwrotów, skonsultuj się z doradcą prawnym.]"
  }
}
