{
  "tos": {
    "title": "Pogoji storitve",
    "effectiveDate": "Datum začetka veljavnosti: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Sprejem pogojev",
        "body": "Z dostopom do storitve LegacyGuard Heritage Vault ali z njeno uporabo se strinjate, da vas zavezujejo ti pogoji storitve."
      },
      "service": {
        "title": "2. Opis storitve",
        "body": "LegacyGuard Heritage Vault nudi storitve upravljanja digitalne zapuščine, vključno s shranjevanjem dokumentov, ustvarjanjem oporok in varnim deljenjem pomembnih informacij z določenimi upravičenci."
      },
      "responsibilities": {
        "title": "3. Odgovornosti uporabnika",
        "body": "Odgovorni ste za ohranjanje zaupnosti poverilnic svojega računa in za vse dejavnosti, ki se izvajajo v okviru vašega računa."
      },
      "privacy": {
        "title": "4. Zasebnost in varstvo podatkov",
        "body": "Vaša zasebnost nam je pomembna. Prosimo, preberite naš pravilnik o zasebnosti, da boste razumeli, kako zbiramo, uporabljamo in varujemo vaše podatke."
      },
      "liability": {
        "title": "5. Omejitev odgovornosti",
        "body": "LegacyGuard Heritage Vault ne odgovarja za posredne, naključne, posebne, posledične ali kazenske škode, ki izhajajo iz vaše uporabe storitve."
      }
    },
    "disclaimer": "[To je vzorčno besedilo. Posvetujte se s pravnikom, da pripravite popolne pogoje storitve.]"
  },
  "refund": {
    "title": "Pravila vračila",
    "effectiveDate": "Datum začetka veljavnosti: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Pregled",
        "body": "Zadovoljstvo strank je naša prednostna naloga. Ta pravila vračila opisujejo merila in postopek za vložitev zahteve za vračilo."
      },
      "eligibility": {
        "title": "2. Upravičenost do vračila",
        "body": "Do vračila ste lahko upravičeni v 30 dneh od prvotnega nakupa, če niste obsežno uporabljali premium funkcij. Vračila se dodelijo po naši presoji."
      },
      "process": {
        "title": "3. Postopek vračila",
        "body": "Za začetek postopka vračila se obrnite na našo podporno ekipo na naslov support@legacyguard.com v 30 dneh od nakupa. Priložite e-poštni naslov svojega računa in razlog za zahtevo."
      },
      "nonRefundable": {
        "title": "4. Nevrnljive storitve",
        "intro": "Naslednje storitve niso predmet vračila:",
        "items": {
          "item1": "Mesečne naročnine po prvih 30 dneh",
          "item2": "Enkratne pristojbine za obdelavo dokumentov",
          "item3": "Notarske storitve in pravno svetovanje"
        }
      },
      "processingTime": {
        "title": "5. Čas obdelave",
        "body": "Odobrena vračila bodo obdelana v 5–10 delovnih dneh in vrnjena na prvotni način plačila."
      }
    },
    "disclaimer": "[To je vzorčno besedilo. Posvetujte se s pravnikom, da pripravite popolna pravila vračila.]"
  }
}
