{
  "general": {
    "something_wrong": "Er ging iets niet helemaal goed, maar maak je geen zorgen – je belangrijke informatie is veilig.",
    "try_again": "Laat me het nog eens voor je proberen",
    "contact_support": "Ik ben er om je te helpen als je assistentie nodig hebt",
    "no_data_lost": "Het goede nieuws is dat er niets verloren is gegaan van wat je hebt gedaan",
    "temporary_issue": "Dit lijkt een tijdelijk probleem te zijn dat snel opgelost moet zijn"
  },
  "network": {
    "connection_lost": "Het lijkt erop dat je internetverbinding is onderbroken. Je werk is opgeslagen en we maken automatisch opnieuw verbinding.",
    "slow_connection": "Je verbinding lijkt vandaag wat traag. Ik wacht geduldig terwijl alles laadt.",
    "server_busy": "Onze servers zijn op dit moment wat druk, maar ik blijf proberen je te helpen.",
    "timeout": "Dat duurde langer dan verwacht. Laat me een andere aanpak proberen."
  },
  "validation": {
    "required_field": "Je familie heeft deze informatie nodig – kun je me helpen dit in te vullen?",
    "invalid_email": "Dat e-mailadres lijkt niet helemaal correct. Wil je het voor me controleren?",
    "invalid_phone": "Ik heb moeite met dat telefoonnummerformaat. Kun je het op een andere manier invoeren?",
    "invalid_date": "Dat datumformaat werkt niet voor mij. Kun je het proberen als MM/DD/JJJJ?",
    "password_weak": "Laten we je wachtwoord iets sterker maken om de informatie van je familie extra te beschermen.",
    "file_too_large": "Dat bestand is een beetje te groot om te verwerken. Kun je een kleinere versie proberen?",
    "unsupported_file": "Ik kan niet werken met dit bestandstype. Kun je een PDF of afbeelding proberen?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Ik kon deze vermogensinformatie nu niet opslaan, maar ik blijf het proberen. De informatie van je familie is belangrijk voor mij.",
      "load_failed": "Ik heb moeite met het laden van je bezittingen. Laat me het zo nog eens proberen.",
      "delete_failed": "Ik kon dat item nu niet verwijderen. Wil je dat ik het nog eens probeer?"
    },
    "documents": {
      "upload_failed": "Dat document is niet correct geüpload. Maak je geen zorgen – ik help je het opnieuw te proberen.",
      "processing_failed": "Ik had moeite met het verwerken van dat document. Het bestand is veilig en ik probeer het opnieuw.",
      "access_failed": "Ik kan dat document nu niet openen. Laat me kijken hoe ik je kan helpen."
    },
    "family": {
      "save_failed": "Ik kon de gegevens van deze persoon nu niet opslaan. Laat me het opnieuw proberen – je vertrouwde kring is belangrijk.",
      "invite_failed": "Ik kon die uitnodiging nu niet versturen. Ik help je het opnieuw te proberen wanneer je klaar bent.",
      "access_failed": "Ik heb problemen met de toegangsinstellingen voor de familie. Laat me dit voor je regelen."
    },
    "will": {
      "generation_failed": "Ik kon je testament nu niet maken. Maak je geen zorgen – al je beslissingen zijn opgeslagen en ik probeer het opnieuw.",
      "save_failed": "Ik kon die wijzigingen in het testament nu niet opslaan. De vorige versie is veilig en ik blijf het proberen.",
      "legal_check_failed": "Ik kon de wettelijke vereisten nu niet controleren. Laat me het opnieuw proberen, of we kunnen hulp vragen aan ons juridisch team."
    }
  },
  "emotional_support": {
    "frustration": "Ik weet dat dit frustrerend is als je iets belangrijks voor je familie probeert te doen. Ik ben hier om het te laten werken.",
    "time_pressure": "Ik begrijp dat je niet veel tijd hebt voor technische problemen. Laat me dit snel voor je oplossen.",
    "overwhelm": "Technische problemen kunnen overweldigend voelen als je al bezig bent met belangrijk familieplanwerk. Haal even adem – ik regel dit.",
    "discouragement": "Laat je niet ontmoedigen door dit technische probleem. Wat je doet voor je familie is te belangrijk om op te geven."
  },
  "solutions": {
    "refresh_page": "Soms helpt het om de pagina te vernieuwen. Je werk is opgeslagen, dus je verliest niets.",
    "try_different_browser": "Als dit blijft gebeuren, probeer dan een andere browser. Chrome of Firefox werken meestal het best.",
    "check_internet": "Kun je je internetverbinding controleren? Soms is dat alles wat nodig is.",
    "contact_support": "Ik help je graag persoonlijk. Je kunt ons ondersteuningsteam bereiken, zij zorgen goed voor je.",
    "try_later": "Als je haast hebt, kun je het later opnieuw proberen. Alles wat je hebt gedaan is veilig opgeslagen.",
    "alternative_approach": "Laat me een andere manier voorstellen om dit te doen die misschien beter werkt."
  },
  "recovery": {
    "auto_save_worked": "Het goede nieuws is dat alles wat je hebt ingevoerd automatisch is opgeslagen.",
    "backup_available": "Ik heb een back-up van je werk van een paar minuten geleden als je die nodig hebt.",
    "progress_preserved": "Al je voortgang is bewaard gebleven – je hoeft niet opnieuw te beginnen.",
    "data_secure": "De informatie van je familie blijft volledig veilig ondanks dit technische probleem."
  }
}
