{
  "general": {
    "something_wrong": "Algo não funcionou bem, mas não se preocupe – as suas informações importantes estão seguras.",
    "try_again": "Deixe-me tentar novamente para si",
    "contact_support": "Estou aqui para ajudar, caso precise de assistência",
    "no_data_lost": "A boa notícia é que nada do que fez até agora foi perdido",
    "temporary_issue": "Parece ser um problema temporário que deverá ser resolvido rapidamente"
  },
  "network": {
    "connection_lost": "Parece que a sua ligação à internet foi interrompida. O seu trabalho está guardado e iremos reconectar automaticamente.",
    "slow_connection": "A sua ligação parece um pouco lenta hoje. Vou aguardar pacientemente enquanto tudo carrega.",
    "server_busy": "Os nossos servidores estão um pouco ocupados neste momento, mas continuarei a tentar ajudá-lo.",
    "timeout": "Isto demorou mais do que o esperado. Deixe-me tentar uma abordagem diferente."
  },
  "validation": {
    "required_field": "A sua família vai precisar desta informação – pode ajudar-me a preenchê-la?",
    "invalid_email": "Esse endereço de e-mail não parece correto. Pode confirmá-lo, por favor?",
    "invalid_phone": "Estou com dificuldade em reconhecer este formato de número de telefone. Pode introduzi-lo de outra forma?",
    "invalid_date": "Esse formato de data não está a funcionar. Pode tentar MM/DD/AAAA?",
    "password_weak": "Vamos tornar a sua palavra-passe um pouco mais forte para manter as informações da sua família ainda mais seguras.",
    "file_too_large": "Esse ficheiro é demasiado grande para eu processar. Pode tentar uma versão mais pequena?",
    "unsupported_file": "Não consigo trabalhar com esse tipo de ficheiro. Pode tentar um PDF ou uma imagem?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Não consegui guardar essa informação de ativos agora, mas continuarei a tentar. As informações da sua família são importantes para mim.",
      "load_failed": "Estou com dificuldades em carregar os seus ativos. Vou tentar novamente dentro de instantes.",
      "delete_failed": "Não consegui eliminar esse item neste momento. Quer que tente novamente?"
    },
    "documents": {
      "upload_failed": "Esse documento não foi carregado corretamente. Não se preocupe – vou ajudá-lo a tentar novamente.",
      "processing_failed": "Tive problemas ao processar esse documento. O ficheiro está seguro e tentarei de novo.",
      "access_failed": "Não consigo aceder a esse documento neste momento. Vou ver o que posso fazer para ajudar."
    },
    "family": {
      "save_failed": "Não consegui guardar as informações dessa pessoa agora. Vou tentar de novo – o seu círculo de confiança é importante.",
      "invite_failed": "Não consegui enviar esse convite agora. Vou ajudá-lo a tentar novamente quando estiver pronto.",
      "access_failed": "Estou com problemas nas definições de acesso da família. Vou tratar disso para si."
    },
    "will": {
      "generation_failed": "Não consegui criar o seu testamento agora. Não se preocupe – todas as suas decisões estão guardadas e voltarei a tentar.",
      "save_failed": "Não consegui guardar essas alterações ao testamento agora. A versão anterior está segura e continuarei a tentar.",
      "legal_check_failed": "Não consegui verificar os requisitos legais agora. Posso tentar novamente ou pedir ajuda à nossa equipa jurídica."
    }
  },
  "emotional_support": {
    "frustration": "Sei que é frustrante quando está a tentar fazer algo importante para a sua família. Estou aqui para ajudar a resolver isto.",
    "time_pressure": "Compreendo que não tenha muito tempo para problemas técnicos. Deixe-me tratar disto rapidamente.",
    "overwhelm": "Problemas técnicos podem ser avassaladores quando já está a lidar com questões importantes de planeamento familiar. Respire fundo – eu trato disto.",
    "discouragement": "Não deixe que este contratempo técnico o desanime. O que está a fazer pela sua família é demasiado importante para desistir."
  },
  "solutions": {
    "refresh_page": "Por vezes, atualizar a página ajuda. O seu trabalho está guardado, por isso não vai perder nada.",
    "try_different_browser": "Se isto continuar a acontecer, experimente usar outro navegador. O Chrome ou o Firefox costumam funcionar melhor.",
    "check_internet": "Pode verificar a sua ligação à internet? Por vezes é só isso que é necessário.",
    "contact_support": "Terei todo o gosto em ajudá-lo pessoalmente. Pode contactar a nossa equipa de apoio, que cuidará bem de si.",
    "try_later": "Se estiver com pressa, pode tentar novamente mais tarde. Tudo o que fez está guardado em segurança.",
    "alternative_approach": "Deixe-me sugerir outra forma de fazer isto que possa funcionar melhor."
  },
  "recovery": {
    "auto_save_worked": "A boa notícia é que tudo o que introduziu foi guardado automaticamente.",
    "backup_available": "Tenho uma cópia de segurança do seu trabalho de há alguns minutos, se precisar.",
    "progress_preserved": "Todo o seu progresso foi preservado – não terá de começar do zero.",
    "data_secure": "As informações da sua família continuam totalmente seguras apesar deste problema técnico."
  }
}

