{
  "general": {
    "something_wrong": "Bir şey tam olarak doğru çalışmadı ama endişelenmeyin – önemli bilgileriniz güvende.",
    "try_again": "Sizin için tekrar deneyeyim",
    "contact_support": "Yardıma ihtiyacınız olursa buradayım",
    "no_data_lost": "Güzel haber, üzerinde çalıştığınız hiçbir şey kaybolmadı",
    "temporary_issue": "Bu, kısa sürede çözülecek geçici bir sorun gibi görünüyor"
  },
  "network": {
    "connection_lost": "İnternet bağlantınız kesilmiş gibi görünüyor. Çalışmanız kaydedildi ve otomatik olarak yeniden bağlanacağız.",
    "slow_connection": "Bağlantınız bugün biraz yavaş görünüyor. Yüklenirken sabırla bekleyeceğim.",
    "server_busy": "Sunucularımız şu anda biraz meşgul, ancak size yardımcı olmaya devam edeceğim.",
    "timeout": "Beklenenden uzun sürdü. Farklı bir yöntem deneyeyim."
  },
  "validation": {
    "required_field": "Aileniz bu bilgilere ihtiyaç duyacak – bunu doldurmama yardımcı olabilir misiniz?",
    "invalid_email": "Bu e-posta adresi pek doğru görünmüyor. Benim için tekrar kontrol eder misiniz?",
    "invalid_phone": "Bu telefon numarası formatında sorun yaşıyorum. Farklı şekilde girmeyi deneyebilir misiniz?",
    "invalid_date": "Bu tarih formatı bana uymuyor. MM/DD/YYYY formatını deneyebilir misiniz?",
    "password_weak": "Ailenizin bilgilerini ekstra güvenli tutmak için şifrenizi biraz daha güçlü yapalım.",
    "file_too_large": "Bu dosya benim işlemem için biraz büyük. Daha küçük bir versiyonunu deneyebilir misiniz?",
    "unsupported_file": "Bu dosya türüyle çalışamıyorum. Bunun yerine PDF veya görsel deneyebilir misiniz?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Bu varlık bilgilerini şu anda kaydedemedim ama denemeye devam edeceğim. Ailenizin bilgileri benim için önemli.",
      "load_failed": "Şu anda varlıklarınızı yüklemekte sorun yaşıyorum. Birazdan tekrar deneyeyim.",
      "delete_failed": "Bu öğeyi şu anda kaldıramadım. Tekrar denememi ister misiniz?"
    },
    "documents": {
      "upload_failed": "Bu belge düzgün yüklenmedi. Endişelenmeyin – tekrar denemenize yardımcı olacağım.",
      "processing_failed": "Bu belgeyi işlerken sorun yaşadım. Dosya güvende ve tekrar deneyeceğim.",
      "access_failed": "Şu anda bu belgeye erişemiyorum. Size yardımcı olmak için ne yapabileceğime bakayım."
    },
    "family": {
      "save_failed": "Bu kişinin bilgilerini şu anda kaydedemedim. Tekrar deneyeyim – güvenilir çevreniz önemli.",
      "invite_failed": "Bu daveti şu anda gönderemedim. Hazır olduğunuzda tekrar denemenize yardımcı olacağım.",
      "access_failed": "Aile erişim ayarlarında sorun yaşıyorum. Bunu sizin için halledeyim."
    },
    "will": {
      "generation_failed": "Vasiyetinizi şu anda oluşturamadım. Endişelenmeyin – tüm kararlarınız kaydedildi ve tekrar deneyeceğim.",
      "save_failed": "Vasiyet değişikliklerini şu anda kaydedemedim. Önceki sürümünüz güvende ve denemeye devam edeceğim.",
      "legal_check_failed": "Yasal gereklilikleri şu anda doğrulayamıyorum. Tekrar deneyeyim ya da hukuk ekibimizden yardım alabiliriz."
    }
  },
  "emotional_support": {
    "frustration": "Aileniz için önemli bir şey yapmaya çalışırken bunun sinir bozucu olduğunu biliyorum. Bunu çalışır hale getirmek için buradayım.",
    "time_pressure": "Teknik sorunlar için fazla vaktiniz olmadığını anlıyorum. Bunu sizin için hızlıca halledeyim.",
    "overwhelm": "Zaten önemli aile planlamasıyla uğraşırken teknik sorunlar bunaltıcı gelebilir. Derin bir nefes alın – bunu halledeceğim.",
    "discouragement": "Bu teknik aksaklık sizi yıldırmasın. Aileniz için yaptığınız şey vazgeçilemeyecek kadar önemli."
  },
  "solutions": {
    "refresh_page": "Bazen sayfayı yenilemek işe yarar. Çalışmanız kaydedildi, bu yüzden hiçbir şey kaybetmeyeceksiniz.",
    "try_different_browser": "Bu devam ederse, farklı bir tarayıcı kullanmayı deneyin. Genellikle Chrome veya Firefox en iyi sonucu verir.",
    "check_internet": "İnternet bağlantınızı kontrol edebilir misiniz? Bazen tek gereken budur.",
    "contact_support": "Size kişisel olarak yardımcı olmak isterim. Destek ekibimize ulaşabilirsiniz, sizinle ilgileneceklerdir.",
    "try_later": "Acele ediyorsanız bunu daha sonra tekrar deneyebilirsiniz. Yaptığınız her şey güvenle kaydedildi.",
    "alternative_approach": "Bunu yapmanın daha iyi çalışabilecek farklı bir yolunu önereyim."
  },
  "recovery": {
    "auto_save_worked": "Güzel haber, girdiğiniz her şey otomatik olarak kaydedildi.",
    "backup_available": "İhtiyacınız olursa birkaç dakika önceki çalışmanızın yedeği var.",
    "progress_preserved": "Tüm ilerlemeniz korundu – yeniden başlamak zorunda değilsiniz.",
    "data_secure": "Bu teknik soruna rağmen ailenizin bilgileri tamamen güvende kalıyor."
  }
}

