{
  "tos": {
    "title": "Услови за користење",
    "effectiveDate": "Датум на стапување во сила: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Прифаќање на условите",
        "body": "Со пристапување или користење на LegacyGuard Heritage Vault, се согласувате да бидете обврзани со овие Услови за користење."
      },
      "service": {
        "title": "2. Опис на услугата",
        "body": "LegacyGuard Heritage Vault обезбедува услуги за управување со дигитално наследство, вклучувајќи складирање документи, изработка на тестаменти и безбедно споделување на важни информации со назначени корисници."
      },
      "responsibilities": {
        "title": "3. Одговорности на корисникот",
        "body": "Вие сте одговорни за чувањето на доверливоста на податоците за вашата сметка и за сите активности што се одвиваат преку неа."
      },
      "privacy": {
        "title": "4. Приватност и заштита на податоците",
        "body": "Вашата приватност ни е важна. Ве молиме прегледајте ја нашата Политика за приватност за да разберете како ги собираме, користиме и заштитуваме вашите информации."
      },
      "liability": {
        "title": "5. Ограничување на одговорноста",
        "body": "LegacyGuard Heritage Vault не е одговорен за индиректни, случајни, специјални, последователни или казнени штети што произлегуваат од вашето користење на услугата."
      }
    },
    "disclaimer": "[Ова е примерок на текст. Ве молиме консултирајте се со правен советник за изработка на целосни Услови за користење.]"
  },
  "refund": {
    "title": "Политика за поврат на средства",
    "effectiveDate": "Датум на стапување во сила: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Преглед",
        "body": "Задоволството на клиентите е наш приоритет. Оваа политика за поврат на средства ги опишува критериумите и процесот за поднесување барање."
      },
      "eligibility": {
        "title": "2. Право на поврат",
        "body": "Може да имате право на поврат на средства во рок од 30 дена од првичната куповка ако не сте ги користеле премиум функциите значително. Повратите се даваат по наша дискреција."
      },
      "process": {
        "title": "3. Процес на поврат",
        "body": "За да започнете барање за поврат, контактирајте го нашиот тим за поддршка на support@legacyguard.com во рок од 30 дена од куповката. Вклучете ја е-поштата на вашата сметка и причината за барањето."
      },
      "nonRefundable": {
        "title": "4. Услуги кои не се враќаат",
        "intro": "Следните услуги не се предмет на поврат:",
        "items": {
          "item1": "Месечни претплати по првите 30 дена",
          "item2": "Еднократни такси за обработка на документи",
          "item3": "Нотарски и правни консултантски услуги"
        }
      },
      "processingTime": {
        "title": "5. Време на обработка",
        "body": "Одобрените поврати ќе бидат обработени во рок од 5–10 работни дена и вратени на оригиналниот метод на плаќање."
      }
    },
    "disclaimer": "[Ова е примерок на текст. Ве молиме консултирајте се со правен советник за изработка на целосна Политика за поврат на средства.]"
  }
}
