{
  "tos": {
    "title": "Услови за користење",
    "effectiveDate": "Датум на стапување во сила: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Прифаќање на условите",
        "body": "Со пристапување или користење на LegacyGuard Heritage Vault, се согласувате да бидете обврзани со овие Услови за користење."
      },
      "service": {
        "title": "2. Опис на услугата",
        "body": "LegacyGuard Heritage Vault обезбедува услуги за управување со дигитално наследство, вклучувајќи складирање документи, генерирање тестаменти и безбедно споделување на важни информации со назначените корисници."
      },
      "responsibilities": {
        "title": "3. Одговорности на корисникот",
        "body": "Вие сте одговорни за одржување на доверливоста на податоците за вашата сметка и за сите активности што се случуваат преку вашата сметка."
      },
      "privacy": {
        "title": "4. Приватност и заштита на податоци",
        "body": "Вашата приватност ни е важна. Ве молиме погледнете ја нашата Политика за приватност за да разберете како ги собираме, користиме и заштитуваме вашите информации."
      },
      "liability": {
        "title": "5. Ограничување на одговорноста",
        "body": "LegacyGuard Heritage Vault нема да биде одговорен за какви било индиректни, случајни, посебни, последични или казнени штети што произлегуваат од вашето користење на услугата."
      }
    },
    "disclaimer": "[Ова е резервирано место. Ве молиме консултирајте се со правен советник за да креирате сеопфатни Услови за користење.]"
  },
  "refund": {
    "title": "Политика за враќање на средства",
    "effectiveDate": "Датум на стапување во сила: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Преглед",
        "body": "Задоволството на клиентите е наш приоритет. Оваа Политика за враќање на средства ги наведува критериумите и процесот за барање враќање на средства."
      },
      "eligibility": {
        "title": "2. Право на враќање на средства",
        "body": "Може да имате право на враќање на парите во рок од 30 дена од вашата првична нарачка ако не сте ги користеле премиум функциите во голема мера. Повраќањето на парите се врши по наша дискреција."
      },
      "process": {
        "title": "3. Процес на враќање на средства",
        "body": "За да поднесете барање за враќање на средства, контактирајте го нашиот тим за поддршка на support@legacyguard.com во рок од 30 дена од купувањето. Наведете ја е-поштата на вашата сметка и причината за барањето за враќање на средства."
      },
      "nonRefundable": {
        "title": "4. Услуги што не се враќаат",
        "intro": "Следните услуги не се рефундираат:",
        "items": {
          "item1": "Месечни претплати по првите 30 дена",
          "item2": "Еднократни такси за обработка на документи",
          "item3": "Нотаризација и правни консултантски услуги"
        }
      },
      "processingTime": {
        "title": "5. Време на обработка",
        "body": "Одобрените повратни средства ќе бидат обработени во рок од 5-10 работни дена и ќе бидат кредитирани на вашиот оригинален начин на плаќање."
      }
    },
    "disclaimer": "[Ова е резервирано место. Ве молиме консултирајте се со правен советник за да креирате сеопфатна Политика за враќање на средства.]"
  }
}
