{
  "tos": {
    "title": "Termini tas-Servizz",
    "effectiveDate": "Data tal-Bidu: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Aċċettazzjoni tat-Termini",
        "body": "Billi taċċessa jew tuża LegacyGuard Heritage Vault, inti taqbel li tkun marbut b'dawn it-Termini tas-Servizz."
      },
      "service": {
        "title": "2. Deskrizzjoni tas-Servizz",
        "body": "LegacyGuard Heritage Vault jipprovdi servizzi ta’ ġestjoni tal-wirt diġitali, inkluż ħażna ta’ dokumenti, ġenerazzjoni ta’ testmenti u qsim sigur ta’ informazzjoni importanti ma’ benefiċjarji nominati."
      },
      "responsibilities": {
        "title": "3. Responsabbiltajiet tal-Utent",
        "body": "Inti responsabbli biex iżżomm il-kunfidenzjalità tal-kredenzjali tal-kont tiegħek u għal kull attività li sseħħ taħt il-kont tiegħek."
      },
      "privacy": {
        "title": "4. Privatezza u Protezzjoni tad-Data",
        "body": "Il-privatezza tiegħek hija importanti għalina. Jekk jogħġbok irrevedi l-Politika tal-Privatezza tagħna biex tifhem kif niġbru, nużaw u nipproteġu l-informazzjoni tiegħek."
      },
      "liability": {
        "title": "5. Limitazzjoni tar-Responsabbiltà",
        "body": "LegacyGuard Heritage Vault mhux se jkun responsabbli għal ħsarat indiretti, inċidentali, speċjali, konsekuttivi jew puni ttiv li jirriżultaw mill-użu tas-servizz."
      }
    },
    "disclaimer": "[Dan huwa test ta’ sostituzzjoni. Jekk jogħġbok ikkonsulta ma’ konsulent legali biex toħloq Termini tas-Servizz kompluti.]"
  },
  "refund": {
    "title": "Politika ta’ Rifużjoni",
    "effectiveDate": "Data tal-Bidu: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Ħarsa Ġenerali",
        "body": "Is-sodisfazzjon tal-klijent huwa prijorità tagħna. Din il-Politika ta’ Rifużjoni tiddeskrivi l-kriterji u l-proċess biex tagħmel talba għal rifużjoni."
      },
      "eligibility": {
        "title": "2. Eliġibbiltà għar-Rifużjoni",
        "body": "Tista’ tkun eliġibbli għal rifużjoni fi żmien 30 jum mix-xiri inizjali tiegħek jekk ma użajtx b’mod estensiv il-karatteristiċi premium. Ir-rifużjonijiet jingħataw skont id-diskrezzjoni tagħna."
      },
      "process": {
        "title": "3. Proċess tar-Rifużjoni",
        "body": "Biex tibda talba għal rifużjoni, jekk jogħġbok ikkuntattja lit-tim ta’ appoġġ tagħna fuq support@legacyguard.com fi żmien 30 jum mix-xiri. Inkludi l-email tal-kont tiegħek u r-raġuni għat-talba."
      },
      "nonRefundable": {
        "title": "4. Servizzi Mhux Rifużibbli",
        "intro": "Is-servizzi li ġejjin mhumiex eliġibbli għar-rifużjoni:",
        "items": {
          "item1": "Abbonamenti ta’ kull xahar wara l-ewwel 30 jum",
          "item2": "Ħlasijiet ta’ darba għall-ipproċessar ta’ dokumenti",
          "item3": "Servizzi ta’ notarizzazzjoni u konsultazzjoni legali"
        }
      },
      "processingTime": {
        "title": "5. Ħin tal-Ipproċessar",
        "body": "Ir-rifużjonijiet approvati jiġu pproċessati fi żmien 5–10 ijiem tax-xogħol u jiġu kkreditati fuq il-metodu ta’ ħlas oriġinali tiegħek."
      }
    },
    "disclaimer": "[Dan huwa test ta’ sostituzzjoni. Jekk jogħġbok ikkonsulta ma’ konsulent legali biex toħloq Politika ta’ Rifużjoni kompluta.]"
  }
}
