{
  "general": {
    "something_wrong": "Нещо не се получи както трябва, но не се притеснявайте – важната ви информация е в безопасност.",
    "try_again": "Нека опитам отново за вас",
    "contact_support": "Тук съм, за да помогна, ако имате нужда от съдействие",
    "no_data_lost": "Добрата новина е, че нищо от въведеното от вас не е загубено",
    "temporary_issue": "Изглежда, че това е временен проблем, който скоро ще бъде отстранен"
  },
  "network": {
    "connection_lost": "Изглежда интернет връзката ви беше прекъсната. Работата ви е запазена и ще се свържем отново автоматично.",
    "slow_connection": "Връзката ви днес е малко бавна. Ще изчакам търпеливо да се зареди всичко.",
    "server_busy": "Сървърите ни са малко натоварени в момента, но ще продължа да се опитвам да ви помогна.",
    "timeout": "Това отне повече време от очакваното. Нека опитам по различен начин."
  },
  "validation": {
    "required_field": "Семейството ви ще има нужда от тази информация – бихте ли ми помогнали да я попълним?",
    "invalid_email": "Този имейл адрес не изглежда съвсем правилен. Може ли да го проверите отново?",
    "invalid_phone": "Имам затруднение с този формат на телефонен номер. Опитайте да го въведете по друг начин.",
    "invalid_date": "Този формат на дата не ми върши работа. Може ли да опитате с ММ/ДД/ГГГГ?",
    "password_weak": "Нека направим паролата ви малко по-сигурна, за да защитим допълнително информацията на семейството ви.",
    "file_too_large": "Този файл е твърде голям, за да го обработя. Може ли да опитате с по-малък?",
    "unsupported_file": "Не мога да работя с този тип файл. Може ли да опитате с PDF или изображение?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Не успях да запазя информацията за този актив в момента, но ще продължа да опитвам. Информацията за семейството ви е важна за мен.",
      "load_failed": "Имам затруднение при зареждането на активите ви. Ще опитам отново след малко.",
      "delete_failed": "Не успях да премахна този елемент сега. Искате ли да опитам пак?"
    },
    "documents": {
      "upload_failed": "Документът не се качи правилно. Не се тревожете – ще ви помогна да опитаме отново.",
      "processing_failed": "Имах проблем с обработката на този документ. Файлът е запазен и ще опитам пак.",
      "access_failed": "В момента нямам достъп до този документ. Нека видя как мога да помогна."
    },
    "family": {
      "save_failed": "Не успях да запазя информацията за този човек. Нека опитаме отново – вашият доверен кръг е важен.",
      "invite_failed": "Не успях да изпратя тази покана в момента. Ще ви помогна да опитаме пак, когато сте готови.",
      "access_failed": "Имам затруднение с настройките за достъп на семейството. Нека работя по това за вас."
    },
    "will": {
      "generation_failed": "Не успях да създам завещанието ви в момента. Не се тревожете – всички решения са запазени и ще опитам отново.",
      "save_failed": "Не успях да запазя промените в завещанието в момента. Предишната версия е в безопасност и ще продължа да опитвам.",
      "legal_check_failed": "Не успях да проверя правните изисквания в момента. Нека опитам отново или да се обърнем към нашия юридически екип."
    }
  },
  "emotional_support": {
    "frustration": "Знам, че е неприятно, когато се опитвате да направите нещо важно за семейството си. Тук съм, за да ви помогна да го осъществим.",
    "time_pressure": "Разбирам, че нямате много време за технически проблеми. Нека се погрижа за това бързо.",
    "overwhelm": "Техническите проблеми могат да изглеждат натоварващи, когато вече мислите за важни семейни планове. Поемете си дъх – аз ще се погрижа.",
    "discouragement": "Не позволявайте на този технически проблем да ви обезкуражи. Това, което правите за семейството си, е твърде важно, за да се откажете."
  },
  "solutions": {
    "refresh_page": "Понякога опресняването на страницата помага. Работата ви е запазена, така че няма да загубите нищо.",
    "try_different_browser": "Ако това продължава да се случва, опитайте с друг браузър. Chrome или Firefox обикновено работят най-добре.",
    "check_internet": "Може ли да проверите интернет връзката си? Понякога това е всичко, което трябва.",
    "contact_support": "Ще се радвам да ви помогна лично. Можете да се свържете с нашия екип за поддръжка, който ще се погрижи за вас.",
    "try_later": "Ако бързате, може да опитате пак по-късно. Всичко, което сте направили, е безопасно запазено.",
    "alternative_approach": "Нека ви предложа друг начин за изпълнение, който може да проработи по-добре."
  },
  "recovery": {
    "auto_save_worked": "Добрата новина е, че всичко, което въведохте, беше автоматично запазено.",
    "backup_available": "Имам резервно копие на работата ви отпреди няколко минути, ако ви е нужно.",
    "progress_preserved": "Целият ви напредък е запазен – няма да се налага да започвате отначало.",
    "data_secure": "Информацията на семейството ви остава напълно защитена въпреки този технически проблем."
  }
}
