{
  "tos": {
    "title": "Uvjeti korištenja",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Prihvaćanje uvjeta",
        "body": "Pristupanjem ili korištenjem LegacyGuard Heritage Vaulta pristajete na ove Uvjete korištenja."
      },
      "service": {
        "title": "2. Opis usluge",
        "body": "LegacyGuard Heritage Vault pruža usluge upravljanja digitalnom ostavinom, uključujući pohranu dokumenata, izradu oporuka i sigurno dijeljenje važnih informacija s određenim korisnicima."
      },
      "responsibilities": {
        "title": "3. Odgovornosti korisnika",
        "body": "Odgovorni ste za čuvanje povjerljivosti podataka svog računa i za sve aktivnosti koje se odvijaju putem njega."
      },
      "privacy": {
        "title": "4. Privatnost i zaštita podataka",
        "body": "Vaša je privatnost važna za nas. Molimo pročitajte našu Politiku privatnosti kako biste razumjeli kako prikupljamo, koristimo i štitimo vaše podatke."
      },
      "liability": {
        "title": "5. Ograničenje odgovornosti",
        "body": "LegacyGuard Heritage Vault ne odgovara za neizravne, slučajne, posebne, posljedične ili kaznene štete proizašle iz vašeg korištenja usluge."
      }
    },
    "disclaimer": "[Ovo je ogledni tekst. Posavjetujte se s pravnikom kako biste izradili cjelovite Uvjete korištenja.]"
  },
  "refund": {
    "title": "Pravila povrata novca",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Pregled",
        "body": "Zadovoljstvo korisnika naš je prioritet. Ova Pravila povrata novca opisuju kriterije i postupak za podnošenje zahtjeva."
      },
      "eligibility": {
        "title": "2. Pravo na povrat novca",
        "body": "Možete imati pravo na povrat novca u roku od 30 dana od prve kupnje ako niste značajno koristili premium značajke. Povrat novca daje se prema našem nahođenju."
      },
      "process": {
        "title": "3. Postupak povrata novca",
        "body": "Za pokretanje zahtjeva obratite se našem timu za podršku na support@legacyguard.com u roku od 30 dana od kupnje. Uključite adresu e-pošte svog računa i razlog zahtjeva."
      },
      "nonRefundable": {
        "title": "4. Usluge bez povrata",
        "intro": "Povrat novca nije moguć za sljedeće usluge:",
        "items": {
          "item1": "Mjesečne pretplate nakon prvih 30 dana",
          "item2": "Jednokratne naknade za obradu dokumenata",
          "item3": "Usluge ovjere i pravnog savjetovanja"
        }
      },
      "processingTime": {
        "title": "5. Vrijeme obrade",
        "body": "Odobreni povrati bit će obrađeni u roku od 5–10 radnih dana i vraćeni na izvorni način plaćanja."
      }
    },
    "disclaimer": "[Ovo je ogledni tekst. Posavjetujte se s pravnikom kako biste izradili cjelovita Pravila povrata novca.]"
  }
}
