{
  "general": {
    "something_wrong": "Xi ħaġa ma maritx sew, imma tinkwetax – l-informazzjoni importanti tiegħek hija sigura.",
    "try_again": "Ħallini nipprova mill-ġdid għalik",
    "contact_support": "Jiena hawn biex ngħinek jekk għandek bżonn l-għajnuna",
    "no_data_lost": "L-aħbar tajba hija li xejn minn dak li ħdimt fuqu ma ntilef",
    "temporary_issue": "Jidher li dan huwa problema temporanja li għandha tissolva malajr"
  },
  "network": {
    "connection_lost": "Jidher li l-konnessjoni tal-internet tiegħek ġiet interrotta. Ix-xogħol tiegħek huwa salvat, u nerġgħu nikkonnettjaw awtomatikament.",
    "slow_connection": "Il-konnessjoni tiegħek tidher ftit bil-mod illum. Se nistenna bil-paċenzja sakemm kollox jitgħabba.",
    "server_busy": "Is-servers tagħna huma ftit okkupati bħalissa, imma se nibqa’ nipprova ngħinek.",
    "timeout": "Dan ħa aktar żmien milli stennejna. Ħallini nipprova approċċ differenti."
  },
  "validation": {
    "required_field": "Il-familja tiegħek se jkollha bżonn din l-informazzjoni – tista’ tgħinni nimlewh?",
    "invalid_email": "Dak l-indirizz tal-email jidher li mhux korrett. Tista’ tivverifikah mill-ġdid għalija?",
    "invalid_phone": "Qed ikolli diffikultà bil-format tan-numru tat-telefon. Tista’ tippruvah mod ieħor?",
    "invalid_date": "Dak il-format tad-data mhux qed jaħdem għalija. Tista’ tipprova MM/ĠG/SENA?",
    "password_weak": "Ejjew nagħmlu l-password tiegħek ftit iktar b’saħħitha biex inżidu s-sigurtà tal-informazzjoni tal-familja tiegħek.",
    "file_too_large": "Dak il-fajl huwa kemmxejn kbir wisq biex inlaħħaq miegħu. Tista’ tipprova verżjoni iżgħar?",
    "unsupported_file": "Ma nistax naħdem ma’ dan it-tip ta’ fajl. Tista’ tipprova PDF jew immaġni minflok?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Ma stajtx insalva l-informazzjoni tal-assi bħalissa, imma se nibqa’ nipprova. L-informazzjoni tal-familja tiegħek hija importanti għalija.",
      "load_failed": "Qed ikolli problema biex nitella’ l-assi tiegħek bħalissa. Ħallini nipprova mill-ġdid fi ftit.",
      "delete_failed": "Ma stajtx inħassar dik l-oġġett bħalissa. Tixtieqni nipprova mill-ġdid?"
    },
    "documents": {
      "upload_failed": "Dak id-dokument ma telax sew. Tinkwetax – ngħinek tipprova mill-ġdid.",
      "processing_failed": "Kelli problema biex nipproċessa dak id-dokument. Il-fajl huwa sigur u se nipprova mill-ġdid.",
      "access_failed": "Ma nistax naċċessa dak id-dokument bħalissa. Ħallini nara kif nista’ ngħinek."
    },
    "family": {
      "save_failed": "Ma stajtx insalva l-informazzjoni ta’ din il-persuna bħalissa. Ħallini nipprova mill-ġdid – iċ-ċirku ta’ fiduċja tiegħek huwa importanti.",
      "invite_failed": "Ma stajtx nibgħat dik l-istedina bħalissa. Ngħinek tipprova mill-ġdid meta tkun lest.",
      "access_failed": "Qed ikolli problema bis-settings tal-aċċess tal-familja. Ħallini naħdem fuqha għalik."
    },
    "will": {
      "generation_failed": "Ma stajtx noħloq il-wirt tiegħek bħalissa. Tinkwetax – id-deċiżjonijiet kollha tiegħek huma salvati u se nipprova mill-ġdid.",
      "save_failed": "Ma stajtx insalva dawk il-bidliet fil-wirt bħalissa. Il-verżjoni ta’ qabel hija sigura u se nibqa’ nipprova.",
      "legal_check_failed": "Ma stajtx nivverifika r-rekwiżiti legali bħalissa. Ħallini nipprova mill-ġdid jew nikkuntattjaw lit-tim legali tagħna."
    }
  },
  "emotional_support": {
    "frustration": "Naf li hu frustranti meta tipprova tagħmel xi ħaġa importanti għall-familja tiegħek. Jiena hawn biex ngħinek tagħmilha taħdem.",
    "time_pressure": "Nifhem li m’għandekx ħafna ħin għall-problemi tekniċi. Ħallini nindirizza dan malajr għalik.",
    "overwhelm": "Il-problemi tekniċi jistgħu jħossuhom kbira meta diġà qed tieħu ħsieb ippjanar importanti għall-familja. Ħu nifs – jien se nieħu ħsieb dan.",
    "discouragement": "Tħallix dan l-inkonvenjent tekniku jiskoraġġik. Dak li qed tagħmel għall-familja tiegħek huwa wisq importanti biex taqta’ qalbek."
  },
  "solutions": {
    "refresh_page": "Xi kultant l-aġġornament tal-paġna jgħin. Ix-xogħol tiegħek huwa salvat, għalhekk ma titlef xejn.",
    "try_different_browser": "Jekk dan jibqa’ jiġri, ipprova tuża browser differenti. Chrome jew Firefox ġeneralment jaħdmu l-aħjar.",
    "check_internet": "Tista’ tiċċekkja l-konnessjoni tal-internet tiegħek? Xi drabi dak hu biżżejjed.",
    "contact_support": "Nixtieq ngħinek personalment. Tista’ tikkuntattja lit-tim ta’ appoġġ tagħna li se jieħu ħsiebek sew.",
    "try_later": "Jekk inti mgħaġġel, tista’ tipprova dan aktar tard. Kollox li għamilt huwa salv.",
    "alternative_approach": "Ħallini nipproponi mod differenti kif nagħmlu dan li jista’ jaħdem aħjar."
  },
  "recovery": {
    "auto_save_worked": "L-aħbar tajba hija li kollox li daħħalt ġie salvat awtomatikament.",
    "backup_available": "Għandi kopja ta’ backup tax-xogħol tiegħek minn ftit minuti ilu jekk għandek bżonnha.",
    "progress_preserved": "Il-progress kollu tiegħek ġie ppreservat – mhux se jkollok tibda mill-bidu.",
    "data_secure": "L-informazzjoni tal-familja tiegħek tibqa’ kompletament sigura minkejja din il-problema teknika."
  }
}

