{
  "tos": {
    "title": "Termini di servizio",
    "effectiveDate": "Data di entrata in vigore: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Accettazione dei Termini",
        "body": "Accedendo o utilizzando LegacyGuard Heritage Vault, accetti di essere vincolato dai presenti Termini di servizio."
      },
      "service": {
        "title": "2. Descrizione del servizio",
        "body": "LegacyGuard Heritage Vault fornisce servizi di gestione del patrimonio digitale, tra cui l'archiviazione dei documenti, la generazione di testamenti e la condivisione sicura di informazioni importanti con i beneficiari designati."
      },
      "responsibilities": {
        "title": "3. Responsabilità dell'utente",
        "body": "Sei responsabile del mantenimento della riservatezza delle credenziali del tuo account e di tutte le attività che si svolgono tramite il tuo account."
      },
      "privacy": {
        "title": "4. Privacy e protezione dei dati",
        "body": "La tua privacy è importante per noi. Ti invitiamo a consultare la nostra Informativa sulla privacy per comprendere come raccogliamo, utilizziamo e proteggiamo le tue informazioni."
      },
      "liability": {
        "title": "5. Limitazione di responsabilità",
        "body": "LegacyGuard Heritage Vault non sarà responsabile per eventuali danni indiretti, incidentali, speciali, consequenziali o punitivi derivanti dall'utilizzo del servizio."
      }
    },
    "disclaimer": "[Questo è un segnaposto. Si prega di consultare un consulente legale per creare Termini di servizio completi.]"
  },
  "refund": {
    "title": "Politica di rimborso",
    "effectiveDate": "Data di entrata in vigore: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Panoramica",
        "body": "La soddisfazione del cliente è la nostra priorità. La presente Politica di Rimborso descrive i criteri e la procedura per richiedere un rimborso."
      },
      "eligibility": {
        "title": "2. Idoneità al rimborso",
        "body": "Potresti avere diritto a un rimborso entro 30 giorni dall'acquisto iniziale se non hai utilizzato ampiamente le funzionalità premium. I rimborsi sono concessi a nostra discrezione."
      },
      "process": {
        "title": "3. Procedura di rimborso",
        "body": "Per avviare una richiesta di rimborso, contatta il nostro team di supporto all'indirizzo support@legacyguard.com entro 30 giorni dall'acquisto. Includi l'indirizzo email del tuo account e il motivo della richiesta di rimborso."
      },
      "nonRefundable": {
        "title": "4. Servizi non rimborsabili",
        "intro": "I seguenti servizi non sono rimborsabili:",
        "items": {
          "item1": "Abbonamenti mensili dopo i primi 30 giorni",
          "item2": "Commissioni una tantum per l'elaborazione dei documenti",
          "item3": "Servizi di notarizzazione e consulenza legale"
        }
      },
      "processingTime": {
        "title": "5. Tempo di elaborazione",
        "body": "I rimborsi approvati verranno elaborati entro 5-10 giorni lavorativi e accreditati sul metodo di pagamento originale."
      }
    },
    "disclaimer": "[Questo è un segnaposto. Si prega di consultare un consulente legale per creare una Politica di rimborso completa.]"
  }
}
