{
  "general": {
    "something_wrong": "Κάτι δεν λειτούργησε σωστά, αλλά μην ανησυχείτε – οι σημαντικές πληροφορίες σας είναι ασφαλείς.",
    "try_again": "Αφήστε με να το δοκιμάσω ξανά για εσάς",
    "contact_support": "Είμαι εδώ για να βοηθήσω αν χρειάζεστε υποστήριξη",
    "no_data_lost": "Τα καλά νέα είναι ότι τίποτα από τη δουλειά σας δεν έχει χαθεί",
    "temporary_issue": "Φαίνεται να είναι ένα προσωρινό πρόβλημα που θα λυθεί σύντομα"
  },
  "network": {
    "connection_lost": "Φαίνεται ότι η σύνδεσή σας στο διαδίκτυο διακόπηκε. Η εργασία σας έχει αποθηκευτεί και θα επανασυνδεθούμε αυτόματα.",
    "slow_connection": "Η σύνδεσή σας φαίνεται λίγο αργή σήμερα. Θα περιμένω υπομονετικά μέχρι να φορτώσουν όλα.",
    "server_busy": "Οι διακομιστές μας είναι λίγο απασχολημένοι αυτή τη στιγμή, αλλά θα συνεχίσω να προσπαθώ να σας βοηθήσω.",
    "timeout": "Αυτό πήρε περισσότερο χρόνο από το αναμενόμενο. Αφήστε με να δοκιμάσω μια διαφορετική προσέγγιση."
  },
  "validation": {
    "required_field": "Η οικογένειά σας θα χρειαστεί αυτές τις πληροφορίες – μπορείτε να με βοηθήσετε να τις συμπληρώσουμε;",
    "invalid_email": "Αυτή η διεύθυνση email δεν φαίνεται σωστή. Μπορείτε να την ελέγξετε ξανά;",
    "invalid_phone": "Αντιμετωπίζω πρόβλημα με αυτήν τη μορφή αριθμού τηλεφώνου. Μπορείτε να το εισαγάγετε με διαφορετικό τρόπο;",
    "invalid_date": "Αυτή η μορφή ημερομηνίας δεν λειτουργεί για μένα. Μπορείτε να δοκιμάσετε ΜΜ/ΗΗ/ΕΕΕΕ;",
    "password_weak": "Ας κάνουμε τον κωδικό πρόσβασής σας λίγο πιο ισχυρό για να διατηρήσουμε τις πληροφορίες της οικογένειάς σας ακόμη πιο ασφαλείς.",
    "file_too_large": "Αυτό το αρχείο είναι λίγο μεγάλο για να το χειριστώ. Μπορείτε να δοκιμάσετε μια μικρότερη έκδοση;",
    "unsupported_file": "Δεν μπορώ να δουλέψω με αυτόν τον τύπο αρχείου. Μπορείτε να δοκιμάσετε ένα PDF ή μια εικόνα;"
  },
  "contextual": {
    "assets": {
      "save_failed": "Δεν μπόρεσα να αποθηκεύσω τις πληροφορίες αυτού του περιουσιακού στοιχείου αυτή τη στιγμή, αλλά θα συνεχίσω να προσπαθώ. Οι πληροφορίες της οικογένειάς σας είναι σημαντικές για μένα.",
      "load_failed": "Αντιμετωπίζω πρόβλημα με τη φόρτωση των περιουσιακών σας στοιχείων. Αφήστε με να δοκιμάσω ξανά σε λίγο.",
      "delete_failed": "Δεν μπόρεσα να αφαιρέσω αυτό το στοιχείο αυτή τη στιγμή. Θέλετε να το δοκιμάσω ξανά;"
    },
    "documents": {
      "upload_failed": "Αυτό το έγγραφο δεν μεταφορτώθηκε σωστά. Μην ανησυχείτε – θα σας βοηθήσω να το δοκιμάσετε ξανά.",
      "processing_failed": "Αντιμετώπισα πρόβλημα κατά την επεξεργασία αυτού του εγγράφου. Το αρχείο είναι ασφαλές και θα προσπαθήσω ξανά.",
      "access_failed": "Δεν μπορώ να αποκτήσω πρόσβαση σε αυτό το έγγραφο αυτή τη στιγμή. Αφήστε με να δω τι μπορώ να κάνω για να βοηθήσω."
    },
    "family": {
      "save_failed": "Δεν μπόρεσα να αποθηκεύσω τις πληροφορίες αυτού του ατόμου αυτή τη στιγμή. Ας το δοκιμάσουμε ξανά – ο κύκλος εμπιστοσύνης σας είναι σημαντικός.",
      "invite_failed": "Δεν μπόρεσα να στείλω αυτή την πρόσκληση αυτή τη στιγμή. Θα σας βοηθήσω να το δοκιμάσετε ξανά όταν είστε έτοιμοι.",
      "access_failed": "Αντιμετωπίζω πρόβλημα με τις ρυθμίσεις πρόσβασης της οικογένειας. Αφήστε με να το αναλάβω."
    },
    "will": {
      "generation_failed": "Δεν μπόρεσα να δημιουργήσω τη διαθήκη σας αυτή τη στιγμή. Μην ανησυχείτε – όλες οι αποφάσεις σας έχουν αποθηκευτεί και θα δοκιμάσω ξανά.",
      "save_failed": "Δεν μπόρεσα να αποθηκεύσω αυτές τις αλλαγές στη διαθήκη αυτή τη στιγμή. Η προηγούμενη έκδοση είναι ασφαλής και θα συνεχίσω να προσπαθώ.",
      "legal_check_failed": "Δεν μπόρεσα να ελέγξω τις νομικές απαιτήσεις αυτή τη στιγμή. Αφήστε με να δοκιμάσω ξανά ή μπορούμε να ζητήσουμε βοήθεια από τη νομική μας ομάδα."
    }
  },
  "emotional_support": {
    "frustration": "Ξέρω ότι είναι απογοητευτικό όταν προσπαθείτε να κάνετε κάτι σημαντικό για την οικογένειά σας. Είμαι εδώ για να σας βοηθήσω να το πετύχετε.",
    "time_pressure": "Καταλαβαίνω ότι δεν έχετε πολύ χρόνο για τεχνικά προβλήματα. Αφήστε με να το χειριστώ γρήγορα για εσάς.",
    "overwhelm": "Τα τεχνικά προβλήματα μπορεί να φαίνονται συντριπτικά όταν ήδη ασχολείστε με σημαντικό οικογενειακό προγραμματισμό. Πάρτε μια ανάσα – το έχω αναλάβει.",
    "discouragement": "Μην αφήσετε αυτό το τεχνικό εμπόδιο να σας αποθαρρύνει. Αυτό που κάνετε για την οικογένειά σας είναι πολύ σημαντικό για να τα παρατήσετε."
  },
  "solutions": {
    "refresh_page": "Μερικές φορές η ανανέωση της σελίδας βοηθάει. Η εργασία σας έχει αποθηκευτεί, οπότε δεν θα χάσετε τίποτα.",
    "try_different_browser": "Αν αυτό συνεχίζεται, δοκιμάστε να χρησιμοποιήσετε διαφορετικό πρόγραμμα περιήγησης. Το Chrome ή το Firefox συνήθως λειτουργούν καλύτερα.",
    "check_internet": "Μπορείτε να ελέγξετε τη σύνδεσή σας στο διαδίκτυο; Μερικές φορές αυτό αρκεί.",
    "contact_support": "Θα χαρώ να σας βοηθήσω προσωπικά. Μπορείτε να επικοινωνήσετε με την ομάδα υποστήριξής μας, που θα σας φροντίσει κατάλληλα.",
    "try_later": "Αν βιάζεστε, μπορείτε να το δοκιμάσετε ξανά αργότερα. Ό,τι έχετε κάνει είναι ασφαλώς αποθηκευμένο.",
    "alternative_approach": "Αφήστε με να σας προτείνω έναν διαφορετικό τρόπο για να το κάνουμε αυτό, που μπορεί να λειτουργήσει καλύτερα."
  },
  "recovery": {
    "auto_save_worked": "Τα καλά νέα είναι ότι όλα όσα εισαγάγατε αποθηκεύτηκαν αυτόματα.",
    "backup_available": "Έχω ένα αντίγραφο ασφαλείας της δουλειάς σας από πριν λίγα λεπτά, αν το χρειάζεστε.",
    "progress_preserved": "Όλη η πρόοδός σας έχει διατηρηθεί – δεν θα χρειαστεί να ξεκινήσετε από την αρχή.",
    "data_secure": "Οι πληροφορίες της οικογένειάς σας παραμένουν πλήρως ασφαλείς παρά αυτό το τεχνικό πρόβλημα."
  }
}
