{
  "tos": {
    "title": "Uslovi korišćenja",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Prihvatanje uslova",
        "body": "Pristupanjem ili korišćenjem LegacyGuard Heritage Vault-a, slažete se da budete vezani ovim Uslovima korišćenja."
      },
      "service": {
        "title": "2. Opis usluge",
        "body": "LegacyGuard Heritage Vault pruža usluge upravljanja digitalnim nasleđem, uključujući skladištenje dokumenata, generisanje testamenta i sigurno deljenje važnih informacija sa određenim korisnicima."
      },
      "responsibilities": {
        "title": "3. Odgovornosti korisnika",
        "body": "Odgovorni ste za čuvanje poverljivosti podataka vašeg naloga i za sve aktivnosti koje se odvijaju na vašem nalogu."
      },
      "privacy": {
        "title": "4. Privatnost i zaštita podataka",
        "body": "Vaša privatnost nam je važna. Molimo vas da pregledate našu Politiku privatnosti kako biste razumeli kako prikupljamo, koristimo i štitimo vaše podatke."
      },
      "liability": {
        "title": "5. Ograničenje odgovornosti",
        "body": "LegacyGuard Heritage Vault ne snosi odgovornost za indirektne, slučajne, posebne, posledične ili kaznene štete koje proizilaze iz vašeg korišćenja usluge."
      }
    },
    "disclaimer": "[Ovo je primer teksta. Konsultujte se sa pravnikom kako biste kreirali potpune Uslove korišćenja.]"
  },
  "refund": {
    "title": "Politika povraćaja novca",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Pregled",
        "body": "Zadovoljstvo korisnika je naš prioritet. Ova politika povraćaja novca opisuje kriterijume i proces za podnošenje zahteva za povraćaj."
      },
      "eligibility": {
        "title": "2. Pravo na povraćaj",
        "body": "Možete imati pravo na povraćaj u roku od 30 dana od početne kupovine ako niste intenzivno koristili premium funkcije. Povraćaji se odobravaju po našem nahođenju."
      },
      "process": {
        "title": "3. Proces povraćaja",
        "body": "Da biste pokrenuli zahtev za povraćaj, kontaktirajte naš tim za podršku na support@legacyguard.com u roku od 30 dana od kupovine. Uključite email vašeg naloga i razlog zahteva."
      },
      "nonRefundable": {
        "title": "4. Usluge bez povraćaja",
        "intro": "Sledeće usluge nisu predmet povraćaja:",
        "items": {
          "item1": "Mesečne pretplate nakon prvih 30 dana",
          "item2": "Jednokratne naknade za obradu dokumenata",
          "item3": "Notarske i pravne konsultantske usluge"
        }
      },
      "processingTime": {
        "title": "5. Vreme obrade",
        "body": "Odobreni povraćaji će biti obrađeni u roku od 5–10 radnih dana i biće uplaćeni na originalni način plaćanja."
      }
    },
    "disclaimer": "[Ovo je primer teksta. Konsultujte se sa pravnikom kako biste kreirali potpunu politiku povraćaja novca.]"
  }
}
