<<<<<<< Updated upstream
{}
=======
{
  "tos": {
    "title": "Uslovi korišćenja",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Prihvatanje Uslova",
        "body": "Pristupanjem ili korišćenjem usluge LegacyGuard Heritage Vault, slažete se da ćete biti obavezani ovim Uslovima korišćenja."
      },
      "service": {
        "title": "2. Opis usluge",
        "body": "LegacyGuard Heritage Vault pruža usluge upravljanja digitalnim nasljeđem, uključujući skladištenje dokumenata, generisanje testamenta i bezbjedno dijeljenje važnih informacija sa određenim korisnicima."
      },
      "responsibilities": {
        "title": "3. Odgovornosti korisnika",
        "body": "Vi ste odgovorni za održavanje povjerljivosti Vaših pristupnih podataka i za sve aktivnosti koje se dešavaju pod Vašim nalogom."
      },
      "privacy": {
        "title": "4. Privatnost i zaštita podataka",
        "body": "Vaša privatnost nam je važna. Molimo Vas da pregledate našu Politiku privatnosti kako biste razumjeli kako prikupljamo, koristimo i štitimo Vaše informacije."
      },
      "liability": {
        "title": "5. Ograničenje od odgovornosti",
        "body": "LegacyGuard Heritage Vault neće biti odgovoran za bilo kakvu indirektnu, slučajnu, posebnu, posljedičnu ili kaznenu štetu koja proističe iz Vašeg korišćenja usluge."
      }
    },
    "disclaimer": "[Ovo je privremeni tekst. Molimo Vas da se konsultujete sa pravnim savjetnikom kako biste kreirali sveobuhvatne Uslove korišćenja.]"
  },
  "refund": {
    "title": "Politika povrata novca",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Pregled",
        "body": "Zadovoljstvo korisnika je naš prioritet. Ova Politika povrata novca opisuje kriterijume i proces za podnošenje zahtjeva za povrat novca."
      },
      "eligibility": {
        "title": "2. Uslovi za povrat novca",
        "body": "Možete imati pravo na povrat novca u roku od 30 dana od Vaše prve kupovine ako niste u velikoj mjeri koristili premium funkcije. Povrat novca se odobrava po našem nahođenju."
      },
      "process": {
        "title": "3. Proces povrata novca",
        "body": "Da biste pokrenuli zahtjev za povrat novca, molimo Vas da kontaktirate naš tim za podršku na support@legacyguard.com u roku od 30 dana od kupovine. Uključite email Vašeg naloga i razlog za zahtjev."
      },
      "nonRefundable": {
        "title": "4. Usluge koje se ne refundiraju",
        "intro": "Sljedeće usluge se ne refundiraju:",
        "items": {
          "item1": "Mjesečne pretplate nakon prvih 30 dana",
          "item2": "Jednokratne naknade za obradu dokumenata",
          "item3": "Usluge notarske ovjere i pravnih konsultacija"
        }
      },
      "processingTime": {
        "title": "5. Vrijeme obrade",
        "body": "Odobreni povrati novca biće obrađeni u roku od 5-10 radnih dana i uplaćeni na Vaš prvobitni način plaćanja."
      }
    },
    "disclaimer": "[Ovo je privremeni tekst. Molimo Vas da se konsultujete sa pravnim savjetnikom kako biste kreirali sveobuhvatnu Politiku povrata novca.]"
  }
}
>>>>>>> Stashed changes
