{
  "welcome": {
    "firstTime": "Здравейте! Тук съм, за да ви помогна да организирате всичко важно за вашето семейство. Ще вървим стъпка по стъпка и можете да напредвате с темпото, което ви е удобно.",
    "returning": "Добре дошли отново! Нека продължим да подготвяме бъдещето на вашето семейство. Вече правите страхотен напредък.",
    "afterBreak": "Радвам се да ви видя отново. Почивките са напълно нормални – това е важна работа, която заслужава вашето време и внимание."
  },
  "contextual": {
    "dashboard": {
      "empty": "Подготвих няколко предложения според това, което споделихте с нас. Нека започнем с нещата, които ще помогнат най-много на семейството ви.",
      "progress": "Справяте се чудесно! Вашето семейство вече е много по-добре подготвено, отколкото в началото.",
      "nearComplete": "Почти сте готови! Семейството ви ще има всичко необходимо, за да се чувства уверено и спокойно."
    },
    "assets": {
      "firstAsset": "Нека започнем, като ми разкажете за нещо наистина важно за вашето семейство – може би домът ви или значима сметка.",
      "addingMore": "Страхотно! Всяко нещо, което добавяте, улеснява семейството ви да разбере какво е важно за вас.",
      "organizing": "Виждам, че изграждате ясна картина за семейството си. Тази подредба ще означава много за тях."
    },
    "family": {
      "noTrustedPeople": "Сега нека помислим за хората, които биха могли да помогнат на семейството ви, ако е необходимо. Кого бихте доверили да се намеси?",
      "addingPeople": "Чудесно е, че имате хора, на които можете да разчитате. Това ще накара семейството ви да се чувства много по-подкрепено.",
      "definingRoles": "Да помогнете на хората да разберат как могат да съдействат е много внимателен и грижовен жест."
    },
    "documents": {
      "firstUpload": "Нека подредим най-важните ви документи, за да може семейството ви лесно да ги намери.",
      "organizing": "Създавате изключително ясен ред. Семейството ви няма да се чуди къде е нещо.",
      "categorizing": "Тази организация ще спести на семейството ви много време и стрес, когато им потрябват тези документи."
    },
    "will": {
      "starting": "Създаването на завещание показва колко много държите на бъдещето на семейството си. Ще ви водя през всяко решение.",
      "inProgress": "Това са важни решения и е нормално да отделите време, за да ги обмислите.",
      "reviewing": "Взели сте обмислени решения. Семейството ви ще разбере точно какво сте искали."
    }
  },
  "emotional": {
    "overwhelmed": {
      "message": "Може да ви се струва, че има твърде много за обмисляне. Това е напълно нормално – занимавате се с важни и емоционални теми.",
      "suggestion": "Искате ли да направите почивка или да се съсредоточим само върху едно малко нещо днес?",
      "reassurance": "Помнете, не е нужно да правите всичко наведнъж. Всяка малка стъпка помага на семейството ви."
    },
    "procrastinating": {
      "message": "Забелязвам, че е минало известно време от последното ви посещение. Животът е забързан и тези теми понякога са трудни за обмисляне.",
      "suggestion": "Искате ли да отделим само 5 минути за нещо лесно днес?",
      "encouragement": "Дори малкият напредък е значим напредък за вашето семейство."
    },
    "accomplished": {
      "message": "Вижте всичко, което сте постигнали! Семейството ви е много по-добре подготвено благодарение на вашата работа.",
      "celebration": "Трябва да се гордеете, че предприемате тези важни стъпки за защита на близките си.",
      "nextSteps": "Когато сте готови, имам някои идеи, които могат да помогнат още повече на семейството ви."
    }
  },
  "guidance": {
    "priorities": {
      "high": "Това е едно от най-важните неща, които семейството ви трябва да знае.",
      "medium": "Това със сигурност ще помогне на семейството ви и си заслужава да се направи, когато имате време.",
      "low": "Това е добре да бъде подредено, но не се притеснявайте, ако искате първо да се фокусирате върху други неща."
    },
    "timeEstimates": {
      "quick": "Това трябва да отнеме само няколко минути.",
      "moderate": "Това може да отнеме 10–15 минути, но си заслужава времето.",
      "involved": "Това е по-задълбочена задача, но можете да запазите напредъка си и да се върнете по-късно."
    },
    "familyBenefit": {
      "immediate": "Семейството ви ще може да използва тази информация веднага, ако има нужда.",
      "planning": "Това ще помогне на семейството ви да планира и взема решения по-лесно.",
      "peace": "Това ще даде на семейството ви увереност, че разбират вашите желания."
    }
  },
  "suggestions": {
    "smart": {
      "basedOnAnswers": "Въз основа на това, което ми казахте за вашата ситуация, смятам, че семейството ви ще има голяма полза от това.",
      "basedOnProgress": "Тъй като работите върху {{area}}, това би било естествената следваща стъпка.",
      "basedOnTime": "Споменахте, че времето е ограничено, затова съм подредил приоритетно това, което ще помогне най-много на семейството ви."
    },
    "encouraging": {
      "smallStep": "Това е малка стъпка, която ще направи голяма разлика за вашето семейство.",
      "buildingOn": "Това надгражда върху отличната работа, която вече сте свършили.",
      "almostThere": "Остават ви съвсем малко, за да подредите напълно тази област за семейството си."
    }
  },
  "actions": {
    "primary": {
      "continue": "Нека продължим",
      "startThis": "Да започнем",
      "helpMe": "Помогни ми с това",
      "showMe": "Покажи ми как"
    },
    "secondary": {
      "later": "Ще го направя по-късно",
      "skip": "Пропусни засега",
      "moreInfo": "Разкажи ми повече",
      "different": "Нещо друго вместо това"
    },
    "supportive": {
      "takeBreak": "Направи почивка",
      "getHelp": "Имам нужда от помощ",
      "notReady": "Все още не съм готов",
      "overwhelmed": "Това ми идва твърде много"
    }
  }
}
