{
  "welcome": {
    "firstTime": "Здравей! Тук съм, за да ти помогна да организираш всичко важно за твоето семейство. Ще вървим стъпка по стъпка и можеш да напредваш със своето темпо.",
    "returning": "Добре дошъл отново! Нека продължим да подготвяме бъдещето на твоето семейство. Напредваш чудесно.",
    "afterBreak": "Радвам се да те видя отново. Напълно нормално е да правиш паузи – това е важна работа, която заслужава твоето време и внимание."
  },
  "contextual": {
    "dashboard": {
      "empty": "Подготвих няколко предложения според това, което ни каза. Нека започнем с това, което най-много ще помогне на твоето семейство.",
      "progress": "Справяш се чудесно! Семейството ти вече е много по-добре подготвено, отколкото когато започна.",
      "nearComplete": "Почти си готов! Семейството ти ще има всичко необходимо, за да се чувства уверено и подготвено."
    },
    "assets": {
      "firstAsset": "Нека започнем, като ми разкажеш за нещо наистина важно за твоето семейство – може би домът ви или значима сметка.",
      "addingMore": "Страхотно! Всяко нещо, което добавяш, помага на семейството ти по-лесно да разбере кое е важно за теб.",
      "organizing": "Виждам, че изграждаш ясна картина за семейството си. Тази организация ще означава много за тях."
    },
    "family": {
      "noTrustedPeople": "Сега нека помислим за хората, които биха могли да помогнат на семейството ти, ако се наложи. На кого би се доверил?",
      "addingPeople": "Чудесно е, че имаш хора, на които можеш да разчиташ. Семейството ти ще се чувства много по-подкрепено.",
      "definingRoles": "Да помогнеш на хората да разберат как могат да съдействат е много внимателно и отговорно."
    },
    "documents": {
      "firstUpload": "Нека организираме най-важните ти документи, за да може семейството ти да ги намира лесно.",
      "organizing": "Създаваш много ясна система. На семейството ти няма да се налага да гадае къде е нещо.",
      "categorizing": "Тази организация ще спести на семейството ти много време и стрес, когато се нуждаят от тези документи."
    },
    "will": {
      "starting": "Създаването на завещание показва колко ти пука за бъдещето на семейството ти. Ще те водя през всяко решение.",
      "inProgress": "Това са важни решения и е нормално да отделиш време, за да ги обмислиш.",
      "reviewing": "Направил си обмислени избори. Семейството ти ще разбере точно какво си желал."
    }
  },
  "emotional": {
    "overwhelmed": {
      "message": "Може да изглежда като много за мислене. Това е напълно нормално – занимаваш се с важни и емоционални теми.",
      "suggestion": "Искаш ли да си починеш, или да се съсредоточим само върху едно малко нещо днес?",
      "reassurance": "Помни, не е нужно да правиш всичко наведнъж. Всяка малка стъпка помага на семейството ти."
    },
    "procrastinating": {
      "message": "Забелязвам, че е минало време от последното ти посещение. Животът е натоварен и не е лесно да мислиш за тези теми.",
      "suggestion": "Би ли искал да отделиш само 5 минути за нещо просто днес?",
      "encouragement": "Дори малкият напредък е значим за твоето семейство."
    },
    "accomplished": {
      "message": "Виж всичко, което постигна! Семейството ти е много по-добре подготвено благодарение на твоята работа.",
      "celebration": "Трябва да се гордееш, че предприемаш тези важни стъпки, за да защитиш близките си.",
      "nextSteps": "Когато си готов, имам идеи какво още може да помогне на семейството ти."
    }
  },
  "guidance": {
    "priorities": {
      "high": "Това е едно от най-важните неща, които семейството ти трябва да знае.",
      "medium": "Това определено ще помогне на семейството ти и си заслужава да го направиш, когато имаш време.",
      "low": "Добре е да бъде организирано, но не се притеснявай, ако искаш първо да се фокусираш върху други неща."
    },
    "timeEstimates": {
      "quick": "Това трябва да отнеме само няколко минути.",
      "moderate": "Може да отнеме 10-15 минути, но си струва времето.",
      "involved": "Това е по-ангажиращо, но можеш да запазиш напредъка си и да се върнеш по-късно."
    },
    "familyBenefit": {
      "immediate": "Семейството ти ще може да използва тази информация веднага, ако се наложи.",
      "planning": "Това помага на семейството ти по-лесно да планира и да взема решения.",
      "peace": "Дава на семейството ти увереност, че разбират твоите желания."
    }
  },
  "suggestions": {
    "smart": {
      "basedOnAnswers": "Въз основа на това, което ми каза за твоята ситуация, мисля, че това много ще помогне на семейството ти.",
      "basedOnProgress": "След като работиш по {{area}}, това би била естествена следваща стъпка.",
      "basedOnTime": "Спомена, че времето е ограничено, затова съм подредил нещата, които най-много ще помогнат на семейството ти."
    },
    "encouraging": {
      "smallStep": "Това е малка стъпка, която ще има голямо значение за семейството ти.",
      "buildingOn": "Това надгражда върху чудесната работа, която вече си свършил.",
      "almostThere": "Толкова си близо до това да имаш напълно организирана тази област за семейството си."
    }
  },
  "actions": {
    "primary": {
      "continue": "Да продължим",
      "startThis": "Да го направим",
      "helpMe": "Помогни ми с това",
      "showMe": "Покажи ми как"
    },
    "secondary": {
      "later": "Ще го направя по-късно",
      "skip": "Пропусни засега",
      "moreInfo": "Кажи ми повече",
      "different": "Нещо друго вместо това"
    },
    "supportive": {
      "takeBreak": "Направи пауза",
      "getHelp": "Имам нужда от помощ",
      "notReady": "Още не съм готов",
      "overwhelmed": "Това ми идва в повече"
    }
  }
}
