{
  "tos": {
    "title": "Общи условия",
    "effectiveDate": "Дата на влизане в сила: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Приемане на условията",
        "body": "Чрез достъпа до или използването на LegacyGuard Heritage Vault, вие се съгласявате да бъдете обвързани с тези Условия за ползване."
      },
      "service": {
        "title": "2. Описание на услугата",
        "body": "LegacyGuard Heritage Vault предоставя услуги за дигитално управление на наследство, включително съхранение на документи, генериране на завещания и сигурно споделяне на важна информация с определени бенефициенти."
      },
      "responsibilities": {
        "title": "3. Отговорности на потребителя",
        "body": "Вие носите отговорност за запазването на поверителността на данните за достъп до профила си и за всички дейности, извършвани чрез него."
      },
      "privacy": {
        "title": "4. Поверителност и защита на данните",
        "body": "Вашата поверителност е важна за нас. Моля, прегледайте нашата Политика за поверителност, за да разберете как събираме, използваме и защитаваме вашата информация."
      },
      "liability": {
        "title": "5. Ограничаване на отговорността",
        "body": "LegacyGuard Heritage Vault не носи отговорност за каквито и да е косвени, случайни, специални, последващи или наказателни щети, произтичащи от използването на услугата от ваша страна."
      }
    },
    "disclaimer": "[Това е заместител. Моля, консултирайте се с юрисконсулт, за да създадете подробни Общи условия.]"
  },
  "refund": {
    "title": "Политика за възстановяване на суми",
    "effectiveDate": "Дата на влизане в сила: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Общ преглед",
        "body": "Удовлетвореността на клиентите е наш приоритет. Тази Политика за възстановяване на суми очертава критериите и процеса за заявяване на възстановяване на сумата."
      },
      "eligibility": {
        "title": "2. Право на възстановяване на суми",
        "body": "Може да имате право на възстановяване на сумата в рамките на 30 дни от първоначалната покупка, ако не сте използвали екстензивно премиум функциите. Възстановяванията на суми се извършват по наша преценка."
      },
      "process": {
        "title": "3. Процес на възстановяване на суми",
        "body": "За да подадете заявка за възстановяване на сумата, моля, свържете се с нашия екип за поддръжка на support@legacyguard.com в рамките на 30 дни от покупката. Включете имейл адреса на вашия акаунт и причината за заявката за възстановяване."
      },
      "nonRefundable": {
        "title": "4. Услуги, за които не се възстановява сумата",
        "intro": "Следните услуги не подлежат на възстановяване на сумата:",
        "items": {
          "item1": "Месечни абонаменти след първите 30 дни",
          "item2": "Еднократни такси за обработка на документи",
          "item3": "Нотариални услуги и правни консултации"
        }
      },
      "processingTime": {
        "title": "5. Време за обработка",
        "body": "Одобрените възстановявания на суми ще бъдат обработени в рамките на 5-10 работни дни и ще бъдат кредитирани по първоначалния ви метод на плащане."
      }
    },
    "disclaimer": "[Това е заместител. Моля, консултирайте се с юрисконсулт, за да създадете подробна политика за възстановяване на суми.]"
  }
}
