{
  "general": {
    "something_wrong": "Midagi ei läinud päris õigesti, kuid ärge muretsege – teie olulised andmed on turvalised.",
    "try_again": "Las ma proovin seda teie jaoks uuesti",
    "contact_support": "Olen siin, et aidata, kui vajate abi",
    "no_data_lost": "Hea uudis on see, et midagi teie tehtust pole kaduma läinud",
    "temporary_issue": "Tundub, et tegemist on ajutise probleemiga, mis peaks peagi lahenema"
  },
  "network": {
    "connection_lost": "Tundub, et teie internetiühendus katkes. Teie töö on salvestatud ja me ühendame automaatselt uuesti.",
    "slow_connection": "Teie ühendus tundub täna veidi aeglane. Ootan kannatlikult, kuni kõik laadib.",
    "server_busy": "Meie serverid on hetkel veidi hõivatud, kuid ma jätkan püüdmist teid aidata.",
    "timeout": "See võttis oodatust kauem aega. Las ma proovin teistsugust lähenemist."
  },
  "validation": {
    "required_field": "Teie perekond vajab seda teavet – kas saaksite mind aidata selle täitmisel?",
    "invalid_email": "See e-posti aadress ei tundu päris õige. Kas saaksite selle uuesti üle kontrollida?",
    "invalid_phone": "Mul on raskusi selle telefoninumbri vorminguga. Palun proovige seda sisestada teisel viisil.",
    "invalid_date": "See kuupäeva formaat ei sobi mulle. Kas proovite MM/PP/AAAA?",
    "password_weak": "Teeme teie parooli veidi tugevamaks, et teie perekonna teave oleks veelgi paremini kaitstud.",
    "file_too_large": "See fail on minu jaoks natuke liiga suur. Kas saate proovida väiksemat versiooni?",
    "unsupported_file": "Ma ei saa selle failitüübiga töötada. Kas proovite PDF-i või pilti?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Ma ei saanud praegu selle vara andmeid salvestada, kuid jätkan proovimist. Teie perekonna teave on mulle oluline.",
      "load_failed": "Mul on raskusi teie varade laadimisega. Las ma proovin mõne hetke pärast uuesti.",
      "delete_failed": "Ma ei saanud seda üksust praegu eemaldada. Kas soovite, et ma prooviksin uuesti?"
    },
    "documents": {
      "upload_failed": "See dokument ei laadinud üles õigesti. Ärge muretsege – aitan teil uuesti proovida.",
      "processing_failed": "Mul oli probleeme selle dokumendi töötlemisel. Fail on turvaline ja ma proovin uuesti.",
      "access_failed": "Ma ei saa praegu sellele dokumendile ligi. Las ma vaatan, mida saan teha, et aidata."
    },
    "family": {
      "save_failed": "Ma ei saanud praegu selle inimese andmeid salvestada. Proovime uuesti – teie usaldusring on oluline.",
      "invite_failed": "Ma ei saanud seda kutset praegu saata. Aitan teil uuesti proovida, kui olete valmis.",
      "access_failed": "Mul on raskusi perekonna juurdepääsu seadistustega. Las ma tegelen sellega teie eest."
    },
    "will": {
      "generation_failed": "Ma ei saanud praegu teie testamenti luua. Ärge muretsege – kõik teie otsused on salvestatud ja ma proovin uuesti.",
      "save_failed": "Ma ei saanud praegu testamendi muudatusi salvestada. Teie eelmine versioon on turvaline ja ma jätkan proovimist.",
      "legal_check_failed": "Ma ei saanud praegu õigusnõudeid kontrollida. Las ma proovin uuesti või küsime abi meie juriidiliselt meeskonnalt."
    }
  },
  "emotional_support": {
    "frustration": "Ma tean, et see on masendav, kui proovite oma perekonna heaks midagi olulist teha. Olen siin, et aidata selle korda saada.",
    "time_pressure": "Ma mõistan, et teil pole palju aega tehniliste probleemide jaoks. Las ma lahendan selle kiiresti teie eest.",
    "overwhelm": "Tehnilised probleemid võivad tunduda üle jõu käivad, kui tegelete juba olulise pereplaneerimisega. Hingake sügavalt – ma saan sellega hakkama.",
    "discouragement": "Ärge laske sellel tehnilisel takistusel end heidutada. See, mida teete oma perekonna heaks, on liiga oluline, et alla anda."
  },
  "solutions": {
    "refresh_page": "Mõnikord aitab lehe värskendamine. Teie töö on salvestatud, nii et te ei kaota midagi.",
    "try_different_browser": "Kui see probleem jätkub, proovige mõnda teist brauserit. Chrome või Firefox töötavad tavaliselt kõige paremini.",
    "check_internet": "Kas saate kontrollida oma internetiühendust? Mõnikord on sellest piisav.",
    "contact_support": "Mul oleks hea meel teid isiklikult aidata. Võite ühendust võtta meie tugimeeskonnaga, kes hoolitseb teie eest hästi.",
    "try_later": "Kui teil on kiire, võite seda hiljem uuesti proovida. Kõik, mida olete teinud, on turvaliselt salvestatud.",
    "alternative_approach": "Las ma pakun välja teistsuguse viisi, mis võib paremini toimida."
  },
  "recovery": {
    "auto_save_worked": "Hea uudis on see, et kõik, mida sisestasite, salvestati automaatselt.",
    "backup_available": "Mul on teie töö varukoopia mõne minuti tagusest ajast, kui seda vajate.",
    "progress_preserved": "Teie kogu edenemine on säilinud – te ei pea uuesti alustama.",
    "data_secure": "Teie perekonna teave jääb vaatamata sellele tehnilisele probleemile täielikult turvaliseks."
  }
}
