{
  "tos": {
    "title": "Teenuse Tingimused",
    "effectiveDate": "Jõustumiskuupäev: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Tingimuste Aktsepteerimine",
        "body": "LegacyGuard Heritage Vault'i kasutades või sellele juurde pääsedes nõustute nende teenuse tingimustega."
      },
      "service": {
        "title": "2. Teenuse Kirjeldus",
        "body": "LegacyGuard Heritage Vault pakub digitaalse pärandi haldamise teenuseid, sealhulgas dokumentide hoiustamist, testamentide koostamist ja olulise teabe turvalist jagamist määratud kasusaajatega."
      },
      "responsibilities": {
        "title": "3. Kasutaja Kohustused",
        "body": "Teie vastutate oma konto sisselogimisandmete konfidentsiaalsuse säilitamise ja kõigi teie konto alt toimuvate tegevuste eest."
      },
      "privacy": {
        "title": "4. Privaatsus ja Andmekaitse",
        "body": "Teie privaatsus on meie jaoks oluline. Palun lugege meie privaatsuspoliitikat, et mõista, kuidas me teie teavet kogume, kasutame ja kaitseme."
      },
      "liability": {
        "title": "5. Vastutuse Piiramine",
        "body": "LegacyGuard Heritage Vault ei vastuta kaudsete, juhuslike, eriliste, tulenevate ega karistuslike kahjude eest, mis tulenevad teenuse kasutamisest."
      }
    },
    "disclaimer": "[See on näidistekst. Palun konsulteerige juristiga, et koostada täielikud teenuse tingimused.]"
  },
  "refund": {
    "title": "Tagasimaksepoliitika",
    "effectiveDate": "Jõustumiskuupäev: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Ülevaade",
        "body": "Kliendi rahulolu on meie prioriteet. See tagasimaksepoliitika kirjeldab kriteeriume ja protsessi tagasimakse taotlemiseks."
      },
      "eligibility": {
        "title": "2. Tagasimakse Saamise Õigus",
        "body": "Teil võib olla õigus tagasimaksele 30 päeva jooksul pärast esmast ostu, kui te ei ole kasutanud premium-funktsioone ulatuslikult. Tagasimaksed tehakse meie äranägemisel."
      },
      "process": {
        "title": "3. Tagasimakse Protsess",
        "body": "Tagasimakse taotlemiseks võtke ühendust meie tugitiimiga aadressil support@legacyguard.com 30 päeva jooksul pärast ostu. Lisage oma konto e-posti aadress ja taotluse põhjus."
      },
      "nonRefundable": {
        "title": "4. Tagastamatud Teenused",
        "intro": "Järgmised teenused ei kuulu tagasimaksele:",
        "items": {
          "item1": "Kuu tellimused pärast esimest 30 päeva",
          "item2": "Ühekordsed dokumenditöötlustasud",
          "item3": "Notari ja õigusnõustamise teenused"
        }
      },
      "processingTime": {
        "title": "5. Töötlemisaeg",
        "body": "Heakskiidetud tagasimaksed töödeldakse 5–10 tööpäeva jooksul ja kantakse tagasi algsele makseviisile."
      }
    },
    "disclaimer": "[See on näidistekst. Palun konsulteerige juristiga, et koostada täielik tagasimaksepoliitika.]"
  }
}
