{
  "general": {
    "something_wrong": "Valami nem működött teljesen megfelelően, de ne aggódjon – a fontos adatai biztonságban vannak.",
    "try_again": "Hadd próbáljam meg újra ön helyett",
    "contact_support": "Itt vagyok, hogy segítsek, ha támogatásra van szüksége",
    "no_data_lost": "A jó hír az, hogy semmi az eddigi munkájából nem veszett el",
    "temporary_issue": "Úgy tűnik, ez egy átmeneti probléma, ami hamarosan megoldódik"
  },
  "network": {
    "connection_lost": "Úgy tűnik, megszakadt az internetkapcsolata. A munkája el lett mentve, és automatikusan újracsatlakozunk.",
    "slow_connection": "A kapcsolata ma egy kicsit lassúnak tűnik. Türelmesen várok, amíg minden betöltődik.",
    "server_busy": "A szervereink most egy kicsit túlterheltek, de továbbra is próbálok segíteni önnek.",
    "timeout": "Ez tovább tartott a vártnál. Hadd próbáljak meg egy másik megoldást."
  },
  "validation": {
    "required_field": "A családjának szüksége lesz erre az információra – tudna segíteni kitölteni?",
    "invalid_email": "Ez az e-mail-cím nem tűnik teljesen helyesnek. Ellenőrizné újra?",
    "invalid_phone": "Gondom van ezzel a telefonszám-formátummal. Megpróbálná másként beírni?",
    "invalid_date": "Ez a dátumformátum nem működik számomra. Megpróbálná HH/NN/ÉÉÉÉ formátumban?",
    "password_weak": "Erősítsük meg egy kicsit a jelszavát, hogy a családja adatai még nagyobb biztonságban legyenek.",
    "file_too_large": "Ez a fájl egy kicsit túl nagy a feldolgozáshoz. Megpróbálná egy kisebb verzióval?",
    "unsupported_file": "Ezzel a fájltípussal nem tudok dolgozni. Megpróbálna inkább egy PDF-et vagy képet?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Most nem tudtam elmenteni ennek az eszköznek az adatait, de továbbra is próbálkozom. A családja adatai fontosak számomra.",
      "load_failed": "Problémám van az eszközei betöltésével. Hamarosan megpróbálom újra.",
      "delete_failed": "Most nem tudtam törölni ezt az elemet. Szeretné, hogy megpróbáljam újra?"
    },
    "documents": {
      "upload_failed": "Ez a dokumentum nem töltődött fel megfelelően. Ne aggódjon – segítek újra megpróbálni.",
      "processing_failed": "Problémám volt a dokumentum feldolgozásával. A fájl biztonságban van, és megpróbálom újra.",
      "access_failed": "Most nem tudom elérni ezt a dokumentumot. Hadd nézzem meg, mit tehetek az ön érdekében."
    },
    "family": {
      "save_failed": "Most nem tudtam elmenteni ennek a személynek az adatait. Próbáljuk meg újra – a bizalmi köre fontos.",
      "invite_failed": "Most nem tudtam elküldeni ezt a meghívót. Segítek újra megpróbálni, amikor készen áll.",
      "access_failed": "Problémám van a családi hozzáférési beállításokkal. Hadd intézzem ezt el ön helyett."
    },
    "will": {
      "generation_failed": "Most nem tudtam létrehozni a végrendeletét. Ne aggódjon – minden döntése el van mentve, és újra megpróbálom.",
      "save_failed": "Most nem tudtam elmenteni a végrendelet módosításait. Az előző verzió biztonságban van, és folytatom a próbálkozást.",
      "legal_check_failed": "Most nem tudtam ellenőrizni a jogi követelményeket. Megpróbáljam újra, vagy kérjünk segítséget a jogi csapatunktól?"
    }
  },
  "emotional_support": {
    "frustration": "Tudom, hogy frusztráló, amikor valami fontosat próbál tenni a családja érdekében. Itt vagyok, hogy segítsek ezt megvalósítani.",
    "time_pressure": "Megértem, hogy nincs sok ideje technikai problémákra. Hadd intézzem ezt gyorsan ön helyett.",
    "overwhelm": "A technikai problémák nyomasztóak lehetnek, amikor már így is fontos családi tervezéssel foglalkozik. Vegyen egy mély levegőt – én kezelem ezt.",
    "discouragement": "Ne hagyja, hogy ez a technikai hiba kedvét szegje. Amit a családjáért tesz, túl fontos ahhoz, hogy feladja."
  },
  "solutions": {
    "refresh_page": "Néha segít az oldal frissítése. A munkája el van mentve, így nem fog elveszni semmi.",
    "try_different_browser": "Ha ez továbbra is fennáll, próbáljon ki egy másik böngészőt. A Chrome vagy a Firefox általában a legjobban működik.",
    "check_internet": "Meg tudná nézni az internetkapcsolatát? Néha ennyi is elég.",
    "contact_support": "Szívesen segítek önnek személyesen. Kapcsolatba léphet az ügyfélszolgálatunkkal, amely jól fog gondoskodni önről.",
    "try_later": "Ha siet, próbálja meg később újra. Minden, amit eddig tett, biztonságban van.",
    "alternative_approach": "Hadd javasoljak egy másik módszert, amely jobban működhet."
  },
  "recovery": {
    "auto_save_worked": "A jó hír az, hogy minden, amit beírt, automatikusan elmentődött.",
    "backup_available": "Van egy biztonsági másolatom a munkájáról néhány perccel ezelőttről, ha szüksége van rá.",
    "progress_preserved": "Minden előrehaladása megmaradt – nem kell elölről kezdenie.",
    "data_secure": "A családja adatai teljesen biztonságban maradnak ennek a technikai problémának ellenére."
  }
}
