{
  "tos": {
    "title": "Hizmet Şartları",
    "effectiveDate": "Yürürlük Tarihi: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Şartların Kabulü",
        "body": "LegacyGuard Heritage Vault'a erişerek veya kullanarak bu Hizmet Şartlarına bağlı kalmayı kabul etmiş olursunuz."
      },
      "service": {
        "title": "2. Hizmet Açıklaması",
        "body": "LegacyGuard Heritage Vault, belge depolama, vasiyet oluşturma ve belirlenmiş lehdarlara önemli bilgilerin güvenli bir şekilde paylaşılması dahil olmak üzere dijital miras yönetimi hizmetleri sunar."
      },
      "responsibilities": {
        "title": "3. Kullanıcı Sorumlulukları",
        "body": "Hesap bilgilerinizi gizli tutmak ve hesabınız altında gerçekleşen tüm faaliyetlerden siz sorumlusunuz."
      },
      "privacy": {
        "title": "4. Gizlilik ve Veri Koruma",
        "body": "Gizliliğiniz bizim için önemlidir. Bilgilerinizi nasıl topladığımızı, kullandığımızı ve koruduğumuzu anlamak için lütfen Gizlilik Politikamızı inceleyin."
      },
      "liability": {
        "title": "5. Sorumluluğun Sınırlandırılması",
        "body": "LegacyGuard Heritage Vault, hizmetin kullanımınızdan doğan dolaylı, tesadüfi, özel, sonuçsal veya cezai zararlardan sorumlu değildir."
      }
    },
    "disclaimer": "[Bu bir örnek metindir. Kapsamlı Hizmet Şartları oluşturmak için lütfen hukuk danışmanınıza başvurun.]"
  },
  "refund": {
    "title": "İade Politikası",
    "effectiveDate": "Yürürlük Tarihi: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Genel Bakış",
        "body": "Müşteri memnuniyeti önceliğimizdir. Bu İade Politikası, iade talebinde bulunma kriterlerini ve sürecini açıklar."
      },
      "eligibility": {
        "title": "2. İade Hakkı",
        "body": "Premium özellikleri yoğun şekilde kullanmadıysanız, ilk satın alma tarihinden itibaren 30 gün içinde iade hakkına sahip olabilirsiniz. İadeler tamamen bizim takdirimize bağlıdır."
      },
      "process": {
        "title": "3. İade Süreci",
        "body": "İade talebi başlatmak için lütfen satın alma tarihinden itibaren 30 gün içinde support@legacyguard.com adresinden destek ekibimizle iletişime geçin. Hesap e-postanızı ve iade talebinizin nedenini ekleyin."
      },
      "nonRefundable": {
        "title": "4. İade Edilemeyen Hizmetler",
        "intro": "Aşağıdaki hizmetler iade edilmez:",
        "items": {
          "item1": "İlk 30 günden sonra aylık abonelikler",
          "item2": "Tek seferlik belge işleme ücretleri",
          "item3": "Noterlik ve hukuki danışmanlık hizmetleri"
        }
      },
      "processingTime": {
        "title": "5. İşlem Süresi",
        "body": "Onaylanan iadeler 5–10 iş günü içinde işleme alınır ve orijinal ödeme yöntemine iade edilir."
      }
    },
    "disclaimer": "[Bu bir örnek metindir. Kapsamlı bir İade Politikası oluşturmak için lütfen hukuk danışmanınıza başvurun.]"
  }
}
