{
  "general": {
    "loading": "Μια στιγμή, όσο ετοιμάζω τα πάντα για σένα...",
    "processing": "Δουλεύω πάνω σε αυτό για σένα...",
    "saving": "Κρατώντας το ασφαλές για την οικογένειά σας...",
    "uploading": "Αποθηκεύοντας με ασφάλεια αυτές τις σημαντικές πληροφορίες...",
    "analyzing": "Αναθεωρώντας αυτό για να βοηθήσετε την οικογένειά σας...",
    "generating": "Δημιουργώντας το ειδικά για την οικογένειά σας...",
    "connecting": "Ασφαλής σύνδεση για την προστασία των πληροφοριών σας...",
    "syncing": "Βεβαιωθείτε ότι όλα είναι ενημερωμένα για εσάς...",
    "initializing": "Όλα ετοιμάζονται για εσάς...",
    "updating": "Ενημέρωση αυτών των πληροφοριών για την οικογένειά σας..."
  },
  "contextual": {
    "assets": {
      "saving": "Προσθέτοντας αυτές τις σημαντικές πληροφορίες στο θησαυροφυλάκιο της οικογένειάς σας...",
      "loading": "Συγκεντρώνοντας σημαντικές πληροφορίες για την οικογένειά σας...",
      "calculating": "Κατανοώντας τι σημαίνει αυτό για την οικογένειά σας...",
      "updating": "Ενημέρωση των περιουσιακών στοιχείων και της περιουσίας της οικογένειάς σας...",
      "organizing": "Οργανώνοντας τα πάντα, ώστε η οικογένειά σας να τα βρίσκει εύκολα..."
    },
    "documents": {
      "uploading": "Αποθηκεύοντας με ασφάλεια αυτό το έγγραφο για την οικογένειά σας...",
      "processing": "Οργανώνοντάς το έτσι ώστε η οικογένειά σας να το βρίσκει εύκολα...",
      "analyzing": "Εξετάζοντας αυτό το έγγραφο για να βοηθήσουμε την οικογένειά σας...",
      "scanning": "Διαβάζοντας αυτό το σημαντικό έγγραφο...",
      "encrypting": "Προστασία αυτού του εγγράφου με επιπλέον ασφάλεια..."
    },
    "will": {
      "generating": "Συντάσσοντας προσεκτικά τη διαθήκη σας με βάση τις επιθυμίες σας...",
      "saving": "Διαφυλάξτε τις σημαντικές αποφάσεις σας για την οικογένειά σας...",
      "reviewing": "Βεβαιωθείτε ότι όλα αντικατοπτρίζουν αυτό που θέλετε...",
      "updating": "Ενημερώνοντας τις επιθυμίες σας για την οικογένειά σας...",
      "finalizing": "Βάζοντας τις τελευταίες πινελιές στη διαθήκη σας..."
    },
    "family": {
      "saving": "Προσθήκη αυτού του έμπιστου ατόμου στην ομάδα υποστήριξης της οικογένειάς σας...",
      "loading": "Συλλογή πληροφοριών σχετικά με τους βοηθούς της οικογένειάς σας...",
      "updating": "Ενημέρωση του δικτύου υποστήριξης της οικογένειάς σας...",
      "connecting": "Χτίζοντας δεσμούς με τους κηδεμόνες της οικογένειάς σας...",
      "organizing": "Οργάνωση του συστήματος υποστήριξης της οικογένειάς σας..."
    },
    "guardian": {
      "adding": "Προσθέτοντας αυτό το ξεχωριστό άτομο για να βοηθήσετε την οικογένειά σας...",
      "updating": "Ενημέρωση στοιχείων κηδεμόνα...",
      "verifying": "Να διασφαλίσουμε ότι αυτός ο φύλακας μπορεί να βοηθήσει όταν χρειαστεί...",
      "connecting": "Η εδραίωση αυτής της σημαντικής σχέσης..."
    }
  },
  "emotional": {
    "first_time": "Τα προετοιμάζω όλα τέλεια για την πρώτη σας επίσκεψη...",
    "returning": "Καλώς ήρθες πίσω! Ετοιμάζω τις πληροφορίες σου...",
    "complex_task": "Αυτή είναι σημαντική δουλειά - φροντίζω για όλες τις λεπτομέρειες...",
    "sensitive_area": "Καταλαβαίνω ότι αυτό είναι προσωπικό θέμα - χειρισμός με ιδιαίτερη προσοχή...",
    "almost_done": "Σχεδόν τελειώσαμε - απλώς βεβαιωνόμαστε ότι όλα είναι τέλεια...",
    "taking_time": "Τα καλά πράγματα χρειάζονται χρόνο - είμαι σχολαστικός/η για την οικογένειά σου..."
  },
  "transitions": {
    "dashboard_to_assets": "Ας δούμε τα σημαντικά πράγματα της οικογένειάς σας...",
    "assets_to_family": "Ας σκεφτούμε τώρα ποιοι μπορούν να βοηθήσουν...",
    "family_to_will": "Ώρα να καταγράψετε τις επιθυμίες σας για την οικογένειά σας...",
    "will_to_review": "Ας τα αξιολογήσουμε όλα μαζί...",
    "section_complete": "Μεγάλη πρόοδος! Η οικογένειά σας είναι πιο προετοιμασμένη τώρα...",
    "saving_complete": "Αυτό φυλάσσεται με ασφάλεια για την οικογένειά σας...",
    "starting_complex": "Αυτή είναι μια σημαντική δουλειά για την οικογένειά σας - ας αφιερώσουμε τον χρόνο μας...",
    "navigating": "Σας μεταφέρω εκεί τώρα..."
  },
  "progress": {
    "starting": "Ξεκινώντας με το σχέδιο προστασίας της οικογένειάς σας...",
    "quarter": "Οργάνωση των πληροφοριών σας...",
    "half": "Δημιουργώντας το σχέδιο προστασίας της οικογένειάς σας...",
    "three_quarters": "Ολοκληρώνοντας τα πάντα για την οικογένειά σας...",
    "complete": "Το σχέδιο προστασίας της οικογένειάς σας είναι έτοιμο!",
    "step_complete": "Ένα ακόμη βήμα για το μέλλον της οικογένειάς σας ολοκληρώθηκε..."
  },
  "microInteractions": {
    "buttons": {
      "save": "Κρατήστε το ασφαλές για την οικογένειά σας",
      "delete": "Αφαιρέστε αυτό προσεκτικά",
      "share": "Ενημερώστε την οικογένειά σας για αυτό",
      "edit": "Ενημέρωση αυτών των πληροφοριών",
      "add": "Προσθήκη στο οικογενειακό σας πρόγραμμα",
      "continue": "Συνέχισε να χτίζεις το σχέδιό σου",
      "back": "Ας γυρίσουμε πίσω",
      "next": "Προχωρήστε μαζί"
    },
    "validation": {
      "required": "Η οικογένειά σας χρειάζεται αυτές τις πληροφορίες",
      "invalid_format": "Επιτρέψτε μου να σας βοηθήσω με τη σωστή μορφή",
      "too_short": "Θα μπορούσατε να προσθέσετε μερικές περισσότερες λεπτομέρειες για την οικογένειά σας;",
      "too_long": "Ας το κρατήσουμε συνοπτικό για λόγους σαφήνειας",
      "success": "Τέλεια! Αυτό φαίνεται υπέροχο",
      "checking": "Άσε με να το ελέγξω αυτό για σένα..."
    }
  },
  "errors": {
    "recovery": {
      "general": "Κάτι δεν λειτούργησε σωστά, αλλά οι πληροφορίες σας είναι ασφαλείς...",
      "retry": "Ας το δοκιμάσω ξανά για εσάς...",
      "save_failed": "Μην ανησυχείτε - θα φροντίσω να αποθηκευτεί σωστά...",
      "network": "Δυσκολεύομαι να συνδεθώ - αλλά μην ανησυχείς, τίποτα δεν έχει χαθεί...",
      "timeout": "Αυτό διαρκεί περισσότερο από το αναμενόμενο - επιτρέψτε μου να βοηθήσω..."
    },
    "reassurance": {
      "data_safe": "Οι πληροφορίες σας είναι απολύτως ασφαλείς",
      "no_loss": "Τίποτα δεν έχει χαθεί",
      "we_can_help": "Μπορούμε να το διορθώσουμε αυτό μαζί",
      "try_again": "Ας το δοκιμάσουμε ξανά όταν είσαι έτοιμος"
    }
  },
  "encouragement": {
    "overwhelmed": {
      "take_time": "Δεν υπάρχει βιασύνη - αφιερώστε όσο χρόνο χρειάζεστε",
      "here_to_help": "Είμαι εδώ για να βοηθήσω σε κάθε βήμα",
      "one_step": "Μόνο ένα μικρό βήμα τη φορά",
      "doing_great": "Κάνεις κάτι υπέροχο για την οικογένειά σου"
    },
    "confident": {
      "great_progress": "Κάνεις εξαιρετική πρόοδο!",
      "almost_there": "Σχεδόν τελείωσε - τα πας περίφημα!",
      "well_done": "Μπράβο που ολοκλήρωσες και αυτό το τμήμα!",
      "family_protected": "Η οικογένειά σας είναι τώρα πιο προστατευμένη"
    }
  }
}
