{
  "general": {
    "something_wrong": "Noget gik ikke helt som det skulle, men bare rolig – dine vigtige oplysninger er sikre.",
    "try_again": "Lad mig prøve igen for dig",
    "contact_support": "Jeg er her for at hjælpe, hvis du har brug for assistance",
    "no_data_lost": "Den gode nyhed er, at intet af det, du har arbejdet på, er gået tabt",
    "temporary_issue": "Det ser ud til at være et midlertidigt problem, der snart bør blive løst"
  },
  "network": {
    "connection_lost": "Det ser ud til, at din internetforbindelse blev afbrudt. Dit arbejde er gemt, og vi forbinder automatisk igen.",
    "slow_connection": "Din forbindelse virker lidt langsom i dag. Jeg venter tålmodigt, mens tingene indlæses.",
    "server_busy": "Vores servere er lidt optagede lige nu, men jeg vil fortsætte med at prøve at hjælpe dig.",
    "timeout": "Det tog længere tid end forventet. Lad mig prøve en anden tilgang."
  },
  "validation": {
    "required_field": "Din familie får brug for disse oplysninger – vil du hjælpe mig med at udfylde dem?",
    "invalid_email": "Den e-mailadresse ser ikke helt rigtig ud. Vil du dobbelttjekke den for mig?",
    "invalid_phone": "Jeg har problemer med dette telefonnummerformat. Kan du prøve at indtaste det på en anden måde?",
    "invalid_date": "Dette datoformat virker ikke for mig. Kan du prøve MM/DD/ÅÅÅÅ?",
    "password_weak": "Lad os gøre din adgangskode lidt stærkere for at beskytte din families oplysninger ekstra godt.",
    "file_too_large": "Denne fil er lidt for stor til, at jeg kan håndtere den. Kan du prøve en mindre version?",
    "unsupported_file": "Jeg kan ikke arbejde med den filtype. Kan du prøve en PDF eller et billede i stedet?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Jeg kunne ikke gemme oplysningerne om dette aktiv lige nu, men jeg vil fortsætte med at prøve. Din families oplysninger er vigtige for mig.",
      "load_failed": "Jeg har problemer med at indlæse dine aktiver lige nu. Lad mig prøve igen om et øjeblik.",
      "delete_failed": "Jeg kunne ikke fjerne dette element lige nu. Vil du have mig til at prøve igen?"
    },
    "documents": {
      "upload_failed": "Dokumentet blev ikke uploadet korrekt. Bare rolig – jeg hjælper dig med at prøve igen.",
      "processing_failed": "Jeg havde problemer med at behandle dette dokument. Filen er sikker, og jeg prøver igen.",
      "access_failed": "Jeg kan ikke få adgang til dette dokument lige nu. Lad mig se, hvad jeg kan gøre for at hjælpe."
    },
    "family": {
      "save_failed": "Jeg kunne ikke gemme oplysningerne om denne person lige nu. Lad mig prøve igen – din betroede kreds er vigtig.",
      "invite_failed": "Jeg kunne ikke sende invitationen lige nu. Jeg hjælper dig med at prøve igen, når du er klar.",
      "access_failed": "Jeg har problemer med familieadgangsindstillingerne. Lad mig tage mig af det for dig."
    },
    "will": {
      "generation_failed": "Jeg kunne ikke oprette dit testamente lige nu. Bare rolig – alle dine beslutninger er gemt, og jeg prøver igen.",
      "save_failed": "Jeg kunne ikke gemme ændringerne i testamentet lige nu. Din tidligere version er sikker, og jeg vil fortsætte med at prøve.",
      "legal_check_failed": "Jeg kunne ikke verificere de juridiske krav lige nu. Lad mig prøve igen, eller vi kan få hjælp fra vores juridiske team."
    }
  },
  "emotional_support": {
    "frustration": "Jeg ved, det er frustrerende, når du prøver at gøre noget vigtigt for din familie. Jeg er her for at hjælpe dig med at få det til at lykkes.",
    "time_pressure": "Jeg forstår, at du ikke har meget tid til tekniske problemer. Lad mig tage mig hurtigt af det for dig.",
    "overwhelm": "Tekniske problemer kan føles overvældende, når du allerede håndterer vigtig familieplanlægning. Tag en dyb indånding – jeg har styr på det.",
    "discouragement": "Lad ikke denne tekniske udfordring slå dig ud. Det, du gør for din familie, er for vigtigt til at give op."
  },
  "solutions": {
    "refresh_page": "Nogle gange hjælper det at opdatere siden. Dit arbejde er gemt, så du mister ikke noget.",
    "try_different_browser": "Hvis dette fortsætter, kan du prøve en anden browser. Chrome eller Firefox fungerer som regel bedst.",
    "check_internet": "Kan du tjekke din internetforbindelse? Nogle gange er det alt, hvad der skal til.",
    "contact_support": "Jeg vil meget gerne hjælpe dig personligt. Du kan kontakte vores supportteam, som vil tage sig godt af dig.",
    "try_later": "Hvis du har travlt, kan du prøve igen senere. Alt, hvad du har lavet, er sikkert gemt.",
    "alternative_approach": "Lad mig foreslå en anden måde at gøre dette på, som måske fungerer bedre."
  },
  "recovery": {
    "auto_save_worked": "Den gode nyhed er, at alt, hvad du har indtastet, blev gemt automatisk.",
    "backup_available": "Jeg har en sikkerhedskopi af dit arbejde fra for få minutter siden, hvis du har brug for det.",
    "progress_preserved": "Alle dine fremskridt er bevaret – du behøver ikke starte forfra.",
    "data_secure": "Din families oplysninger forbliver fuldstændig sikre trods dette tekniske problem."
  }
}
