{
  "tos": {
    "title": "Servicevilkår",
    "effectiveDate": "Ikrafttrædelsesdato: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Accept af vilkår",
        "body": "Ved at tilgå eller bruge LegacyGuard Heritage Vault accepterer du at være bundet af disse servicevilkår."
      },
      "service": {
        "title": "2. Servicebeskrivelse",
        "body": "LegacyGuard Heritage Vault tilbyder digitale tjenester til håndtering af arv, herunder dokumentopbevaring, testamentering og sikker deling af vigtige oplysninger med udpegede begunstigede."
      },
      "responsibilities": {
        "title": "3. Brugerens ansvar",
        "body": "Du er ansvarlig for at opretholde fortroligheden af dine kontooplysninger og for alle aktiviteter, der finder sted under din konto."
      },
      "privacy": {
        "title": "4. Privatliv og databeskyttelse",
        "body": "Dit privatliv er vigtigt for os. Gennemgå venligst vores privatlivspolitik for at forstå, hvordan vi indsamler, bruger og beskytter dine oplysninger."
      },
      "liability": {
        "title": "5. Ansvarsbegrænsning",
        "body": "LegacyGuard Heritage Vault er ikke ansvarlig for indirekte, tilfældige, særlige, følgeskader eller pønalerstatninger, der måtte opstå som følge af din brug af tjenesten."
      }
    },
    "disclaimer": "[Dette er en midlertidig løsning. Kontakt venligst en juridisk rådgiver for at udarbejde omfattende servicevilkår.]"
  },
  "refund": {
    "title": "Refusionspolitik",
    "effectiveDate": "Ikrafttrædelsesdato: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Oversigt",
        "body": "Kundetilfredshed er vores prioritet. Denne refunderingspolitik beskriver kriterierne og processen for at anmode om refundering."
      },
      "eligibility": {
        "title": "2. Berettigelse til refusion",
        "body": "Du kan være berettiget til en refusion inden for 30 dage efter dit oprindelige køb, hvis du ikke har brugt premium-funktionerne i vid udstrækning. Refusioner ydes efter vores skøn."
      },
      "process": {
        "title": "3. Refusionsproces",
        "body": "For at indlede en anmodning om refusion, bedes du kontakte vores supportteam på support@legacyguard.com inden for 30 dage efter købet. Angiv din konto-e-mailadresse og årsagen til refusionsanmodningen."
      },
      "nonRefundable": {
        "title": "4. Ikke-refunderbare tjenester",
        "intro": "Følgende tjenester refunderes ikke:",
        "items": {
          "item1": "Månedlige abonnementer efter de første 30 dage",
          "item2": "Engangsgebyrer for dokumentbehandling",
          "item3": "Notarisering og juridisk rådgivning"
        }
      },
      "processingTime": {
        "title": "5. Behandlingstid",
        "body": "Godkendte refusioner vil blive behandlet inden for 5-10 hverdage og krediteret din oprindelige betalingsmetode."
      }
    },
    "disclaimer": "[Dette er en midlertidig løsning. Kontakt venligst en juridisk rådgiver for at udarbejde en omfattende refusionspolitik.]"
  }
}
