{
  "tos": {
    "title": "Servicevilkår",
    "effectiveDate": "Ikrafttrædelsesdato: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Accept af vilkår",
        "body": "Ved at få adgang til eller bruge LegacyGuard Heritage Vault accepterer du at være bundet af disse servicevilkår."
      },
      "service": {
        "title": "2. Beskrivelse af tjenesten",
        "body": "LegacyGuard Heritage Vault tilbyder tjenester til digital arveforvaltning, herunder dokumentopbevaring, oprettelse af testamenter og sikker deling af vigtige oplysninger med udpegede modtagere."
      },
      "responsibilities": {
        "title": "3. Brugeransvar",
        "body": "Du er ansvarlig for at opretholde fortroligheden af dine kontooplysninger og for alle aktiviteter, der finder sted under din konto."
      },
      "privacy": {
        "title": "4. Privatliv og databeskyttelse",
        "body": "Dit privatliv er vigtigt for os. Læs venligst vores privatlivspolitik for at forstå, hvordan vi indsamler, bruger og beskytter dine oplysninger."
      },
      "liability": {
        "title": "5. Ansvarsbegrænsning",
        "body": "LegacyGuard Heritage Vault er ikke ansvarlig for indirekte, tilfældige, særlige, følge- eller strafbare skader, der opstår som følge af din brug af tjenesten."
      }
    },
    "disclaimer": "[Dette er en pladsholder. Kontakt venligst en juridisk rådgiver for at udarbejde fuldstændige servicevilkår.]"
  },
  "refund": {
    "title": "Refusionspolitik",
    "effectiveDate": "Ikrafttrædelsesdato: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Oversigt",
        "body": "Kundetilfredshed er vores prioritet. Denne refusionspolitik beskriver kriterierne og processen for at anmode om en refusion."
      },
      "eligibility": {
        "title": "2. Berettigelse til refusion",
        "body": "Du kan være berettiget til en refusion inden for 30 dage efter dit første køb, hvis du ikke har brugt premiumfunktionerne i væsentlig grad. Refusioner ydes efter vores skøn."
      },
      "process": {
        "title": "3. Refusionsproces",
        "body": "For at starte en refusionsanmodning, kontakt venligst vores supportteam på support@legacyguard.com inden for 30 dage efter købet. Inkluder din konto-e-mail og årsagen til anmodningen."
      },
      "nonRefundable": {
        "title": "4. Ikke-refunderbare tjenester",
        "intro": "Følgende tjenester kan ikke refunderes:",
        "items": {
          "item1": "Månedlige abonnementer efter de første 30 dage",
          "item2": "Engangsgebyrer for dokumentbehandling",
          "item3": "Notarial- og juridiske konsulenttjenester"
        }
      },
      "processingTime": {
        "title": "5. Behandlingstid",
        "body": "Godkendte refusioner behandles inden for 5–10 arbejdsdage og krediteres din oprindelige betalingsmetode."
      }
    },
    "disclaimer": "[Dette er en pladsholder. Kontakt venligst en juridisk rådgiver for at udarbejde en fuldstændig refusionspolitik.]"
  }
}
