<<<<<<< Updated upstream
{}
=======
{
  "general": {
    "networkError": "Problemă de conexiune la rețea. Vă rugăm să verificați conexiunea la internet.",
    "serverError": "Întâmpinăm dificultăți tehnice. Vă rugăm să încercați din nou în scurt timp.",
    "timeoutError": "Solicitarea a expirat. Vă rugăm să încercați din nou.",
    "maintenanceMode": "În prezent efectuăm lucrări de întreținere. Vă rugăm să încercați din nou peste câteva minute.",
    "something_wrong": "Ceva nu a funcționat corect, dar nu vă faceți griji - informațiile dumneavoastră importante sunt în siguranță.",
    "try_again": "Lasă-mă să încerc din nou pentru tine",
    "contact_support": "Sunt aici să te ajut dacă ai nevoie de ajutor",
    "no_data_lost": "Vestea bună este că nimic din ceea ce ai lucrat nu s-a pierdut.",
    "temporary_issue": "Aceasta pare a fi o problemă temporară care ar trebui să se rezolve rapid"
  },
  "authentication": {
    "sessionExpired": "Sesiunea dvs. a expirat. Vă rugăm să vă conectați din nou.",
    "invalidCredentials": "Adresă de e-mail sau parolă nevalidă. Vă rugăm să încercați din nou.",
    "accountLocked": "Contul dumneavoastră a fost blocat temporar din motive de securitate.",
    "accountDisabled": "Contul dumneavoastră a fost dezactivat. Vă rugăm să contactați serviciul de asistență.",
    "emailNotVerified": "Vă rugăm să vă verificați adresa de e-mail înainte de a continua.",
    "passwordResetRequired": "Este necesară resetarea parolei. Vă rugăm să verificați e-mailul."
  },
  "authorization": {
    "accessDenied": "Nu aveți permisiunea de a accesa aceste informații.",
    "insufficientPermissions": "Nu aveți suficiente permisiuni pentru această acțiune.",
    "subscriptionRequired": "Această funcție necesită un abonament activ.",
    "upgradeRequired": "Vă rugăm să faceți upgrade la abonamentul dvs. pentru a accesa această funcție."
  },
  "validation": {
    "invalidEmail": "Vă rugăm să introduceți o adresă de email validă.",
    "invalidPhone": "Vă rugăm să introduceți un număr de telefon valid.",
    "invalidFormat": "Format nevalid. Vă rugăm să verificați datele introduse.",
    "passwordTooWeak": "Parola trebuie să aibă cel puțin 8 caractere, inclusiv majuscule, minuscule și cifre.",
    "passwordMismatch": "Parolele nu se potrivesc.",
    "fileTooLarge": "Dimensiunea fișierului depășește limita maximă de {{size}}MB.",
    "unsupportedFileType": "Acest tip de fișier nu este acceptat.",
    "required_field": "Familia dumneavoastră va avea nevoie de aceste informații - mă puteți ajuta să le completez?",
    "invalid_email": "Adresa de e-mail nu pare a fi corectă. Ai putea să o verifici din nou pentru mine?",
    "invalid_phone": "Am probleme cu formatul acelui număr de telefon. Ai putea încerca să-l introduci diferit?",
    "invalid_date": "Formatul de dată respectiv nu funcționează pentru mine. Ai putea încerca ZZ/LL/AAAA?",
    "password_weak": "Hai să facem parola puțin mai puternică pentru a păstra informațiile familiei tale în siguranță.",
    "file_too_large": "Fișierul ăla e puțin cam mare pentru mine. Ai putea încerca o versiune mai mică?",
    "unsupported_file": "Nu pot lucra cu acel tip de fișier. Ați putea încerca un PDF sau o imagine în schimb?",
    "errors": {
      "assetNameRequired": "Nume element Erori Obligatoriu",
      "assetTypeRequired": "Tipul de element pentru erori Obligatoriu",
      "nameMinLength": "Nume erori Lungime minimă",
      "allocationRequired": "Alocare erori necesară",
      "allocationMustBeNumber": "Alocare erori trebuie să fie număr",
      "allocationRange": "Interval de alocare a erorilor",
      "requiredField": "Câmp obligatoriu pentru erori",
      "mustBeNumber": "Erorile trebuie să fie numărate",
      "countryRequired": "Erori țară Obligatoriu",
      "countryCodeLength": "Erori cod țară lungime",
      "valueMustBeNumber": "Valoarea erorilor trebuie să fie un număr",
      "valueMustBePositive": "Valoarea erorilor trebuie să fie pozitivă",
      "currencyCodeLength": "Erori monedă Cod Lungime",
      "beneficiaryNameRequired": "Erori Nume beneficiar Obligatoriu",
      "invalidEmail": "Erori Email invalid",
      "invalidPhone": "Erori Telefon invalid",
      "documentNameRequired": "Nume document cu erori Obligatoriu",
      "documentTypeRequired": "Tip document cu erori Obligatoriu",
      "expirationDateFuture": "Data expirării erorilor în viitor",
      "relationshipRequired": "Relația de erori obligatorie",
      "unknownError": "Erori necunoscute Eroare",
      "dataNotFound": "Datele erorilor nu au fost găsite",
      "connectionError": "Erori de conectare Eroare",
      "permissionDenied": "Permisiunea erorilor a fost refuzată",
      "duplicateRecord": "Erori înregistrare duplicată"
    },
    "nameRequired": "Nume de validare Obligatoriu",
    "nameMinLength": "Nume de validare Lungime minimă",
    "jurisdictionRequired": "Jurisdicție de validare necesară",
    "dobRequired": "Data de validare este obligatorie",
    "addressRequired": "Adresă de validare obligatorie",
    "allocationError": "Eroare de alocare a validării",
    "beneficiaryRequired": "Beneficiar de validare necesar",
    "executorRequired": "Executor de validare necesar"
  },
  "data": {
    "loadingFailed": "Nu s-au putut încărca datele. Vă rugăm să actualizați pagina.",
    "savingFailed": "Nu s-au putut salva modificările. Vă rugăm să încercați din nou.",
    "deletingFailed": "Ștergerea elementului a eșuat. Vă rugăm să încercați din nou.",
    "uploadFailed": "Încărcarea fișierului a eșuat. Vă rugăm să încercați din nou.",
    "exportFailed": "Exportul datelor a eșuat. Vă rugăm să încercați din nou mai târziu.",
    "importFailed": "Importul datelor a eșuat. Vă rugăm să verificați formatul fișierului.",
    "syncFailed": "Sincronizarea a eșuat. Este posibil ca unele modificări să nu fie salvate."
  },
  "payment": {
    "paymentFailed": "Procesarea plății a eșuat. Vă rugăm să verificați metoda de plată.",
    "cardDeclined": "Cardul dumneavoastră a fost refuzat. Vă rugăm să încercați o altă metodă de plată.",
    "insufficientFunds": "Fonduri insuficiente. Vă rugăm să verificați soldul contului dumneavoastră.",
    "expiredCard": "Cardul dumneavoastră a expirat. Vă rugăm să actualizați informațiile de plată.",
    "invalidCard": "Informații despre card nevalide. Vă rugăm să vă verificați datele.",
    "paymentTimeout": "Procesarea plății a expirat. Vă rugăm să încercați din nou."
  },
  "actions": {
    "tryAgain": "Încearcă din nou",
    "signInAgain": "Conectați-vă din nou",
    "updatePayment": "Actualizare plată",
    "upgradeAccount": "Actualizați contul"
  },
  "debug": {
    "i18nDebug": {
      "current_lang_resources_7": "Resurse lingvistice actuale 7",
      "has_resources_6": "Are resurse 6",
      "i18n_debug_info_1": "Informații de depanare I18n 1",
      "resolved_language_3": "Limbaj rezolvat 3",
      "test_translation_5": "Traducere de test 5"
    }
  },
  "test": {
    "environment": {
      "description": "Descriere",
      "title": "Titlu"
    }
  },
  "notfound": {
    "title": "Pagina nu a fost găsită",
    "description": "Pagina pe care o căutați nu există sau a fost mutată.",
    "goHome": "Du-te acasă",
    "goBack": "Întoarce-te"
  },
  "network": {
    "connection_lost": "Se pare că ți s-a întrerupt conexiunea la internet. Lucrările tale sunt salvate și ne vom reconecta automat.",
    "slow_connection": "Conexiunea ta pare puțin lentă astăzi. Voi aștepta cu răbdare cât timp se încarcă.",
    "server_busy": "Serverele noastre sunt puțin cam ocupate acum, dar voi continua să încerc să te ajut.",
    "timeout": "A durat mai mult decât mă așteptam. Permiteți-mi să încerc o altă abordare."
  },
  "contextual": {
    "assets": {
      "save_failed": "Nu am putut salva informațiile despre acel bun acum, dar voi continua să încerc. Informațiile familiei tale sunt importante pentru mine.",
      "load_failed": "În acest moment, am probleme la încărcarea materialelor tale. Permite-mi să încerc din nou imediat.",
      "delete_failed": "Nu am putut elimina acel element chiar acum. Doriți să încerc din nou?"
    },
    "documents": {
      "upload_failed": "Documentul respectiv nu s-a încărcat corect. Nu-ți face griji - te voi ajuta să încerci din nou.",
      "processing_failed": "Am întâmpinat probleme la procesarea acelui document. Fișierul este în siguranță și voi încerca din nou.",
      "access_failed": "Nu pot accesa acel document acum. Stai să văd ce pot face ca să te ajut."
    },
    "family": {
      "save_failed": "Nu am putut salva informațiile acelei persoane chiar acum. Permiteți-mi să încerc din nou - cercul dvs. de încredere este important.",
      "invite_failed": "Nu am putut trimite invitația acum. Te voi ajuta să încerci din nou când ești gata.",
      "access_failed": "Am probleme cu setările de acces pentru familie. Permiteți-mi să rezolv asta pentru dvs."
    },
    "will": {
      "generation_failed": "Nu am putut să vă creez testamentul chiar acum. Nu vă faceți griji - toate deciziile dumneavoastră sunt salvate și voi încerca din nou.",
      "save_failed": "Nu am putut salva acele modificări ale testamentului acum. Versiunea ta anterioară este sigură și voi continua să încerc.",
      "legal_check_failed": "Nu am putut verifica cerințele legale chiar acum. Permiteți-mi să încerc din nou sau putem cere ajutor de la echipa noastră juridică."
    }
  },
  "emotional_support": {
    "frustration": "Știu că e frustrant când încerci să faci ceva important pentru familia ta. Sunt aici să te ajut să rezolvi asta.",
    "time_pressure": "Înțeleg că nu ai mult timp pentru probleme tehnice. Lasă-mă să mă ocup rapid de asta.",
    "overwhelm": "Problemele tehnice pot părea copleșitoare atunci când deja te confrunți cu o planificare familială importantă. Respiră adânc - mă descurc.",
    "discouragement": "Nu lăsa această problemă tehnică să te descurajeze. Ceea ce faci pentru familia ta este prea important ca să renunți la el."
  },
  "solutions": {
    "refresh_page": "Uneori, actualizarea paginii ajută. Munca ta este salvată, deci nu vei pierde nimic.",
    "try_different_browser": "Dacă se întâmplă acest lucru în mod repetat, încearcă să folosești un alt browser. De obicei, Chrome sau Firefox funcționează cel mai bine.",
    "check_internet": "Ai putea verifica conexiunea la internet? Uneori, asta e tot ce trebuie.",
    "contact_support": "Mi-ar plăcea să te ajut personal. Poți contacta echipa noastră de asistență, care va avea mare grijă de tine.",
    "try_later": "Dacă te grăbești, poți încerca din nou mai târziu. Tot ce ai făcut este salvat în siguranță.",
    "alternative_approach": "Permiteți-mi să sugerez o altă modalitate de a face asta, care ar putea funcționa mai bine."
  },
  "recovery": {
    "auto_save_worked": "Vestea bună este că tot ce ai introdus a fost salvat automat.",
    "backup_available": "Am o copie de rezervă a muncii tale de acum câteva minute, dacă ai nevoie de ea.",
    "progress_preserved": "Tot progresul tău este păstrat - nu va trebui să o iei de la capăt.",
    "data_secure": "Informațiile familiei tale rămân complet în siguranță în ciuda acestei probleme tehnice."
  },
  "errors": {
    "notAuthenticated": "Erori neautentificate",
    "generic": "Erori generice",
    "savingSettings": "Erori la salvarea setărilor",
    "loadingSettings": "Erori la încărcarea setărilor",
    "networkError": "Erori de rețea Eroare",
    "permissionDenied": "Permisiunea erorilor a fost refuzată",
    "dataNotFound": "Datele erorilor nu au fost găsite",
    "unknown": "Erori necunoscute",
    "uploadFailed": "Erori la încărcare eșuate",
    "accessDenied": "Erori de acces refuzate",
    "reassurance": {
      "data_safe": "Date de reasigurare în siguranță",
      "try_again": "Reasigurare, încercați din nou"
    },
    "loadingAssets": "Erori la încărcarea activelor",
    "failedToFetchStatus": "Erori care nu au reușit să recupereze starea",
    "validationFailed": "Validarea erorilor a eșuat",
    "generationFailed": "Generarea erorilor a eșuat",
    "duplicateRecord": "Erori înregistrare duplicată"
  }
}
>>>>>>> Stashed changes
