{
  "tos": {
    "title": "Termeni și condiții",
    "effectiveDate": "Data intrării în vigoare: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Acceptarea Termenilor",
        "body": "Prin accesarea sau utilizarea LegacyGuard Heritage Vault, sunteți de acord să respectați acești Termeni și condiții."
      },
      "service": {
        "title": "2. Descrierea serviciului",
        "body": "LegacyGuard Heritage Vault oferă servicii de gestionare a moștenirii digitale, inclusiv stocarea documentelor, generarea de testamente și partajarea securizată a informațiilor importante cu beneficiarii desemnați."
      },
      "responsibilities": {
        "title": "3. Responsabilitățile utilizatorului",
        "body": "Ești responsabil pentru menținerea confidențialității datelor de autentificare ale contului tău și pentru toate activitățile care au loc în cadrul contului tău."
      },
      "privacy": {
        "title": "4. Confidențialitate și protecția datelor",
        "body": "Confidențialitatea dumneavoastră este importantă pentru noi. Vă rugăm să consultați Politica noastră de confidențialitate pentru a înțelege cum colectăm, utilizăm și protejăm informațiile dumneavoastră."
      },
      "liability": {
        "title": "5. Limitarea răspunderii",
        "body": "LegacyGuard Heritage Vault nu va fi răspunzător pentru daune indirecte, incidentale, speciale, consecutive sau punitive rezultate din utilizarea serviciului de către dvs."
      }
    },
    "disclaimer": "[Acesta este un text temporar. Vă rugăm să consultați un consilier juridic pentru a crea Termeni și condiții complete.]"
  },
  "refund": {
    "title": "Politica de rambursare",
    "effectiveDate": "Data intrării în vigoare: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Prezentare generală",
        "body": "Satisfacția clienților este prioritatea noastră. Această Politică de rambursare prezintă criteriile și procesul de solicitare a unei rambursări."
      },
      "eligibility": {
        "title": "2. Eligibilitate pentru rambursări",
        "body": "Este posibil să fiți eligibil pentru o rambursare în termen de 30 de zile de la achiziția inițială dacă nu ați utilizat extensiv funcțiile premium. Rambursările sunt acordate la discreția noastră."
      },
      "process": {
        "title": "3. Procesul de rambursare",
        "body": "Pentru a iniția o cerere de rambursare, vă rugăm să contactați echipa noastră de asistență la adresa support@legacyguard.com în termen de 30 de zile de la achiziție. Includeți adresa de e-mail a contului dvs. și motivul cererii de rambursare."
      },
      "nonRefundable": {
        "title": "4. Servicii nerambursabile",
        "intro": "Următoarele servicii nu sunt rambursabile:",
        "items": {
          "item1": "Abonamente lunare după primele 30 de zile",
          "item2": "Taxe unice de procesare a documentelor",
          "item3": "Servicii de notarizare și consultanță juridică"
        }
      },
      "processingTime": {
        "title": "5. Timpul de procesare",
        "body": "Rambursările aprobate vor fi procesate în termen de 5-10 zile lucrătoare și creditate prin metoda de plată inițială."
      }
    },
    "disclaimer": "[Acesta este un text temporar. Vă rugăm să consultați un consilier juridic pentru a crea o Politică de rambursare cuprinzătoare.]"
  }
}
