{
  "tos": {
    "title": "Warunki świadczenia usług",
    "effectiveDate": "Data wejścia w życie: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Akceptacja warunków",
        "body": "Uzyskując dostęp do LegacyGuard Heritage Vault lub korzystając z niego, akceptujesz niniejsze Warunki świadczenia usług."
      },
      "service": {
        "title": "2. Opis usługi",
        "body": "LegacyGuard Heritage Vault świadczy usługi zarządzania dziedzictwem cyfrowym, w tym przechowywanie dokumentów, tworzenie testamentów oraz bezpieczne udostępnianie ważnych informacji wyznaczonym beneficjentom."
      },
      "responsibilities": {
        "title": "3. Obowiązki użytkownika",
        "body": "Jesteś odpowiedzialny za zachowanie poufności danych logowania do swojego konta oraz za wszystkie działania wykonywane w ramach konta."
      },
      "privacy": {
        "title": "4. Prywatność i ochrona danych",
        "body": "Twoja prywatność jest dla nas ważna. Zapoznaj się z naszą Polityką prywatności, aby dowiedzieć się, w jaki sposób gromadzimy, wykorzystujemy i chronimy Twoje dane."
      },
      "liability": {
        "title": "5. Ograniczenie odpowiedzialności",
        "body": "LegacyGuard Heritage Vault nie ponosi odpowiedzialności za szkody pośrednie, przypadkowe, szczególne, wtórne ani karne wynikające z korzystania z usługi."
      }
    },
    "disclaimer": "[To jest tekst przykładowy. Skonsultuj się z prawnikiem w celu przygotowania pełnych Warunków świadczenia usług.]"
  },
  "refund": {
    "title": "Polityka zwrotów",
    "effectiveDate": "Data wejścia w życie: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Przegląd",
        "body": "Satysfakcja klienta jest naszym priorytetem. Niniejsza Polityka zwrotów określa kryteria i proces składania wniosku o zwrot."
      },
      "eligibility": {
        "title": "2. Kwalifikowalność do zwrotu",
        "body": "Możesz być uprawniony do zwrotu w ciągu 30 dni od pierwotnego zakupu, jeśli nie korzystałeś w dużym stopniu z funkcji premium. Zwroty przyznawane są według naszego uznania."
      },
      "process": {
        "title": "3. Proces zwrotu",
        "body": "Aby rozpocząć procedurę zwrotu, skontaktuj się z naszym zespołem wsparcia pod adresem support@legacyguard.com w ciągu 30 dni od zakupu. Podaj adres e-mail swojego konta oraz powód wniosku."
      },
      "nonRefundable": {
        "title": "4. Usługi bezzwrotne",
        "intro": "Następujące usługi nie podlegają zwrotowi:",
        "items": {
          "item1": "Subskrypcje miesięczne po pierwszych 30 dniach",
          "item2": "Jednorazowe opłaty za przetwarzanie dokumentów",
          "item3": "Usługi notarialne i porady prawne"
        }
      },
      "processingTime": {
        "title": "5. Czas realizacji",
        "body": "Zatwierdzone zwroty zostaną przetworzone w ciągu 5–10 dni roboczych i zaksięgowane na pierwotnej metodzie płatności."
      }
    },
    "disclaimer": "[To jest tekst przykładowy. Skonsultuj się z prawnikiem w celu przygotowania pełnej Polityki zwrotów.]"
  }
}
