{
  "general": {
    "something_wrong": "Noe gikk ikke helt som det skulle, men ikke bekymre deg – den viktige informasjonen din er trygg.",
    "try_again": "La meg prøve det igjen for deg",
    "contact_support": "Jeg er her for å hjelpe hvis du trenger assistanse",
    "no_data_lost": "Den gode nyheten er at ingenting av det du har gjort har gått tapt",
    "temporary_issue": "Dette ser ut til å være et midlertidig problem som snart bør være løst"
  },
  "network": {
    "connection_lost": "Det ser ut som internettforbindelsen din ble avbrutt. Arbeidet ditt er lagret, og vi kobler til igjen automatisk.",
    "slow_connection": "Forbindelsen din virker litt treg i dag. Jeg venter tålmodig mens alt lastes inn.",
    "server_busy": "Serverne våre er litt travle akkurat nå, men jeg fortsetter å prøve å hjelpe deg.",
    "timeout": "Det tok lenger tid enn forventet. La meg prøve en annen tilnærming."
  },
  "validation": {
    "required_field": "Familien din trenger denne informasjonen – kan du hjelpe meg med å fylle den inn?",
    "invalid_email": "Denne e-postadressen ser ikke helt riktig ut. Kan du dobbeltsjekke den for meg?",
    "invalid_phone": "Jeg har problemer med dette telefonnummerformatet. Kan du prøve å skrive det inn på en annen måte?",
    "invalid_date": "Dette datoformatet fungerer ikke for meg. Kan du prøve MM/DD/ÅÅÅÅ?",
    "password_weak": "La oss gjøre passordet ditt litt sterkere for å holde familiens informasjon ekstra trygg.",
    "file_too_large": "Denne filen er litt for stor for meg å håndtere. Kan du prøve en mindre versjon?",
    "unsupported_file": "Jeg kan ikke jobbe med denne filtypen. Kan du prøve en PDF eller et bilde i stedet?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Jeg kunne ikke lagre denne eiendomsinformasjonen akkurat nå, men jeg fortsetter å prøve. Familiens informasjon er viktig for meg.",
      "load_failed": "Jeg har problemer med å laste inn eiendelene dine. La meg prøve igjen om et øyeblikk.",
      "delete_failed": "Jeg kunne ikke fjerne dette elementet akkurat nå. Vil du at jeg skal prøve igjen?"
    },
    "documents": {
      "upload_failed": "Det dokumentet ble ikke lastet opp riktig. Ikke bekymre deg – jeg hjelper deg med å prøve igjen.",
      "processing_failed": "Jeg hadde problemer med å behandle det dokumentet. Filen er trygg, og jeg prøver igjen.",
      "access_failed": "Jeg får ikke tilgang til det dokumentet akkurat nå. La meg se hva jeg kan gjøre for å hjelpe."
    },
    "family": {
      "save_failed": "Jeg kunne ikke lagre denne personens informasjon akkurat nå. La meg prøve igjen – din tillitskrets er viktig.",
      "invite_failed": "Jeg kunne ikke sende den invitasjonen akkurat nå. Jeg hjelper deg med å prøve igjen når du er klar.",
      "access_failed": "Jeg har problemer med familieadgangsinnstillingene. La meg ordne dette for deg."
    },
    "will": {
      "generation_failed": "Jeg kunne ikke opprette testamentet ditt akkurat nå. Ikke bekymre deg – alle avgjørelsene dine er lagret, og jeg prøver igjen.",
      "save_failed": "Jeg kunne ikke lagre endringene i testamentet akkurat nå. Den forrige versjonen er trygg, og jeg fortsetter å prøve.",
      "legal_check_failed": "Jeg kunne ikke verifisere de juridiske kravene akkurat nå. La meg prøve igjen, eller vi kan få hjelp fra vårt juridiske team."
    }
  },
  "emotional_support": {
    "frustration": "Jeg vet dette er frustrerende når du prøver å gjøre noe viktig for familien din. Jeg er her for å få det til å fungere.",
    "time_pressure": "Jeg forstår at du ikke har mye tid til tekniske problemer. La meg ordne dette raskt for deg.",
    "overwhelm": "Tekniske problemer kan føles overveldende når du allerede jobber med viktig familieplanlegging. Ta et pust – jeg har dette.",
    "discouragement": "Ikke la dette tekniske problemet motløse deg. Det du gjør for familien din er for viktig til å gi opp."
  },
  "solutions": {
    "refresh_page": "Noen ganger hjelper det å oppdatere siden. Arbeidet ditt er lagret, så du mister ingenting.",
    "try_different_browser": "Hvis dette fortsetter å skje, prøv å bruke en annen nettleser. Chrome eller Firefox fungerer vanligvis best.",
    "check_internet": "Kan du sjekke internettforbindelsen din? Noen ganger er det alt som skal til.",
    "contact_support": "Jeg hjelper deg gjerne personlig. Du kan kontakte vårt supportteam som vil ta godt vare på deg.",
    "try_later": "Hvis du har det travelt, kan du prøve igjen senere. Alt du har gjort er trygt lagret.",
    "alternative_approach": "La meg foreslå en annen måte å gjøre dette på som kanskje fungerer bedre."
  },
  "recovery": {
    "auto_save_worked": "Den gode nyheten er at alt du har skrevet inn ble lagret automatisk.",
    "backup_available": "Jeg har en sikkerhetskopi av arbeidet ditt fra for noen minutter siden hvis du trenger det.",
    "progress_preserved": "All fremdriften din er bevart – du trenger ikke starte på nytt.",
    "data_secure": "Familiens informasjon forblir helt sikker til tross for dette tekniske problemet."
  }
}

