{
  "general": {
    "something_wrong": "Nešto nije prošlo kako treba, ali ne brinite – vaši važni podaci su sigurni.",
    "try_again": "Dozvolite mi da pokušam ponovo za vas",
    "contact_support": "Ovdje sam da vam pomognem ako vam je potrebna podrška",
    "no_data_lost": "Dobra vijest je da ništa od vašeg rada nije izgubljeno",
    "temporary_issue": "Izgleda da je ovo privremeni problem koji bi uskoro trebalo da bude riješen"
  },
  "network": {
    "connection_lost": "Izgleda da je vaša internet konekcija prekinuta. Vaš rad je sačuvan i automatski ćemo se ponovo povezati.",
    "slow_connection": "Vaša konekcija danas izgleda malo sporije. Strpljivo ću sačekati dok se sve ne učita.",
    "server_busy": "Naši serveri su trenutno malo zauzeti, ali nastaviću da pokušavam da vam pomognem.",
    "timeout": "Ovo je trajalo duže nego što se očekivalo. Dozvolite mi da probam drugačiji pristup."
  },
  "validation": {
    "required_field": "Vašoj porodici će trebati ove informacije – možete li mi pomoći da ih unesemo?",
    "invalid_email": "Ova e-mail adresa ne izgleda ispravno. Možete li je provjeriti ponovo?",
    "invalid_phone": "Imam problem sa formatom ovog broja telefona. Možete li pokušati da ga unesete drugačije?",
    "invalid_date": "Ovaj format datuma mi ne odgovara. Možete li probati MM/DD/GGGG?",
    "password_weak": "Hajde da vašu lozinku učinimo malo jačom kako bismo dodatno zaštitili informacije vaše porodice.",
    "file_too_large": "Ova datoteka je malo prevelika za obradu. Možete li pokušati manju verziju?",
    "unsupported_file": "Ne mogu da radim sa ovom vrstom datoteke. Možete li probati PDF ili sliku?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Trenutno nijesam mogao da sačuvam informacije o ovoj imovini, ali nastaviću da pokušavam. Podaci vaše porodice su mi važni.",
      "load_failed": "Imam poteškoća sa učitavanjem vaše imovine. Dozvolite mi da probam ponovo za trenutak.",
      "delete_failed": "Nijesam mogao da uklonim ovu stavku sada. Želite li da pokušam ponovo?"
    },
    "documents": {
      "upload_failed": "Ovaj dokument nije pravilno otpremljen. Ne brinite – pomoći ću vam da pokušate ponovo.",
      "processing_failed": "Imao sam problem prilikom obrade ovog dokumenta. Datoteka je sigurna i pokušaću ponovo.",
      "access_failed": "Ne mogu trenutno da pristupim ovom dokumentu. Dozvolite mi da vidim šta mogu da uradim da pomognem."
    },
    "family": {
      "save_failed": "Nijesam mogao da sačuvam podatke o ovoj osobi sada. Pokušajmo ponovo – vaš krug povjerenja je važan.",
      "invite_failed": "Nijesam mogao da pošaljem ovaj poziv sada. Pomoći ću vam da pokušate ponovo kada budete spremni.",
      "access_failed": "Imam problem sa podešavanjima pristupa porodici. Dozvolite mi da to riješim za vas."
    },
    "will": {
      "generation_failed": "Nijesam mogao da kreiram vaš testament sada. Ne brinite – sve vaše odluke su sačuvane i pokušaću ponovo.",
      "save_failed": "Nijesam mogao da sačuvam izmjene testamenta sada. Prethodna verzija je sigurna i nastaviću da pokušavam.",
      "legal_check_failed": "Nijesam mogao da provjerim pravne zahtjeve sada. Dozvolite mi da probam ponovo ili da potražimo pomoć našeg pravnog tima."
    }
  },
  "emotional_support": {
    "frustration": "Znam da je frustrirajuće kada pokušavate da uradite nešto važno za svoju porodicu. Ovdje sam da vam pomognem da to uspješno završite.",
    "time_pressure": "Razumijem da nemate mnogo vremena za tehničke probleme. Dozvolite mi da to brzo riješim za vas.",
    "overwhelm": "Tehnički problemi mogu biti opterećujući kada se već bavite važnim porodičnim planiranjem. Udahnite duboko – ja ću to preuzeti.",
    "discouragement": "Nemojte dozvoliti da vas ovaj tehnički problem obeshrabri. Ono što radite za svoju porodicu je previše važno da biste odustali."
  },
  "solutions": {
    "refresh_page": "Ponekad pomaže da se stranica osveži. Vaš rad je sačuvan, tako da ništa nećete izgubiti.",
    "try_different_browser": "Ako se ovo nastavi dešavati, pokušajte da koristite drugi pretraživač. Chrome ili Firefox obično najbolje rade.",
    "check_internet": "Možete li provjeriti vašu internet konekciju? Ponekad je to sve što je potrebno.",
    "contact_support": "Rado ću vam pomoći lično. Možete kontaktirati naš tim za podršku koji će se dobro pobrinuti za vas.",
    "try_later": "Ako žurite, možete pokušati ponovo kasnije. Sve što ste uradili je bezbjedno sačuvano.",
    "alternative_approach": "Dozvolite mi da predložim drugi način da ovo uradimo koji bi mogao bolje funkcionisati."
  },
  "recovery": {
    "auto_save_worked": "Dobra vijest je da je sve što ste unijeli automatski sačuvano.",
    "backup_available": "Imam rezervnu kopiju vašeg rada od prije nekoliko minuta ako vam zatreba.",
    "progress_preserved": "Sav vaš napredak je sačuvan – nećete morati da počnete ispočetka.",
    "data_secure": "Podaci vaše porodice ostaju potpuno sigurni uprkos ovom tehničkom problemu."
  }
}
