{
  "general": {
    "networkError": "Probleem met netwerkverbinding. Controleer uw internetverbinding.",
    "serverError": "Er zijn technische problemen. Probeer het later opnieuw.",
    "timeoutError": "Verzoek is verlopen. Probeer het opnieuw.",
    "maintenanceMode": "Er wordt momenteel onderhoud uitgevoerd. Probeer het over een paar minuten opnieuw.",
    "something_wrong": "Er is iets niet helemaal goed gegaan, maar maak je geen zorgen: je belangrijke gegevens zijn veilig.",
    "try_again": "Laat me dat nog eens voor je proberen",
    "contact_support": "Ik ben er om u te helpen als u hulp nodig heeft",
    "no_data_lost": "Het goede nieuws is dat er niets verloren is gegaan van waar je aan hebt gewerkt",
    "temporary_issue": "Dit lijkt een tijdelijk probleem te zijn dat snel opgelost zou moeten zijn"
  },
  "authentication": {
    "sessionExpired": "Je sessie is verlopen. Meld je opnieuw aan.",
    "invalidCredentials": "Ongeldig e-mailadres of wachtwoord. Probeer het opnieuw.",
    "accountLocked": "Uw account is tijdelijk geblokkeerd vanwege veiligheidsredenen.",
    "accountDisabled": "Je account is uitgeschakeld. Neem contact op met de support.",
    "emailNotVerified": "Controleer uw e-mailadres voordat u verdergaat.",
    "passwordResetRequired": "Wachtwoord opnieuw instellen is vereist. Controleer uw e-mail."
  },
  "authorization": {
    "accessDenied": "U hebt geen toestemming om deze informatie te bekijken.",
    "insufficientPermissions": "U beschikt niet over voldoende machtigingen voor deze actie.",
    "subscriptionRequired": "Voor deze functie is een actief abonnement vereist.",
    "upgradeRequired": "Werk uw abonnement bij om toegang te krijgen tot deze functie."
  },
  "validation": {
    "invalidEmail": "Voer een geldig e-mailadres in.",
    "invalidPhone": "Voer een geldig telefoonnummer in.",
    "invalidFormat": "Ongeldig formaat. Controleer uw invoer.",
    "passwordTooWeak": "Het wachtwoord moet minimaal 8 tekens lang zijn, bestaande uit hoofdletters, kleine letters en cijfers.",
    "passwordMismatch": "Wachtwoorden komen niet overeen.",
    "fileTooLarge": "De bestandsgrootte overschrijdt de maximumlimiet van {{size}}MB.",
    "unsupportedFileType": "Dit bestandstype wordt niet ondersteund.",
    "required_field": "Uw familie heeft deze informatie nodig. Kunt u mij helpen deze in te vullen?",
    "invalid_email": "Dat e-mailadres klopt niet helemaal. Kun je het even voor me controleren?",
    "invalid_phone": "Ik heb problemen met het telefoonnummerformaat. Kunt u het anders invoeren?",
    "invalid_date": "Dat datumformaat werkt niet voor mij. Kun je MM/DD/JJJJ proberen?",
    "password_weak": "Laten we uw wachtwoord sterker maken om de informatie van uw gezin extra veilig te houden.",
    "file_too_large": "Dat bestand is iets te groot voor mij. Kun je een kleinere versie proberen?",
    "unsupported_file": "Ik kan niet met dat bestandstype werken. Kunt u in plaats daarvan een PDF of afbeelding proberen?"
  },
  "data": {
    "loadingFailed": "Gegevens laden mislukt. Vernieuw de pagina.",
    "savingFailed": "Wijzigingen opslaan mislukt. Probeer het opnieuw.",
    "deletingFailed": "Item verwijderen mislukt. Probeer het opnieuw.",
    "uploadFailed": "Het uploaden van het bestand is mislukt. Probeer het opnieuw.",
    "exportFailed": "Gegevensexport mislukt. Probeer het later opnieuw.",
    "importFailed": "Gegevensimport mislukt. Controleer het bestandsformaat.",
    "syncFailed": "Synchronisatie mislukt. Sommige wijzigingen worden mogelijk niet opgeslagen."
  },
  "payment": {
    "paymentFailed": "Betaling mislukt. Controleer uw betaalmethode.",
    "cardDeclined": "Uw kaart is geweigerd. Probeer een andere betaalmethode.",
    "insufficientFunds": "Onvoldoende saldo. Controleer uw rekeningsaldo.",
    "expiredCard": "Uw kaart is verlopen. Werk uw betalingsgegevens bij.",
    "invalidCard": "Ongeldige kaartgegevens. Controleer uw gegevens.",
    "paymentTimeout": "De betalingsverwerking is verlopen. Probeer het opnieuw."
  },
  "actions": {
    "tryAgain": "Probeer het opnieuw",
    "signInAgain": "Opnieuw aanmelden",
    "updatePayment": "Betaling bijwerken",
    "upgradeAccount": "Account upgraden"
  },
  "debug": {
    "i18nDebug": {
      "current_lang_resources_7": "Huidige taalbronnen 7",
      "has_resources_6": "Heeft bronnen 6",
      "i18n_debug_info_1": "I18n debug-info 1",
      "resolved_language_3": "Opgeloste taal 3",
      "test_translation_5": "Testvertaling 5"
    }
  },
  "test": {
    "environment": {
      "description": "Beschrijving",
      "title": "Titel"
    }
  },
  "notfound": {
    "title": "Pagina niet gevonden",
    "description": "De pagina die u zoekt bestaat niet of is verplaatst.",
    "goHome": "Ga naar huis",
    "goBack": "Ga terug"
  },
  "network": {
    "connection_lost": "Het lijkt erop dat je internetverbinding is verbroken. Je werk is opgeslagen en we maken automatisch weer verbinding.",
    "slow_connection": "Je verbinding lijkt vandaag wat traag. Ik wacht geduldig tot alles geladen is.",
    "server_busy": "Onze servers zijn momenteel wat druk, maar ik blijf proberen u te helpen.",
    "timeout": "Dat duurde langer dan verwacht. Laat ik het anders proberen."
  },
  "contextual": {
    "assets": {
      "save_failed": "Ik kan die activa-informatie nu niet opslaan, maar ik blijf het proberen. De gegevens van je familie zijn belangrijk voor me.",
      "load_failed": "Ik heb momenteel problemen met het laden van je assets. Ik probeer het zo meteen opnieuw.",
      "delete_failed": "Ik kon dat item net niet verwijderen. Wil je dat ik het opnieuw probeer?"
    },
    "documents": {
      "upload_failed": "Dat document is niet goed geüpload. Maak je geen zorgen, ik help je graag om het opnieuw te proberen.",
      "processing_failed": "Ik had problemen met het verwerken van dat document. Het bestand is veilig en ik probeer het opnieuw.",
      "access_failed": "Ik heb momenteel geen toegang tot dat document. Ik zal kijken wat ik voor je kan doen."
    },
    "family": {
      "save_failed": "Ik kon de gegevens van die persoon net niet opslaan. Laat me het nog eens proberen - je vertrouwde kring is belangrijk.",
      "invite_failed": "Ik kan die uitnodiging nu niet versturen. Ik help je graag om het opnieuw te proberen als je er klaar voor bent.",
      "access_failed": "Ik heb problemen met de instellingen voor gezinstoegang. Laat me dit voor je oplossen."
    },
    "will": {
      "generation_failed": "Ik kon je testament nu niet opstellen. Maak je geen zorgen - al je beslissingen zijn opgeslagen en ik probeer het opnieuw.",
      "save_failed": "Ik kon die wijzigingen nu niet opslaan. Je vorige versie is veilig en ik blijf het proberen.",
      "legal_check_failed": "Ik kon de wettelijke vereisten op dit moment niet verifiëren. Ik probeer het opnieuw, of we kunnen hulp krijgen van ons juridische team."
    }
  },
  "emotional_support": {
    "frustration": "Ik weet dat dit frustrerend is als je iets belangrijks voor je gezin probeert te doen. Ik ben er om je te helpen dit te laten slagen.",
    "time_pressure": "Ik begrijp dat u niet veel tijd heeft voor technische problemen. Laat mij dit snel voor u afhandelen.",
    "overwhelm": "Technische problemen kunnen overweldigend aanvoelen als je al met belangrijke gezinsplanningszaken bezig bent. Haal even adem - ik kan het.",
    "discouragement": "Laat je niet ontmoedigen door dit technische probleem. Wat je voor je gezin doet, is te belangrijk om op te geven."
  },
  "solutions": {
    "refresh_page": "Soms helpt het om de pagina te vernieuwen. Je werk blijft bewaard, dus je verliest niets.",
    "try_different_browser": "Als dit probleem blijft optreden, probeer dan een andere browser. Chrome of Firefox werkt meestal het beste.",
    "check_internet": "Zou je je internetverbinding even kunnen controleren? Soms is dat al voldoende.",
    "contact_support": "Ik help je graag persoonlijk verder. Je kunt contact opnemen met ons supportteam, dat je graag te woord staat.",
    "try_later": "Als je haast hebt, kun je het later nog eens proberen. Alles wat je hebt gedaan, wordt veilig opgeslagen.",
    "alternative_approach": "Ik stel voor dat dit op een andere manier wordt gedaan, die wellicht beter werkt."
  },
  "recovery": {
    "auto_save_worked": "Het goede nieuws is dat alles wat u invoert automatisch wordt opgeslagen.",
    "backup_available": "Ik heb een back-up van je werk van een paar minuten geleden, mocht je die nodig hebben.",
    "progress_preserved": "Al uw vorderingen blijven bewaard: u hoeft niet opnieuw te beginnen.",
    "data_secure": "Ondanks dit technische probleem blijven de gegevens van uw gezin volledig veilig."
  }
}
