{
  "tos": {
    "title": "Servicevoorwaarden",
    "effectiveDate": "Ingangsdatum: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Aanvaarding van de voorwaarden",
        "body": "Door LegacyGuard Heritage Vault te openen of te gebruiken, gaat u ermee akkoord gebonden te zijn aan deze Servicevoorwaarden."
      },
      "service": {
        "title": "2. Servicebeschrijving",
        "body": "LegacyGuard Heritage Vault biedt digitale diensten voor nalatenschapsbeheer, waaronder documentenopslag, het opstellen van testamenten en het veilig delen van belangrijke informatie met aangewezen begunstigden."
      },
      "responsibilities": {
        "title": "3. Verantwoordelijkheden van de gebruiker",
        "body": "U bent verantwoordelijk voor het geheimhouden van uw accountgegevens en voor alle activiteiten die via uw account plaatsvinden."
      },
      "privacy": {
        "title": "4. Privacy en gegevensbescherming",
        "body": "Uw privacy is belangrijk voor ons. Lees ons privacybeleid om te begrijpen hoe wij uw gegevens verzamelen, gebruiken en beschermen."
      },
      "liability": {
        "title": "5. Beperking van aansprakelijkheid",
        "body": "LegacyGuard Heritage Vault is niet aansprakelijk voor enige indirecte, incidentele, speciale, gevolg- of strafschade die voortvloeit uit uw gebruik van de service."
      }
    },
    "disclaimer": "[Dit is een tijdelijke aanduiding. Raadpleeg een juridisch adviseur om uitgebreide Servicevoorwaarden op te stellen.]"
  },
  "refund": {
    "title": "Restitutiebeleid",
    "effectiveDate": "Ingangsdatum: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Overzicht",
        "body": "Klanttevredenheid is onze prioriteit. Dit restitutiebeleid beschrijft de criteria en de procedure voor het aanvragen van een restitutie."
      },
      "eligibility": {
        "title": "2. Recht op restitutie",
        "body": "U komt mogelijk in aanmerking voor restitutie binnen 30 dagen na uw eerste aankoop als u de premiumfuncties niet uitgebreid hebt gebruikt. Restituties worden naar eigen goeddunken verleend."
      },
      "process": {
        "title": "3. Terugbetalingsproces",
        "body": "Om een restitutieverzoek in te dienen, neemt u binnen 30 dagen na aankoop contact op met ons supportteam via support@legacyguard.com. Vermeld daarbij uw account-e-mailadres en de reden voor het restitutieverzoek."
      },
      "nonRefundable": {
        "title": "4. Niet-restitueerbare diensten",
        "intro": "De volgende diensten worden niet terugbetaald:",
        "items": {
          "item1": "Maandelijkse abonnementen na de eerste 30 dagen",
          "item2": "Eenmalige kosten voor documentverwerking",
          "item3": "Notariële en juridische adviesdiensten"
        }
      },
      "processingTime": {
        "title": "5. Verwerkingstijd",
        "body": "Goedgekeurde terugbetalingen worden binnen 5-10 werkdagen verwerkt en bijgeschreven op uw oorspronkelijke betaalmethode."
      }
    },
    "disclaimer": "[Dit is een tijdelijke aanduiding. Raadpleeg een juridisch adviseur om een uitgebreid restitutiebeleid op te stellen.]"
  }
}
