{
  "general": {
    "something_wrong": "Eitthvað virkaði ekki alveg rétt, en ekki hafa áhyggjur – mikilvægar upplýsingar þínar eru öruggar.",
    "try_again": "Leyfðu mér að reyna aftur fyrir þig",
    "contact_support": "Ég er hér til að hjálpa ef þú þarft aðstoð",
    "no_data_lost": "Góða fréttin er sú að ekkert af því sem þú hefur unnið við hefur tapast",
    "temporary_issue": "Þetta virðist vera tímabundið vandamál sem ætti að leysast fljótlega"
  },
  "network": {
    "connection_lost": "Það lítur út fyrir að nettengingin þín hafi slitnað. Verkið þitt er vistað og við tengjumst aftur sjálfkrafa.",
    "slow_connection": "Tengingin þín virðist aðeins hæg í dag. Ég mun bíða þolinmóður á meðan allt hleðst.",
    "server_busy": "Netþjónarnir okkar eru aðeins uppteknir þessa stundina, en ég mun halda áfram að reyna að hjálpa þér.",
    "timeout": "Þetta tók lengri tíma en búist var við. Leyfðu mér að prófa aðra nálgun."
  },
  "validation": {
    "required_field": "Fjölskyldan þín mun þurfa þessar upplýsingar – geturðu hjálpað mér að fylla þær inn?",
    "invalid_email": "Þetta netfang virðist ekki vera alveg rétt. Gætirðu athugað það aftur?",
    "invalid_phone": "Ég á í erfiðleikum með þetta símnúmeraform. Gætirðu reynt að slá það inn á annan hátt?",
    "invalid_date": "Þetta dagsetningaform virkar ekki fyrir mig. Gætirðu prófað MM/DD/ÁÁÁÁ?",
    "password_weak": "Gerum lykilorðið þitt aðeins sterkara til að halda upplýsingum fjölskyldunnar þinnar enn öruggari.",
    "file_too_large": "Þessi skrá er aðeins of stór fyrir mig að meðhöndla. Gætirðu prófað minni útgáfu?",
    "unsupported_file": "Ég get ekki unnið með þessa skráartegund. Gætirðu prófað PDF eða mynd í staðinn?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Mér tókst ekki að vista upplýsingar um þessa eign núna, en ég mun halda áfram að reyna. Upplýsingar fjölskyldunnar þinnar eru mér mikilvægar.",
      "load_failed": "Ég á í vandræðum með að hlaða eignirnar þínar núna. Leyfðu mér að prófa aftur eftir smá stund.",
      "delete_failed": "Mér tókst ekki að fjarlægja þetta atriði núna. Viltu að ég reyni aftur?"
    },
    "documents": {
      "upload_failed": "Þessu skjali var ekki hlaðið upp rétt. Ekki hafa áhyggjur – ég hjálpa þér að prófa aftur.",
      "processing_failed": "Ég átti í vandræðum með að vinna úr þessu skjali. Skráin er örugg og ég mun reyna aftur.",
      "access_failed": "Ég get ekki nálgast þetta skjal núna. Leyfðu mér að sjá hvað ég get gert til að hjálpa."
    },
    "family": {
      "save_failed": "Mér tókst ekki að vista upplýsingar um þennan einstakling núna. Reynum aftur – trausti hringurinn þinn er mikilvægur.",
      "invite_failed": "Mér tókst ekki að senda þetta boð núna. Ég hjálpa þér að prófa aftur þegar þú ert tilbúin(n).",
      "access_failed": "Ég á í vandræðum með aðgangsstillingar fjölskyldunnar. Leyfðu mér að sjá um þetta fyrir þig."
    },
    "will": {
      "generation_failed": "Mér tókst ekki að búa til erfðaskrána þína núna. Ekki hafa áhyggjur – allar ákvarðanir þínar eru vistaðar og ég mun reyna aftur.",
      "save_failed": "Mér tókst ekki að vista breytingarnar á erfðaskránni núna. Fyrri útgáfan er örugg og ég mun halda áfram að reyna.",
      "legal_check_failed": "Mér tókst ekki að staðfesta lagalegar kröfur núna. Leyfðu mér að prófa aftur eða við getum fengið aðstoð frá lögfræðiteyminu okkar."
    }
  },
  "emotional_support": {
    "frustration": "Ég veit að það er svekkjandi þegar þú reynir að gera eitthvað mikilvægt fyrir fjölskylduna þína. Ég er hér til að hjálpa þér að láta það takast.",
    "time_pressure": "Ég skil að þú hefur ekki mikinn tíma fyrir tæknileg vandamál. Leyfðu mér að sjá fljótt um þetta fyrir þig.",
    "overwhelm": "Tæknileg vandamál geta verið yfirþyrmandi þegar þú ert þegar að takast á við mikilvæga fjölskylduáætlun. Andaðu rólega – ég hef þetta á hreinu.",
    "discouragement": "Láttu þetta tæknilega vandamál ekki draga úr kjarki þínum. Það sem þú gerir fyrir fjölskylduna þína er of mikilvægt til að gefast upp."
  },
  "solutions": {
    "refresh_page": "Stundum hjálpar það að endurhlaða síðuna. Verkið þitt er vistað, svo þú tapar engu.",
    "try_different_browser": "Ef þetta heldur áfram skaltu prófa annan vafra. Chrome eða Firefox virka venjulega best.",
    "check_internet": "Gætirðu athugað nettenginguna þína? Stundum er það allt sem þarf.",
    "contact_support": "Ég myndi gjarnan hjálpa þér persónulega. Þú getur haft samband við þjónustuteymið okkar sem mun sjá vel um þig.",
    "try_later": "Ef þú ert í tímaþröng geturðu reynt aftur seinna. Allt sem þú hefur gert er vistað á öruggan hátt.",
    "alternative_approach": "Leyfðu mér að leggja til annan hátt til að gera þetta sem gæti virkað betur."
  },
  "recovery": {
    "auto_save_worked": "Góða fréttin er að allt sem þú slóst inn var vistað sjálfkrafa.",
    "backup_available": "Ég er með öryggisafrit af verkinu þínu frá fyrir nokkrum mínútum ef þú þarft á því að halda.",
    "progress_preserved": "Allt framfarastigið þitt er varðveitt – þú þarft ekki að byrja upp á nýtt.",
    "data_secure": "Upplýsingar fjölskyldunnar þinnar eru ennþá fullkomlega öruggar þrátt fyrir þetta tæknilega vandamál."
  }
}
