{
  "tos": {
    "title": "Þjónustuskilmálar",
    "effectiveDate": "Gildistökudagur: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Samþykki skilmála",
        "body": "Með því að fá aðgang að eða nota LegacyGuard Heritage Vault samþykkir þú að vera bundinn af þessum þjónustuskilmálum."
      },
      "service": {
        "title": "2. Þjónustulýsing",
        "body": "LegacyGuard Heritage Vault býður upp á stafræna arfleifðarstjórnunarþjónustu, þar á meðal geymslu skjala, gerð erfðaskráa og örugga miðlun mikilvægra upplýsinga með tilnefndum erfðafjárhaldsmönnum."
      },
      "responsibilities": {
        "title": "3. Ábyrgð notenda",
        "body": "Þú berð ábyrgð á að viðhalda trúnaði um aðgangsupplýsingar þínar og fyrir alla starfsemi sem fer fram í gegnum reikninginn þinn."
      },
      "privacy": {
        "title": "4. Persónuvernd og gagnavernd",
        "body": "Persónuvernd þín er okkur mikilvæg. Vinsamlegast skoðið persónuverndarstefnu okkar til að skilja hvernig við söfnum, notum og verndum upplýsingar þínar."
      },
      "liability": {
        "title": "5. Takmörkun ábyrgðar",
        "body": "LegacyGuard Heritage Vault ber ekki ábyrgð á neinum óbeinum, tilfallandi, sérstökum, afleiddum eða refsilegum skaða sem hlýst af notkun þinni á þjónustunni."
      }
    },
    "disclaimer": "[Þetta er staðgengill. Vinsamlegast ráðfærðu þig við lögfræðing til að búa til ítarlega þjónustuskilmála.]"
  },
  "refund": {
    "title": "Endurgreiðslustefna",
    "effectiveDate": "Gildistökudagur: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Yfirlit",
        "body": "Ánægja viðskiptavina er okkar forgangsverkefni. Þessi endurgreiðslustefna lýsir viðmiðum og ferli við að óska eftir endurgreiðslu."
      },
      "eligibility": {
        "title": "2. Réttur til endurgreiðslu",
        "body": "Þú gætir átt rétt á endurgreiðslu innan 30 daga frá upphaflegum kaupum ef þú hefur ekki notað aukagjaldseiginleikana mikið. Endurgreiðslur eru veittar að okkar mati."
      },
      "process": {
        "title": "3. Endurgreiðsluferli",
        "body": "Til að hefja endurgreiðslubeiðni, vinsamlegast hafið samband við þjónustuver okkar á support@legacyguard.com innan 30 daga frá kaupum. Látið fylgja með netfangið ykkar og ástæðu fyrir endurgreiðslubeiðninni."
      },
      "nonRefundable": {
        "title": "4. Þjónusta sem fæst ekki endurgreitt",
        "intro": "Eftirfarandi þjónusta er ekki endurgreidd:",
        "items": {
          "item1": "Mánaðaráskriftir eftir fyrstu 30 dagana",
          "item2": "Einskiptisgjöld fyrir skjalavinnslu",
          "item3": "Löggilt staðfesting og lögfræðiráðgjöf"
        }
      },
      "processingTime": {
        "title": "5. Vinnslutími",
        "body": "Samþykktar endurgreiðslur verða afgreiddar innan 5-10 virkra daga og færðar inn á upprunalega greiðslumáta þinn."
      }
    },
    "disclaimer": "[Þetta er staðgengill. Vinsamlegast ráðfærðu þig við lögfræðing til að búa til ítarlega endurgreiðslustefnu.]"
  }
}
