{
  "general": {
    "something_wrong": "Något fungerade inte riktigt som det skulle, men oroa dig inte – din viktiga information är säker.",
    "try_again": "Låt mig försöka igen för dig",
    "contact_support": "Jag finns här för att hjälpa dig om du behöver support",
    "no_data_lost": "Den goda nyheten är att inget av det du har arbetat med har gått förlorat",
    "temporary_issue": "Det verkar vara ett tillfälligt problem som bör lösas snabbt"
  },
  "network": {
    "connection_lost": "Det verkar som om din internetanslutning avbröts. Ditt arbete är sparat och vi kommer att återansluta automatiskt.",
    "slow_connection": "Din anslutning verkar vara lite långsam idag. Jag väntar tålmodigt medan allt laddas.",
    "server_busy": "Våra servrar är lite upptagna just nu, men jag fortsätter försöka hjälpa dig.",
    "timeout": "Det tog längre tid än väntat. Låt mig prova en annan metod."
  },
  "validation": {
    "required_field": "Din familj kommer att behöva denna information – kan du hjälpa mig att fylla i den?",
    "invalid_email": "Den e-postadressen ser inte riktigt rätt ut. Kan du dubbelkolla den?",
    "invalid_phone": "Jag har problem med det telefonnummerformatet. Kan du ange det på ett annat sätt?",
    "invalid_date": "Det datumformatet fungerar inte för mig. Kan du prova MM/DD/ÅÅÅÅ?",
    "password_weak": "Låt oss göra ditt lösenord lite starkare för att hålla din familjs information extra säker.",
    "file_too_large": "Den filen är lite för stor för mig att hantera. Kan du prova en mindre version?",
    "unsupported_file": "Jag kan inte arbeta med den typen av fil. Kan du prova en PDF eller en bild istället?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Jag kunde inte spara den tillgångsinformationen just nu, men jag fortsätter försöka. Din familjs information är viktig för mig.",
      "load_failed": "Jag har problem med att ladda dina tillgångar just nu. Låt mig försöka igen om en stund.",
      "delete_failed": "Jag kunde inte ta bort det objektet just nu. Vill du att jag ska försöka igen?"
    },
    "documents": {
      "upload_failed": "Det dokumentet laddades inte upp korrekt. Oroa dig inte – jag hjälper dig att försöka igen.",
      "processing_failed": "Jag hade problem med att bearbeta det dokumentet. Filen är säker och jag försöker igen.",
      "access_failed": "Jag kan inte komma åt det dokumentet just nu. Låt mig se vad jag kan göra för att hjälpa."
    },
    "family": {
      "save_failed": "Jag kunde inte spara informationen om den personen just nu. Låt mig försöka igen – din krets av förtroende är viktig.",
      "invite_failed": "Jag kunde inte skicka den inbjudan just nu. Jag hjälper dig att försöka igen när du är redo.",
      "access_failed": "Jag har problem med inställningarna för familjeåtkomst. Låt mig arbeta med detta åt dig."
    },
    "will": {
      "generation_failed": "Jag kunde inte skapa ditt testamente just nu. Oroa dig inte – alla dina beslut är sparade och jag försöker igen.",
      "save_failed": "Jag kunde inte spara de ändringarna i testamentet just nu. Din tidigare version är säker och jag fortsätter försöka.",
      "legal_check_failed": "Jag kunde inte verifiera de juridiska kraven just nu. Låt mig försöka igen eller så kan vi få hjälp från vårt juridiska team."
    }
  },
  "emotional_support": {
    "frustration": "Jag vet att det är frustrerande när du försöker göra något viktigt för din familj. Jag är här för att hjälpa dig att få det att fungera.",
    "time_pressure": "Jag förstår att du inte har mycket tid för tekniska problem. Låt mig lösa detta snabbt åt dig.",
    "overwhelm": "Tekniska problem kan kännas överväldigande när du redan hanterar viktig familjeplanering. Ta ett djupt andetag – jag tar hand om det här.",
    "discouragement": "Låt inte det här tekniska problemet göra dig nedslagen. Det du gör för din familj är för viktigt för att ge upp."
  },
  "solutions": {
    "refresh_page": "Ibland hjälper det att uppdatera sidan. Ditt arbete är sparat, så du kommer inte att förlora något.",
    "try_different_browser": "Om det här fortsätter, prova att använda en annan webbläsare. Chrome eller Firefox fungerar oftast bäst.",
    "check_internet": "Kan du kontrollera din internetanslutning? Ibland är det allt som behövs.",
    "contact_support": "Jag skulle gärna vilja hjälpa dig personligen. Du kan kontakta vårt supportteam som kommer att ta väl hand om dig.",
    "try_later": "Om du har bråttom kan du försöka igen senare. Allt du har gjort är säkert sparat.",
    "alternative_approach": "Låt mig föreslå ett annat sätt att göra detta som kanske fungerar bättre."
  },
  "recovery": {
    "auto_save_worked": "Den goda nyheten är att allt du har angett sparades automatiskt.",
    "backup_available": "Jag har en säkerhetskopia av ditt arbete från för några minuter sedan om du behöver det.",
    "progress_preserved": "All din framsteg är bevarad – du behöver inte börja om.",
    "data_secure": "Din familjs information förblir helt säker trots det här tekniska problemet."
  }
}

