{
  "general": {
    "networkError": "Problema de conexão de rede. Verifique sua conexão de internet.",
    "serverError": "Estamos com problemas técnicos. Tente novamente em breve.",
    "timeoutError": "Solicitação expirada. Tente novamente.",
    "maintenanceMode": "Estamos realizando manutenção. Tente novamente em alguns minutos.",
    "something_wrong": "Algo não funcionou direito, mas não se preocupe: suas informações importantes estão seguras.",
    "try_again": "Deixe-me tentar isso de novo para você",
    "contact_support": "Estou aqui para ajudar se precisar de assistência",
    "no_data_lost": "A boa notícia é que nada em que você trabalhou foi perdido",
    "temporary_issue": "Este parece ser um problema temporário que deve ser resolvido rapidamente"
  },
  "authentication": {
    "sessionExpired": "Sua sessão expirou. Por favor, faça login novamente.",
    "invalidCredentials": "E-mail ou senha inválidos. Tente novamente.",
    "accountLocked": "Sua conta foi temporariamente bloqueada por motivos de segurança.",
    "accountDisabled": "Sua conta foi desativada. Entre em contato com o suporte.",
    "emailNotVerified": "Por favor, verifique seu endereço de e-mail antes de continuar.",
    "passwordResetRequired": "É necessário redefinir a senha. Verifique seu e-mail."
  },
  "authorization": {
    "accessDenied": "Você não tem permissão para acessar essas informações.",
    "insufficientPermissions": "Você não tem permissões suficientes para esta ação.",
    "subscriptionRequired": "Este recurso requer uma assinatura ativa.",
    "upgradeRequired": "Atualize seu plano para acessar este recurso."
  },
  "validation": {
    "invalidEmail": "Insira um endereço de e-mail válido.",
    "invalidPhone": "Por favor, insira um número de telefone válido.",
    "invalidFormat": "Formato inválido. Verifique sua entrada.",
    "passwordTooWeak": "A senha deve ter pelo menos 8 caracteres, com letras maiúsculas, minúsculas e números.",
    "passwordMismatch": "As senhas não coincidem.",
    "fileTooLarge": "O tamanho do arquivo excede o limite máximo de {{size}}MB.",
    "unsupportedFileType": "Este tipo de arquivo não é suportado.",
    "required_field": "Sua família precisará dessas informações. Você poderia me ajudar a preenchê-las?",
    "invalid_email": "Esse endereço de e-mail não parece estar correto. Você poderia verificar para mim?",
    "invalid_phone": "Estou com problemas com o formato desse número de telefone. Você poderia tentar digitá-lo de outra forma?",
    "invalid_date": "Esse formato de data não está funcionando para mim. Você poderia tentar MM/DD/AAAA?",
    "password_weak": "Vamos tornar sua senha um pouco mais forte para manter as informações de sua família mais seguras.",
    "file_too_large": "Esse arquivo é um pouco grande demais para mim. Você poderia tentar uma versão menor?",
    "unsupported_file": "Não consigo trabalhar com esse tipo de arquivo. Você poderia tentar usar um PDF ou uma imagem?",
    "errors": {
      "assetNameRequired": "Erros ativo Nome Obrigatório",
      "assetTypeRequired": "Erros Tipo de ativo Obrigatório",
      "nameMinLength": "Erros nome Comprimento mínimo",
      "allocationRequired": "Alocação de erros necessária",
      "allocationMustBeNumber": "A alocação de erros deve ser numérica",
      "allocationRange": "Intervalo de alocação de erros",
      "requiredField": "Erros Campo obrigatório",
      "mustBeNumber": "Erros devem ser números",
      "countryRequired": "Erros país Obrigatório",
      "countryCodeLength": "Erros Código de país Comprimento",
      "valueMustBeNumber": "O valor dos erros deve ser um número",
      "valueMustBePositive": "O valor dos erros deve ser positivo",
      "currencyCodeLength": "Erros moeda Código Comprimento",
      "beneficiaryNameRequired": "Erros Nome do beneficiário Obrigatório",
      "invalidEmail": "Erros de e-mail inválido",
      "invalidPhone": "Erros de telefone inválido",
      "documentNameRequired": "Documento de erros Nome Obrigatório",
      "documentTypeRequired": "Tipo de documento de erros Obrigatório",
      "expirationDateFuture": "Erros Data de expiração Futuro",
      "relationshipRequired": "Relacionamento de erros obrigatório",
      "unknownError": "Erros desconhecidos Erro",
      "dataNotFound": "Dados de erros não encontrados",
      "connectionError": "Erros de conexão Erro",
      "permissionDenied": "Permissão de erros negada",
      "duplicateRecord": "Erros de registro duplicado"
    },
    "nameRequired": "Nome de validação obrigatório",
    "nameMinLength": "Nome de validação Comprimento mínimo",
    "jurisdictionRequired": "Jurisdição de validação necessária",
    "dobRequired": "Validação de data de nascimento necessária",
    "addressRequired": "Endereço de validação obrigatório",
    "allocationError": "Erro de alocação de validação",
    "beneficiaryRequired": "Validação do beneficiário necessária",
    "executorRequired": "Executor de validação necessário"
  },
  "data": {
    "loadingFailed": "Falha ao carregar os dados. Atualize a página.",
    "savingFailed": "Falha ao salvar as alterações. Tente novamente.",
    "deletingFailed": "Falha ao excluir o item. Tente novamente.",
    "uploadFailed": "Falha no upload do arquivo. Tente novamente.",
    "exportFailed": "Falha na exportação de dados. Tente novamente mais tarde.",
    "importFailed": "Falha na importação de dados. Verifique o formato do arquivo.",
    "syncFailed": "Falha na sincronização. Algumas alterações podem não ser salvas."
  },
  "payment": {
    "paymentFailed": "O processamento do pagamento falhou. Verifique seu método de pagamento.",
    "cardDeclined": "Seu cartão foi recusado. Tente outro método de pagamento.",
    "insufficientFunds": "Fundos insuficientes. Verifique o saldo da sua conta.",
    "expiredCard": "Seu cartão expirou. Atualize suas informações de pagamento.",
    "invalidCard": "Informações do cartão inválidas. Verifique seus dados.",
    "paymentTimeout": "O processamento do pagamento expirou. Tente novamente."
  },
  "actions": {
    "tryAgain": "Tentar novamente",
    "signInAgain": "Entrar novamente",
    "updatePayment": "Atualizar pagamento",
    "upgradeAccount": "Atualizar conta"
  },
  "debug": {
    "i18nDebug": {
      "current_lang_resources_7": "Recursos de idioma atuais 7",
      "has_resources_6": "Possui recursos 6",
      "i18n_debug_info_1": "Informações de depuração I18n 1",
      "resolved_language_3": "Linguagem resolvida 3",
      "test_translation_5": "Teste de tradução 5"
    }
  },
  "test": {
    "environment": {
      "description": "Descrição",
      "title": "Título"
    }
  },
  "notfound": {
    "title": "Página não encontrada",
    "description": "A página que você está procurando não existe ou foi movida.",
    "goHome": "Ir para casa",
    "goBack": "Volte"
  },
  "network": {
    "connection_lost": "Parece que sua conexão com a internet foi interrompida. Seu trabalho foi salvo e reconectaremos automaticamente.",
    "slow_connection": "Sua conexão parece um pouco lenta hoje. Vou esperar pacientemente enquanto a conexão carrega.",
    "server_busy": "Nossos servidores estão um pouco ocupados no momento, mas continuarei tentando ajudar você.",
    "timeout": "Demorou mais do que o esperado. Deixe-me tentar uma abordagem diferente."
  },
  "contextual": {
    "assets": {
      "save_failed": "Não consegui salvar as informações do seu patrimônio agora, mas vou continuar tentando. As informações da sua família são importantes para mim.",
      "load_failed": "Estou com problemas para carregar seus ativos. Tentarei novamente em instantes.",
      "delete_failed": "Não consegui remover esse item agora. Gostaria que eu tentasse novamente?"
    },
    "documents": {
      "upload_failed": "O documento não foi carregado corretamente. Não se preocupe, vou ajudar você a tentar novamente.",
      "processing_failed": "Tive problemas para processar o documento. O arquivo está seguro e tentarei novamente.",
      "access_failed": "Não consigo acessar esse documento agora. Deixe-me ver o que posso fazer para ajudar."
    },
    "family": {
      "save_failed": "Não consegui salvar as informações dessa pessoa agora. Deixe-me tentar novamente — seu círculo de confiança é importante.",
      "invite_failed": "Não consegui enviar o convite agora. Vou ajudar você a tentar novamente quando estiver pronto.",
      "access_failed": "Estou com problemas com as configurações de acesso familiar. Deixe-me resolver isso para você."
    },
    "will": {
      "generation_failed": "Não consegui criar seu testamento agora. Não se preocupe, todas as suas decisões estão salvas e tentarei novamente.",
      "save_failed": "Não consegui salvar essas alterações agora. Sua versão anterior está segura e continuarei tentando.",
      "legal_check_failed": "Não consegui verificar os requisitos legais agora. Vou tentar novamente ou podemos obter ajuda da nossa equipe jurídica."
    }
  },
  "emotional_support": {
    "frustration": "Sei que é frustrante quando você está tentando fazer algo importante para sua família. Estou aqui para ajudar a fazer isso funcionar.",
    "time_pressure": "Entendo que você não tem muito tempo para problemas técnicos. Deixe-me resolver isso rapidamente para você.",
    "overwhelm": "Problemas técnicos podem ser avassaladores quando você já está lidando com planejamento familiar importante. Respire fundo - eu cuido disso.",
    "discouragement": "Não deixe que esse problema técnico o desanime. O que você está fazendo pela sua família é importante demais para abrir mão."
  },
  "solutions": {
    "refresh_page": "Às vezes, atualizar a página ajuda. Seu trabalho é salvo, então você não perderá nada.",
    "try_different_browser": "Se isso continuar acontecendo, tente usar outro navegador. Chrome ou Firefox geralmente funcionam melhor.",
    "check_internet": "Você poderia verificar sua conexão com a internet? Às vezes, é só isso.",
    "contact_support": "Adoraria ajudar você pessoalmente. Entre em contato com nossa equipe de suporte, que cuidará muito bem de você.",
    "try_later": "Se estiver com pressa, você pode tentar novamente mais tarde. Tudo o que você fez está salvo com segurança.",
    "alternative_approach": "Deixe-me sugerir uma maneira diferente de fazer isso que pode funcionar melhor."
  },
  "recovery": {
    "auto_save_worked": "A boa notícia é que tudo o que você digitou foi salvo automaticamente.",
    "backup_available": "Tenho um backup do seu trabalho de alguns minutos atrás, caso precise.",
    "progress_preserved": "Todo o seu progresso será preservado — você não precisará começar de novo.",
    "data_secure": "As informações da sua família permanecem completamente seguras, apesar deste problema técnico."
  },
  "errors": {
    "notAuthenticated": "Erros não autenticados",
    "generic": "Erros genéricos",
    "savingSettings": "Erros ao salvar configurações",
    "loadingSettings": "Erros ao carregar as configurações",
    "networkError": "Erros de rede Erro",
    "permissionDenied": "Permissão de erros negada",
    "dataNotFound": "Dados de erros não encontrados",
    "unknown": "Erros desconhecidos",
    "uploadFailed": "Erros de upload falharam",
    "accessDenied": "Erros de acesso negado",
    "reassurance": {
      "data_safe": "Dados de garantia seguros",
      "try_again": "Tranquilidade, tente novamente"
    },
    "loadingAssets": "Erros ao carregar ativos",
    "failedToFetchStatus": "Erros falharam ao buscar status",
    "validationFailed": "Falha na validação de erros",
    "generationFailed": "Falha na geração de erros",
    "duplicateRecord": "Erros de registro duplicado"
  },
  "generic": {
    "title": "[TRANSLATE] Something went wrong",
    "message": "[TRANSLATE] We ran into an unexpected error. Your data is safe."
  }
}