{
  "general": {
    "something_wrong": "Нешто не функционираше како што треба, но не грижете се – вашите важни информации се безбедни.",
    "try_again": "Дозволете ми да пробам повторно за вас",
    "contact_support": "Тука сум да ви помогнам ако ви треба помош",
    "no_data_lost": "Добрата вест е дека ништо од она што сте работеле не е изгубено",
    "temporary_issue": "Изгледа дека ова е привремен проблем што треба брзо да се реши"
  },
  "network": {
    "connection_lost": "Изгледа дека вашата интернет врска е прекината. Вашата работа е зачувана и автоматски ќе се поврземе повторно.",
    "slow_connection": "Вашата врска денес изгледа малку бавна. Ќе почекам трпеливо додека сè се вчита.",
    "server_busy": "Нашите сервери моментално се малку зафатени, но ќе продолжам да се обидувам да ви помогнам.",
    "timeout": "Ова траеше подолго од очекуваното. Дозволете ми да пробам поинаков пристап."
  },
  "validation": {
    "required_field": "Вашето семејство ќе има потреба од оваа информација – можете ли да ми помогнете да ја внесеме?",
    "invalid_email": "Оваа е-пошта не изгледа исправно. Можете ли да ја проверите повторно?",
    "invalid_phone": "Имам проблем со форматот на овој телефонски број. Можете ли да го внесете на поинаков начин?",
    "invalid_date": "Овој формат на датум не ми одговара. Можете ли да пробате ММ/ДД/ГГГГ?",
    "password_weak": "Да ја направиме вашата лозинка малку посилна за дополнителна безбедност на информациите за вашето семејство.",
    "file_too_large": "Оваа датотека е премногу голема за да ја обработам. Можете ли да пробате помала верзија?",
    "unsupported_file": "Не можам да работам со оваа врста на датотека. Можете ли да пробате PDF или слика?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Моментално не можев да ги зачувам информациите за оваа имотна ставка, но ќе продолжам да се обидувам. Информациите за вашето семејство ми се важни.",
      "load_failed": "Имам проблем со вчитувањето на вашите имотни податоци. Дозволете ми да пробам повторно за момент.",
      "delete_failed": "Не можев да ја избришам оваа ставка сега. Дали сакате да пробам повторно?"
    },
    "documents": {
      "upload_failed": "Овој документ не беше правилно прикачен. Не грижете се – ќе ви помогнам да пробате повторно.",
      "processing_failed": "Имав проблем при обработка на овој документ. Датотеката е безбедна и ќе пробам повторно.",
      "access_failed": "Моментално не можам да пристапам на овој документ. Дозволете ми да ви помогнам."
    },
    "family": {
      "save_failed": "Не можев да ги зачувам податоците за ова лице сега. Ајде да пробаме повторно – вашиот круг на доверба е важен.",
      "invite_failed": "Не можев да ја испратам поканата сега. Ќе ви помогнам да пробате повторно кога ќе бидете подготвени.",
      "access_failed": "Имам проблем со поставките за пристап до семејството. Дозволете ми да го средам ова за вас."
    },
    "will": {
      "generation_failed": "Не можев да го креирам вашиот тестамент сега. Не грижете се – сите ваши одлуки се зачувани и ќе пробам повторно.",
      "save_failed": "Не можев да ги зачувам измените на тестаментот сега. Претходната верзија е безбедна и ќе продолжам да се обидувам.",
      "legal_check_failed": "Не можев да ги проверам законските барања сега. Дозволете ми да пробам повторно или да побараме помош од нашиот правен тим."
    }
  },
  "emotional_support": {
    "frustration": "Знам дека е фрустрирачки кога се обидувате да направите нешто важно за вашето семејство. Тука сум за да ви помогнам да успеете.",
    "time_pressure": "Разбирам дека немате многу време за технички проблеми. Дозволете ми брзо да го решам ова за вас.",
    "overwhelm": "Техничките проблеми можат да бидат обесхрабрувачки кога веќе се занимавате со важно семејно планирање. Земете здив – јас ќе го преземам ова.",
    "discouragement": "Не дозволувајте овој технички проблем да ве обесхрабри. Она што го правите за вашето семејство е премногу важно за да се откажете."
  },
  "solutions": {
    "refresh_page": "Понекогаш помага да ја освежите страницата. Вашата работа е зачувана, така што ништо нема да изгубите.",
    "try_different_browser": "Ако ова продолжи да се случува, пробајте да користите друг прелистувач. Chrome или Firefox обично работат најдобро.",
    "check_internet": "Можете ли да ја проверите вашата интернет врска? Понекогаш тоа е сè што треба.",
    "contact_support": "Со задоволство ќе ви помогнам лично. Можете да го контактирате нашиот тим за поддршка кој добро ќе се погрижи за вас.",
    "try_later": "Ако брзате, можете да пробате повторно подоцна. Сè што сте направиле е безбедно зачувано.",
    "alternative_approach": "Дозволете ми да предложам поинаков начин да го направиме ова кој можеби ќе функционира подобро."
  },
  "recovery": {
    "auto_save_worked": "Добрата вест е дека сè што внесовте е автоматски зачувано.",
    "backup_available": "Имам резервна копија од вашата работа од пред неколку минути ако ви треба.",
    "progress_preserved": "Вашиот напредок е целосно зачуван – нема да треба да почнете одново.",
    "data_secure": "Информациите за вашето семејство остануваат целосно безбедни и покрај овој технички проблем."
  }
}
