{
  "tos": {
    "title": "Kushtet e Shërbimit",
    "effectiveDate": "Data e hyrjes në fuqi: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Pranimi i Kushteve",
        "body": "Duke hyrë ose duke përdorur LegacyGuard Heritage Vault, ju pranoni të jeni të lidhur nga këto Kushte Shërbimi."
      },
      "service": {
        "title": "2. Përshkrimi i Shërbimit",
        "body": "LegacyGuard Heritage Vault ofron shërbime të menaxhimit të trashëgimisë dixhitale, duke përfshirë ruajtjen e dokumenteve, gjenerimin e testamenteve dhe ndarjen e sigurt të informacionit të rëndësishëm me përfituesit e caktuar."
      },
      "responsibilities": {
        "title": "3. Përgjegjësitë e Përdoruesit",
        "body": "Ju jeni përgjegjës për ruajtjen e konfidencialitetit të kredencialeve të llogarisë suaj dhe për të gjitha aktivitetet që ndodhin në llogarinë tuaj."
      },
      "privacy": {
        "title": "4. Privatësia dhe Mbrojtja e të Dhënave",
        "body": "Privatësia juaj është e rëndësishme për ne. Ju lutemi rishikoni Politikën tonë të Privatësisë për të kuptuar se si i mbledhim, përdorim dhe mbrojmë informacionet tuaja."
      },
      "liability": {
        "title": "5. Kufizimi i Përgjegjësisë",
        "body": "LegacyGuard Heritage Vault nuk do të jetë përgjegjëse për asnjë dëmtim indirekt, të rastësishëm, të veçantë, pasues ose ndëshkues që rezulton nga përdorimi juaj i shërbimit."
      }
    },
    "disclaimer": "[Ky është një vendzgjatës. Ju lutemi konsultohuni me një këshilltar ligjor për të krijuar Kushte Shërbimi gjithëpërfshirëse.]"
  },
  "refund": {
    "title": "Politika e Rimbursimit",
    "effectiveDate": "Data e hyrjes në fuqi: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Përmbledhje",
        "body": "Kënaqësia e klientit është përparësia jonë. Kjo Politikë Rimbursimi përshkruan kriteret dhe procesin për të kërkuar një rimbursim."
      },
      "eligibility": {
        "title": "2. E drejta për rimbursime",
        "body": "Ju mund të keni të drejtë për rimbursim brenda 30 ditëve nga blerja juaj fillestare nëse nuk i keni përdorur gjerësisht veçoritë premium. Rimbursimet ofrohen sipas gjykimit tonë."
      },
      "process": {
        "title": "3. Procesi i rimbursimit",
        "body": "Për të filluar një kërkesë për rimbursim, ju lutemi kontaktoni ekipin tonë të mbështetjes në support@legacyguard.com brenda 30 ditëve nga blerja. Përfshini email-in e llogarisë suaj dhe arsyen e kërkesës për rimbursim."
      },
      "nonRefundable": {
        "title": "4. Shërbime të pakthyeshme",
        "intro": "Shërbimet e mëposhtme nuk rimbursohen:",
        "items": {
          "item1": "Abonimet mujore pas 30 ditëve të para",
          "item2": "Tarifat e përpunimit të dokumenteve një herëshe",
          "item3": "Shërbime noterizimi dhe konsulence ligjore"
        }
      },
      "processingTime": {
        "title": "5. Koha e përpunimit",
        "body": "Rimbursimet e miratuara do të përpunohen brenda 5-10 ditëve pune dhe do të kreditohen në metodën tuaj origjinale të pagesës."
      }
    },
    "disclaimer": "[Ky është një vendzgjatës. Ju lutemi konsultohuni me një këshilltar ligjor për të krijuar një Politikë gjithëpërfshirëse të Rimbursimit.]"
  }
}
