{
  "general": {
    "loading": "Vetëm një moment, ndërsa unë përgatis gjithçka për ju...",
    "processing": "Po punoj për këtë për ty...",
    "saving": "Duke e mbajtur këtë të sigurt për familjen tuaj...",
    "uploading": "Duke e ruajtur në mënyrë të sigurt këtë informacion të rëndësishëm...",
    "analyzing": "Duke e rishikuar këtë për të ndihmuar familjen tuaj...",
    "generating": "Duke e krijuar këtë posaçërisht për familjen tuaj...",
    "connecting": "Duke u lidhur në mënyrë të sigurt për të mbrojtur informacionin tuaj...",
    "syncing": "Duke u siguruar që gjithçka është e azhurnuar për ju...",
    "initializing": "Duke bërë gjithçka gati për ju...",
    "updating": "Duke përditësuar këtë informacion për familjen tuaj..."
  },
  "contextual": {
    "assets": {
      "saving": "Duke shtuar këtë informacion të rëndësishëm në kasafortën e familjes suaj...",
      "loading": "Mbledhja e informacionit të rëndësishëm të familjes suaj...",
      "calculating": "Të kuptosh se çfarë do të thotë kjo për familjen tënde...",
      "updating": "Duke përditësuar pasuritë dhe sendet e familjes suaj...",
      "organizing": "Organizimi i gjithçkaje në mënyrë që familja juaj ta gjejë lehtësisht..."
    },
    "documents": {
      "uploading": "Duke e ruajtur këtë dokument në mënyrë të sigurt për familjen tuaj...",
      "processing": "Duke e organizuar këtë në mënyrë që familja juaj ta gjejë lehtë...",
      "analyzing": "Duke shqyrtuar këtë dokument për të ndihmuar familjen tuaj...",
      "scanning": "Duke lexuar këtë dokument të rëndësishëm...",
      "encrypting": "Duke e mbrojtur këtë dokument me siguri shtesë..."
    },
    "will": {
      "generating": "Duke krijuar me kujdes testamentin tuaj bazuar në dëshirat tuaja...",
      "saving": "Ruajtja e vendimeve të rëndësishme për familjen tuaj...",
      "reviewing": "Duke u siguruar që gjithçka pasqyron atë që dëshironi...",
      "updating": "Duke përditësuar dëshirat tuaja për familjen tuaj...",
      "finalizing": "Duke i dhënë prekjet e fundit testamentit tënd..."
    },
    "family": {
      "saving": "Duke shtuar këtë person të besuar në ekipin e mbështetjes së familjes suaj...",
      "loading": "Duke mbledhur informacione rreth ndihmësve të familjes suaj...",
      "updating": "Duke përditësuar rrjetin mbështetës të familjes suaj...",
      "connecting": "Ndërtimi i lidhjeve me kujdestarët e familjes suaj...",
      "organizing": "Organizimi i sistemit të mbështetjes së familjes suaj..."
    },
    "guardian": {
      "adding": "Duke shtuar këtë person të veçantë për të ndihmuar familjen tuaj...",
      "updating": "Duke përditësuar informacionin e kujdestarit...",
      "verifying": "Duke u siguruar që ky kujdestar mund të ndihmojë kur është e nevojshme...",
      "connecting": "Vendosja e kësaj marrëdhënieje të rëndësishme..."
    }
  },
  "emotional": {
    "first_time": "Po përgatis gjithçka në mënyrë perfekte për vizitën tënde të parë...",
    "returning": "Mirë se erdhe përsëri! Po përgatis informacionin tënd...",
    "complex_task": "Kjo është një punë e rëndësishme - po kujdesem për të gjitha detajet...",
    "sensitive_area": "E kuptoj që kjo është personale - trajtimi me kujdes të shtuar...",
    "almost_done": "Pothuajse mbarova - thjesht po sigurohem që gjithçka është perfekte...",
    "taking_time": "Gjërat e mira duan kohë - Po tregohem i kujdesshëm për familjen tënde..."
  },
  "transitions": {
    "dashboard_to_assets": "Le të shohim gjërat e rëndësishme të familjes suaj...",
    "assets_to_family": "Tani le të mendojmë për njerëzit që mund të ndihmojnë...",
    "family_to_will": "Koha për të dokumentuar dëshirat tuaja për familjen tuaj...",
    "will_to_review": "Le të shqyrtojmë gjithçka së bashku...",
    "section_complete": "Progres i shkëlqyer! Familja juaj është më e përgatitur tani...",
    "saving_complete": "Kjo ruhet në mënyrë të sigurt për familjen tuaj...",
    "starting_complex": "Kjo është një punë e rëndësishme për familjen tuaj - le të marrim kohën tonë...",
    "navigating": "Po të çojmë atje tani..."
  },
  "progress": {
    "starting": "Fillimi me planin e mbrojtjes së familjes suaj...",
    "quarter": "Duke organizuar informacionin tuaj...",
    "half": "Duke ndërtuar planin e mbrojtjes së familjes suaj...",
    "three_quarters": "Duke përfunduar gjithçka për familjen tuaj...",
    "complete": "Plani juaj i mbrojtjes familjare është gati!",
    "step_complete": "Një hap tjetër i përfunduar për të ardhmen e familjes suaj..."
  },
  "microInteractions": {
    "buttons": {
      "save": "Mbajeni këtë të sigurt për familjen tuaj",
      "delete": "Hiqeni këtë me kujdes",
      "share": "Njoftoni familjen tuaj për këtë",
      "edit": "Përditëso këtë informacion",
      "add": "Shto në planin e familjes sate",
      "continue": "Vazhdo të ndërtosh planin tënd",
      "back": "Le të kthehemi",
      "next": "Ecni përpara së bashku"
    },
    "validation": {
      "required": "Familja juaj ka nevojë për këtë informacion",
      "invalid_format": "Më lejoni t'ju ndihmoj me formatin e duhur",
      "too_short": "A mund të shtoni pak më shumë detaje për familjen tuaj?",
      "too_long": "Le ta mbajmë këtë konciz për qartësi",
      "success": "Perfekt! Kjo duket shkëlqyeshëm",
      "checking": "Më lejoni ta verifikoj këtë për ju..."
    }
  },
  "errors": {
    "recovery": {
      "general": "Diçka nuk funksionoi si duhet, por informacioni juaj është i sigurt...",
      "retry": "Më lejoni ta provoj përsëri për ju...",
      "save_failed": "Mos u shqetëso - do të sigurohem që kjo të ruhet siç duhet...",
      "network": "Keni probleme me lidhjen - por mos u shqetësoni, asgjë nuk është e humbur...",
      "timeout": "Kjo po zgjat më shumë se sa pritej - më lejoni të ndihmoj..."
    },
    "reassurance": {
      "data_safe": "Informacioni juaj është plotësisht i sigurt",
      "no_loss": "Asgjë nuk është humbur",
      "we_can_help": "Mund ta rregullojmë këtë së bashku",
      "try_again": "Le ta provojmë përsëri kur të jesh gati"
    }
  },
  "encouragement": {
    "overwhelmed": {
      "take_time": "Nuk ka nxitim - merr gjithë kohën që të nevojitet",
      "here_to_help": "Jam këtu për të ndihmuar në çdo hap të rrugës",
      "one_step": "Vetëm një hap i vogël në të njëjtën kohë",
      "doing_great": "Po bën diçka të mrekullueshme për familjen tënde"
    },
    "confident": {
      "great_progress": "Po bën përparim të shkëlqyer!",
      "almost_there": "Pothuajse mbaroi - po ia del mbanë shumë mirë!",
      "well_done": "Bravo për plotësimin e kësaj pjese!",
      "family_protected": "Familja juaj është më e mbrojtur tani"
    }
  }
}
