{
  "tos": {
    "title": "Palveluehdot",
    "effectiveDate": "Voimaantulopäivä: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Ehtojen hyväksyminen",
        "body": "Käyttämällä LegacyGuard Heritage Vaultia sitoudut noudattamaan näitä käyttöehtoja."
      },
      "service": {
        "title": "2. Palvelun kuvaus",
        "body": "LegacyGuard Heritage Vault tarjoaa digitaalisia perintöhallintapalveluita, kuten asiakirjojen tallennusta, testamenttien laatimista ja tärkeiden tietojen turvallista jakamista nimettyjen edunsaajien kanssa."
      },
      "responsibilities": {
        "title": "3. Käyttäjän vastuut",
        "body": "Olet vastuussa tilisi tunnistetietojen luottamuksellisuuden säilyttämisestä ja kaikista tililläsi tapahtuvista toimista."
      },
      "privacy": {
        "title": "4. Tietosuoja ja tietosuoja",
        "body": "Tietosuojasi on meille tärkeää. Tutustu tietosuojakäytäntöömme ymmärtääksesi, miten keräämme, käytämme ja suojaamme tietojasi."
      },
      "liability": {
        "title": "5. Vastuunrajoitus",
        "body": "LegacyGuard Heritage Vault ei ole vastuussa mistään epäsuorista, satunnaisista, erityisistä, välillisistä tai rankaisevista vahingoista, jotka johtuvat palvelun käytöstäsi."
      }
    },
    "disclaimer": "[Tämä on välilehti. Ota yhteyttä lakimieheen luodaksesi kattavat käyttöehdot.]"
  },
  "refund": {
    "title": "Hyvityskäytäntö",
    "effectiveDate": "Voimaantulopäivä: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Yleiskatsaus",
        "body": "Asiakastyytyväisyys on meille ensisijaisen tärkeää. Tässä hyvityskäytännössä esitetään hyvityksen pyytämisen kriteerit ja prosessi."
      },
      "eligibility": {
        "title": "2. Hyvitysoikeus",
        "body": "Sinulla voi olla oikeus hyvitykseen 30 päivän kuluessa alkuperäisestä ostoksestasi, jos et ole käyttänyt premium-ominaisuuksia laajasti. Hyvitykset myönnetään harkintamme mukaan."
      },
      "process": {
        "title": "3. Hyvitysprosessi",
        "body": "Jos haluat tehdä hyvityspyynnön, ota yhteyttä tukitiimiimme osoitteessa support@legacyguard.com 30 päivän kuluessa ostoksesta. Liitä mukaan tilisi sähköpostiosoite ja hyvityspyynnön syy."
      },
      "nonRefundable": {
        "title": "4. Peruuttamattomat palvelut",
        "intro": "Seuraavista palveluista ei makseta hyvitystä:",
        "items": {
          "item1": "Kuukausitilaukset ensimmäisten 30 päivän jälkeen",
          "item2": "Kertaluonteiset asiakirjojen käsittelymaksut",
          "item3": "Notaari- ja lakipalvelut"
        }
      },
      "processingTime": {
        "title": "5. Käsittelyaika",
        "body": "Hyväksytyt hyvitykset käsitellään 5–10 arkipäivän kuluessa ja hyvitetään alkuperäiselle maksutavallesi."
      }
    },
    "disclaimer": "[Tämä on välilehti. Ota yhteyttä lakimieheen luodaksesi kattavan hyvityskäytännön.]"
  }
}
