{
  "disclaimers": {
    "general": "LegacyGuard provides tools and guidance for estate planning but does not provide legal advice. For complex estates or specific legal questions, please consult with a qualified attorney in your jurisdiction.",
    "willGenerator": "The will generator creates documents based on information you provide. While designed to meet legal requirements, we strongly recommend having any generated will reviewed by a qualified attorney before execution.",
    "jurisdiction": "Legal requirements vary by jurisdiction. Ensure your documents comply with the laws in your area.",
    "notLegalAdvice": "This service does not constitute legal advice and should not be relied upon as such.",
    "professionalReview": "For complex estates, business interests, or unique family situations, professional legal review is strongly recommended."
  },
  "terms": {
    "serviceTerms": "Terms of Service",
    "privacyPolicy": "Privacy Policy",
    "dataProcessing": "Data Processing Agreement",
    "userAgreement": "User Agreement",
    "acceptanceRequired": "By using LegacyGuard, you agree to our Terms of Service and Privacy Policy.",
    "lastUpdated": "Last updated: {{date}}",
    "effectiveDate": "Effective date: {{date}}"
  },
  "compliance": {
    "dataProtection": "Your data is protected in compliance with applicable data protection laws including GDPR and CCPA.",
    "encryption": "All sensitive information is encrypted using industry-standard encryption methods.",
    "retention": "Data retention policies are designed to protect your privacy while ensuring your family can access important information when needed.",
    "access": "You have the right to access, modify, or delete your personal information at any time.",
    "portability": "You can export your data in standard formats for use with other services."
  },
  "executionRequirements": {
    "witnessRequirements": "Witness Requirements for {{jurisdiction}}",
    "notaryRequirements": "Notarization Requirements",
    "signingInstructions": "Proper Signing Instructions",
    "storageGuidelines": "Secure Storage Guidelines",
    "legalCompliance": "Legal Compliance Verification"
  }
}