{
  "tos": {
    "title": "Servicebedingungen",
    "effectiveDate": "Gültig ab: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Annahme der Bedingungen",
        "body": "Indem Sie auf LegacyGuard Heritage Vault zugreifen oder es verwenden, erklären Sie sich mit diesen Servicebedingungen einverstanden."
      },
      "service": {
        "title": "2. Leistungsbeschreibung",
        "body": "LegacyGuard Heritage Vault bietet digitale Nachlassverwaltungsdienste, darunter Dokumentenspeicherung, Testamentserstellung und sichere Weitergabe wichtiger Informationen an benannte Begünstigte."
      },
      "responsibilities": {
        "title": "3. Pflichten des Benutzers",
        "body": "Sie sind für die Wahrung der Vertraulichkeit Ihrer Kontoanmeldeinformationen und für alle Aktivitäten verantwortlich, die über Ihr Konto stattfinden."
      },
      "privacy": {
        "title": "4. Privatsphäre und Datenschutz",
        "body": "Ihre Privatsphäre ist uns wichtig. Bitte lesen Sie unsere Datenschutzrichtlinie, um zu erfahren, wie wir Ihre Daten sammeln, verwenden und schützen."
      },
      "liability": {
        "title": "5. Haftungsbeschränkung",
        "body": "LegacyGuard Heritage Vault haftet nicht für indirekte, zufällige, besondere, Folge- oder Strafschäden, die sich aus Ihrer Nutzung des Dienstes ergeben."
      }
    },
    "disclaimer": "[Dies ist ein Platzhalter. Bitte wenden Sie sich an einen Rechtsberater, um umfassende Servicebedingungen zu erstellen.]"
  },
  "refund": {
    "title": "Rückgaberecht",
    "effectiveDate": "Gültig ab: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Übersicht",
        "body": "Kundenzufriedenheit hat für uns oberste Priorität. Diese Rückerstattungsrichtlinie beschreibt die Kriterien und das Verfahren für die Beantragung einer Rückerstattung."
      },
      "eligibility": {
        "title": "2. Anspruch auf Rückerstattung",
        "body": "Sie haben möglicherweise Anspruch auf eine Rückerstattung innerhalb von 30 Tagen nach dem Kauf, wenn Sie die Premium-Funktionen nicht umfassend genutzt haben. Rückerstattungen erfolgen nach unserem Ermessen."
      },
      "process": {
        "title": "3. Rückerstattungsprozess",
        "body": "Um eine Rückerstattung zu beantragen, wenden Sie sich bitte innerhalb von 30 Tagen nach dem Kauf an unser Support-Team unter support@legacyguard.com. Geben Sie Ihre Konto-E-Mail-Adresse und den Grund für die Rückerstattungsanfrage an."
      },
      "nonRefundable": {
        "title": "4. Nicht erstattungsfähige Leistungen",
        "intro": "Die folgenden Leistungen sind nicht erstattungsfähig:",
        "items": {
          "item1": "Monatliche Abonnements nach den ersten 30 Tagen",
          "item2": "Einmalige Gebühren für die Dokumentenverarbeitung",
          "item3": "Notarielle Beglaubigung und Rechtsberatung"
        }
      },
      "processingTime": {
        "title": "5. Bearbeitungszeit",
        "body": "Genehmigte Rückerstattungen werden innerhalb von 5–10 Werktagen bearbeitet und Ihrer ursprünglichen Zahlungsmethode gutgeschrieben."
      }
    },
    "disclaimer": "[Dies ist ein Platzhalter. Bitte wenden Sie sich an einen Rechtsberater, um eine umfassende Rückerstattungsrichtlinie zu erstellen.]"
  }
}
