{
  "general": {
    "something_wrong": "Что-то пошло не так, но не волнуйтесь – ваша важная информация в безопасности.",
    "try_again": "Позвольте мне попробовать ещё раз для вас",
    "contact_support": "Я здесь, чтобы помочь вам, если потребуется поддержка",
    "no_data_lost": "Хорошая новость — ничего из того, что вы сделали, не потеряно",
    "temporary_issue": "Похоже, это временная проблема, которая должна быстро решиться"
  },
  "network": {
    "connection_lost": "Похоже, ваше интернет-соединение было прервано. Ваша работа сохранена, мы подключимся автоматически.",
    "slow_connection": "Ваше соединение сегодня немного медленное. Я подожду, пока всё загрузится.",
    "server_busy": "Наши серверы сейчас немного загружены, но я продолжу пытаться помочь вам.",
    "timeout": "Это заняло больше времени, чем ожидалось. Позвольте мне попробовать другой способ."
  },
  "validation": {
    "required_field": "Вашей семье понадобятся эти данные — сможете помочь мне их заполнить?",
    "invalid_email": "Этот адрес электронной почты выглядит неправильно. Пожалуйста, проверьте его ещё раз.",
    "invalid_phone": "Проблема с форматом этого номера телефона. Попробуйте ввести его иначе.",
    "invalid_date": "Этот формат даты не подходит. Попробуйте ММ/ДД/ГГГГ.",
    "password_weak": "Давайте сделаем ваш пароль немного надёжнее, чтобы защитить данные вашей семьи.",
    "file_too_large": "Этот файл слишком большой. Попробуйте загрузить меньший.",
    "unsupported_file": "Я не могу работать с таким типом файла. Попробуйте PDF или изображение."
  },
  "contextual": {
    "assets": {
      "save_failed": "Не удалось сохранить данные об этом активе сейчас, но я продолжу попытки. Информация вашей семьи для меня важна.",
      "load_failed": "Проблема с загрузкой ваших активов. Попробую снова через минуту.",
      "delete_failed": "Не удалось удалить этот элемент сейчас. Хотите, чтобы я попробовал ещё раз?"
    },
    "documents": {
      "upload_failed": "Документ не был загружен правильно. Не переживайте — я помогу попробовать снова.",
      "processing_failed": "Возникла проблема при обработке документа. Файл в безопасности, попробую снова.",
      "access_failed": "Не удаётся получить доступ к документу сейчас. Посмотрю, что можно сделать."
    },
    "family": {
      "save_failed": "Не удалось сохранить данные об этом человеке сейчас. Попробую ещё раз — ваш круг доверия важен.",
      "invite_failed": "Не удалось отправить приглашение сейчас. Мы сможем попробовать снова, когда вы будете готовы.",
      "access_failed": "Проблема с настройками доступа для семьи. Я займусь этим для вас."
    },
    "will": {
      "generation_failed": "Не удалось создать ваш завещательный документ сейчас. Не волнуйтесь — все решения сохранены, попробую снова.",
      "save_failed": "Не удалось сохранить изменения в завещании сейчас. Предыдущая версия в безопасности, и я продолжу попытки.",
      "legal_check_failed": "Не удалось проверить юридические требования сейчас. Попробую снова или свяжемся с нашей юридической командой."
    }
  },
  "emotional_support": {
    "frustration": "Понимаю, как это раздражает, когда вы пытаетесь сделать что-то важное для семьи. Я здесь, чтобы помочь.",
    "time_pressure": "Понимаю, что у вас мало времени на технические проблемы. Давайте я решу это быстро.",
    "overwhelm": "Технические проблемы могут казаться непреодолимыми, когда вы уже заняты семейным планированием. Сделайте вдох — я разберусь.",
    "discouragement": "Не позволяйте этой технической проблеме вас остановить. То, что вы делаете для семьи, слишком важно, чтобы сдаваться."
  },
  "solutions": {
    "refresh_page": "Иногда помогает обновление страницы. Ваша работа сохранена, вы ничего не потеряете.",
    "try_different_browser": "Если это повторяется, попробуйте другой браузер. Chrome или Firefox обычно работают лучше всего.",
    "check_internet": "Проверьте интернет-соединение — иногда этого достаточно.",
    "contact_support": "Я с радостью помогу вам лично. Вы можете обратиться в нашу службу поддержки, и о вас позаботятся.",
    "try_later": "Если вы спешите, можете попробовать снова позже. Всё, что вы сделали, сохранено.",
    "alternative_approach": "Позвольте предложить другой способ, который может сработать лучше."
  },
  "recovery": {
    "auto_save_worked": "Хорошая новость — всё, что вы ввели, было автоматически сохранено.",
    "backup_available": "У меня есть резервная копия вашей работы, сделанная несколько минут назад.",
    "progress_preserved": "Весь ваш прогресс сохранён — начинать заново не придётся.",
    "data_secure": "Данные вашей семьи полностью в безопасности, несмотря на эту техническую проблему."
  }
}
