{
  "general": {
    "something_wrong": "Aeth rhywbeth o’i le, ond peidiwch â phoeni – mae eich gwybodaeth bwysig yn ddiogel.",
    "try_again": "Gadewch i mi roi cynnig arall arni i chi",
    "contact_support": "Rwyf yma i helpu os oes arnoch angen cymorth",
    "no_data_lost": "Y newyddion da yw nad yw dim o’ch gwaith wedi’i golli",
    "temporary_issue": "Mae’n ymddangos mai problem dros dro yw hon a ddylai gael ei datrys yn fuan"
  },
  "network": {
    "connection_lost": "Mae’n ymddangos bod eich cysylltiad rhyngrwyd wedi cael ei dorri. Mae eich gwaith wedi’i gadw, a byddwn yn ailgysylltu’n awtomatig.",
    "slow_connection": "Mae’ch cysylltiad ychydig yn araf heddiw. Byddaf yn aros yn amyneddgar tra bydd pethau’n llwytho.",
    "server_busy": "Mae ein gweinyddion ychydig yn brysur ar hyn o bryd, ond byddaf yn parhau i geisio eich helpu.",
    "timeout": "Cymerodd hyn yn hirach nag oedd disgwyl. Gadewch i mi roi cynnig ar ddull gwahanol."
  },
  "validation": {
    "required_field": "Bydd eich teulu angen y wybodaeth hon – allwch chi fy helpu i’w llenwi?",
    "invalid_email": "Nid yw’r cyfeiriad e-bost hwn yn edrych yn hollol gywir. A allwch ei wirio eto?",
    "invalid_phone": "Mae gen i drafferth gyda’r fformat rhif ffôn hwn. A allwch roi cynnig arni mewn ffordd wahanol?",
    "invalid_date": "Nid yw’r fformat dyddiad hwn yn gweithio i mi. A allwch geisio MM/DD/BBBB?",
    "password_weak": "Gadewch i ni wneud eich cyfrinair ychydig yn gryfach i gadw gwybodaeth eich teulu’n fwy diogel.",
    "file_too_large": "Mae’r ffeil hon ychydig yn rhy fawr i mi ei thrin. A allwch geisio fersiwn llai?",
    "unsupported_file": "Ni allaf weithio gyda’r math hwn o ffeil. A allwch geisio PDF neu ddelwedd yn lle hynny?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Nid oeddwn yn gallu cadw’r wybodaeth ased hon ar hyn o bryd, ond byddaf yn parhau i geisio. Mae gwybodaeth eich teulu’n bwysig i mi.",
      "load_failed": "Rwy’n cael trafferth llwytho’ch asedau ar hyn o bryd. Gadewch i mi roi cynnig arall arni cyn bo hir.",
      "delete_failed": "Nid oeddwn yn gallu dileu’r eitem hon ar hyn o bryd. Hoffech i mi roi cynnig arall arni?"
    },
    "documents": {
      "upload_failed": "Nid yw’r ddogfen hon wedi’i huwchlwytho’n iawn. Peidiwch â phoeni – byddaf yn eich helpu i roi cynnig arall arni.",
      "processing_failed": "Cefais drafferth wrth brosesu’r ddogfen hon. Mae’r ffeil yn ddiogel, a byddaf yn ceisio eto.",
      "access_failed": "Ni allaf gael mynediad at y ddogfen hon ar hyn o bryd. Gadewch i mi weld beth alla i ei wneud i helpu."
    },
    "family": {
      "save_failed": "Nid oeddwn yn gallu cadw gwybodaeth y person hwn ar hyn o bryd. Gadewch i mi roi cynnig arall arni – mae eich cylch dibynadwy’n bwysig.",
      "invite_failed": "Nid oeddwn yn gallu anfon y gwahoddiad hwn ar hyn o bryd. Byddaf yn eich helpu i roi cynnig arall arni pan fyddwch yn barod.",
      "access_failed": "Rwy’n cael trafferth gyda’r gosodiadau mynediad teulu. Gadewch i mi weithio ar hyn i chi."
    },
    "will": {
      "generation_failed": "Nid oeddwn yn gallu creu eich ewyllys ar hyn o bryd. Peidiwch â phoeni – mae’ch holl benderfyniadau wedi’u cadw, a byddaf yn ceisio eto.",
      "save_failed": "Nid oeddwn yn gallu cadw’r newidiadau i’r ewyllys ar hyn o bryd. Mae’r fersiwn flaenorol yn ddiogel, a byddaf yn parhau i geisio.",
      "legal_check_failed": "Nid oeddwn yn gallu gwirio’r gofynion cyfreithiol ar hyn o bryd. Gadewch i mi geisio eto, neu gallwn gael cymorth gan ein tîm cyfreithiol."
    }
  },
  "emotional_support": {
    "frustration": "Rwy’n gwybod ei bod yn rhwystredig pan rydych yn ceisio gwneud rhywbeth pwysig i’ch teulu. Rwyf yma i’ch helpu i’w wneud yn iawn.",
    "time_pressure": "Rwy’n deall nad oes gennych lawer o amser ar gyfer problemau technegol. Gadewch i mi ddelio â hyn yn gyflym i chi.",
    "overwhelm": "Gall problemau technegol deimlo’n llethol pan rydych eisoes yn delio â chynllunio teuluol pwysig. Cymerwch anadl – rydw i ar ben hyn.",
    "discouragement": "Peidiwch â gadael i’r broblem dechnegol hon eich digalonni. Mae’r hyn rydych yn ei wneud i’ch teulu’n rhy bwysig i roi’r gorau iddi."
  },
  "solutions": {
    "refresh_page": "Weithiau mae adnewyddu’r dudalen yn helpu. Mae eich gwaith wedi’i gadw, felly ni fyddwch yn colli dim.",
    "try_different_browser": "Os yw hyn yn parhau i ddigwydd, ceisiwch ddefnyddio porwr gwahanol. Fel arfer mae Chrome neu Firefox yn gweithio orau.",
    "check_internet": "A allwch wirio eich cysylltiad rhyngrwyd? Weithiau dim ond hynny sydd angen.",
    "contact_support": "Hoffwn eich helpu’n bersonol. Gallwch gysylltu â’n tîm cymorth a fydd yn gofalu’n dda amdanoch.",
    "try_later": "Os ydych mewn brys, gallwch roi cynnig arall arni’n ddiweddarach. Mae popeth rydych wedi’i wneud wedi’i gadw’n ddiogel.",
    "alternative_approach": "Gadewch i mi awgrymu ffordd wahanol o wneud hyn a allai weithio’n well."
  },
  "recovery": {
    "auto_save_worked": "Y newyddion da yw bod popeth a roesoch wedi’i gadw’n awtomatig.",
    "backup_available": "Mae gennyf gopi wrth gefn o’ch gwaith o ychydig funudau yn ôl os oes ei angen arnoch.",
    "progress_preserved": "Mae’ch holl gynnydd wedi’i gadw – ni fydd angen i chi ddechrau eto.",
    "data_secure": "Mae gwybodaeth eich teulu yn aros yn gwbl ddiogel er gwaethaf y broblem dechnegol hon."
  }
}
