{
  "tos": {
    "title": "Telerau Gwasanaeth",
    "effectiveDate": "Dyddiad Cychwyn: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Derbyn Telerau",
        "body": "Drwy gael mynediad at neu ddefnyddio LegacyGuard Heritage Vault, rydych yn cytuno i fod yn rhwym wrth y Telerau Gwasanaeth hyn."
      },
      "service": {
        "title": "2. Disgrifiad o'r Gwasanaeth",
        "body": "Mae LegacyGuard Heritage Vault yn darparu gwasanaethau rheoli etifeddiaeth ddigidol, gan gynnwys storio dogfennau, creu ewyllysiau, a rhannu gwybodaeth bwysig yn ddiogel gyda buddiolwyr dynodedig."
      },
      "responsibilities": {
        "title": "3. Cyfrifoldebau Defnyddiwr",
        "body": "Chi sy'n gyfrifol am gadw cyfrinachedd manylion mewngofnodi eich cyfrif ac am bob gweithgaredd sy'n digwydd o dan eich cyfrif."
      },
      "privacy": {
        "title": "4. Preifatrwydd a Diogelu Data",
        "body": "Mae eich preifatrwydd yn bwysig i ni. Darllenwch ein Polisi Preifatrwydd i ddeall sut rydym yn casglu, defnyddio a diogelu eich gwybodaeth."
      },
      "liability": {
        "title": "5. Cyfyngu ar Atebolrwydd",
        "body": "Ni fydd LegacyGuard Heritage Vault yn atebol am unrhyw golledion anuniongyrchol, damweiniol, arbennig, canlyniadol nac yn gosbol sy'n deillio o'ch defnydd o'r gwasanaeth."
      }
    },
    "disclaimer": "[Dyma destun enghreifftiol. Cysylltwch â chyfreithiwr i greu Telerau Gwasanaeth cynhwysfawr.]"
  },
  "refund": {
    "title": "Polisi Ad-dalu",
    "effectiveDate": "Dyddiad Cychwyn: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Trosolwg",
        "body": "Bodlonrwydd cwsmeriaid yw ein blaenoriaeth. Mae'r Polisi Ad-dalu hwn yn amlinellu'r meini prawf a'r broses ar gyfer gwneud cais am ad-daliad."
      },
      "eligibility": {
        "title": "2. Cymhwyster ar gyfer Ad-daliadau",
        "body": "Efallai y byddwch yn gymwys i gael ad-daliad o fewn 30 diwrnod o'ch pryniant cychwynnol os nad ydych wedi defnyddio'r nodweddion premiwm yn helaeth. Rydym yn darparu ad-daliadau yn ôl ein disgresiwn."
      },
      "process": {
        "title": "3. Proses Ad-dalu",
        "body": "I ddechrau cais am ad-daliad, cysylltwch â'n tîm cymorth yn support@legacyguard.com o fewn 30 diwrnod i'r pryniant. Cynhwyswch e-bost eich cyfrif a'r rheswm dros y cais."
      },
      "nonRefundable": {
        "title": "4. Gwasanaethau na ellir eu Had-dalu",
        "intro": "Nid yw'r gwasanaethau canlynol yn gymwys ar gyfer ad-daliad:",
        "items": {
          "item1": "Tanysgrifiadau misol ar ôl y 30 diwrnod cyntaf",
          "item2": "Ffioedd prosesu dogfennau untro",
          "item3": "Gwasanaethau notari a chynghori cyfreithiol"
        }
      },
      "processingTime": {
        "title": "5. Amser Prosesu",
        "body": "Bydd ad-daliadau a gymeradwyir yn cael eu prosesu o fewn 5–10 diwrnod busnes a'u credydu i'r dull talu gwreiddiol."
      }
    },
    "disclaimer": "[Dyma destun enghreifftiol. Cysylltwch â chyfreithiwr i greu Polisi Ad-dalu cynhwysfawr.]"
  }
}
