{
  "tos": {
    "title": "Condiciones de servicio",
    "effectiveDate": "Fecha de entrada en vigor: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Aceptación de los Términos",
        "body": "Al acceder o utilizar LegacyGuard Heritage Vault, usted acepta estar sujeto a estos Términos de servicio."
      },
      "service": {
        "title": "2. Descripción del servicio",
        "body": "LegacyGuard Heritage Vault ofrece servicios de gestión de legados digitales, incluido el almacenamiento de documentos, la generación de testamentos y el intercambio seguro de información importante con los beneficiarios designados."
      },
      "responsibilities": {
        "title": "3. Responsabilidades del usuario",
        "body": "Usted es responsable de mantener la confidencialidad de las credenciales de su cuenta y de todas las actividades que ocurran en su cuenta."
      },
      "privacy": {
        "title": "4. Privacidad y protección de datos",
        "body": "Su privacidad es importante para nosotros. Por favor, revise nuestra Política de Privacidad para comprender cómo recopilamos, usamos y protegemos su información."
      },
      "liability": {
        "title": "5. Limitación de responsabilidad",
        "body": "LegacyGuard Heritage Vault no será responsable de ningún daño indirecto, incidental, especial, consecuente o punitivo que resulte de su uso del servicio."
      }
    },
    "disclaimer": "[Este es un espacio provisional. Consulte con un asesor legal para crear Términos de Servicio completos.]"
  },
  "refund": {
    "title": "Política de reembolso",
    "effectiveDate": "Fecha de entrada en vigor: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Descripción general",
        "body": "La satisfacción del cliente es nuestra prioridad. Esta Política de Reembolso describe los criterios y el proceso para solicitar un reembolso."
      },
      "eligibility": {
        "title": "2. Elegibilidad para reembolsos",
        "body": "Si no ha usado las funciones premium con frecuencia, podría tener derecho a un reembolso dentro de los 30 días posteriores a su compra inicial. Los reembolsos se otorgan a nuestra discreción."
      },
      "process": {
        "title": "3. Proceso de reembolso",
        "body": "Para solicitar un reembolso, contacte con nuestro equipo de soporte en support@legacyguard.com dentro de los 30 días posteriores a la compra. Incluya el correo electrónico de su cuenta y el motivo de la solicitud."
      },
      "nonRefundable": {
        "title": "4. Servicios no reembolsables",
        "intro": "Los siguientes servicios no son reembolsables:",
        "items": {
          "item1": "Suscripciones mensuales después de los primeros 30 días",
          "item2": "Tarifas únicas de procesamiento de documentos",
          "item3": "Servicios de notarización y asesoría legal"
        }
      },
      "processingTime": {
        "title": "5. Tiempo de procesamiento",
        "body": "Los reembolsos aprobados se procesarán dentro de 5 a 10 días hábiles y se acreditarán a su método de pago original."
      }
    },
    "disclaimer": "[Este es un marcador. Consulte con un asesor legal para crear una Política de Reembolso completa.]"
  }
}
