{
  "general": {
    "something_wrong": "Nešto nije prošlo kako treba, ali ne brinite – vaši važni podaci su sigurni.",
    "try_again": "Dopustite mi da pokušam ponovno za vas",
    "contact_support": "Ovdje sam da vam pomognem ako trebate podršku",
    "no_data_lost": "Dobra vijest je da ništa od vašeg rada nije izgubljeno",
    "temporary_issue": "Čini se da je ovo privremeni problem koji bi se uskoro trebao riješiti"
  },
  "network": {
    "connection_lost": "Čini se da je vaša internetska veza prekinuta. Vaš rad je spremljen i automatski ćemo se ponovno povezati.",
    "slow_connection": "Vaša veza danas izgleda malo sporije. Strpljivo ću pričekati dok se sve ne učita.",
    "server_busy": "Naši su poslužitelji trenutno malo zauzeti, ali nastavit ću pokušavati pomoći vam.",
    "timeout": "To je trajalo dulje nego što se očekivalo. Dopustite mi da pokušam drugačiji pristup."
  },
  "validation": {
    "required_field": "Vašoj obitelji će trebati ovaj podatak – možete li mi pomoći da ga ispunimo?",
    "invalid_email": "Ova adresa e-pošte ne izgleda ispravno. Možete li je provjeriti ponovno?",
    "invalid_phone": "Imam poteškoća s ovim formatom broja telefona. Možete li ga pokušati unijeti na drugi način?",
    "invalid_date": "Ovaj format datuma mi ne odgovara. Možete li pokušati MM/DD/GGGG?",
    "password_weak": "Učinimo vašu lozinku malo jačom kako bismo dodatno zaštitili podatke vaše obitelji.",
    "file_too_large": "Ova je datoteka malo prevelika za mene. Možete li pokušati manju verziju?",
    "unsupported_file": "Ne mogu raditi s ovom vrstom datoteke. Možete li pokušati PDF ili sliku?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Trenutno nisam mogao spremiti podatke o ovoj imovini, ali nastavit ću pokušavati. Podaci vaše obitelji su mi važni.",
      "load_failed": "Imam poteškoća s učitavanjem vaše imovine. Dopustite mi da pokušam ponovno za trenutak.",
      "delete_failed": "Nisam mogao ukloniti ovu stavku sada. Želite li da pokušam ponovno?"
    },
    "documents": {
      "upload_failed": "Ovaj dokument nije ispravno učitan. Ne brinite – pomoći ću vam pokušati ponovno.",
      "processing_failed": "Imao sam problema s obradom ovog dokumenta. Datoteka je sigurna i pokušat ću ponovno.",
      "access_failed": "Trenutno ne mogu pristupiti ovom dokumentu. Dopustite mi da vidim što mogu učiniti da pomognem."
    },
    "family": {
      "save_failed": "Trenutno nisam mogao spremiti podatke o ovoj osobi. Pokušajmo ponovno – vaš krug povjerenja je važan.",
      "invite_failed": "Trenutno nisam mogao poslati ovaj poziv. Pomoći ću vam pokušati ponovno kada budete spremni.",
      "access_failed": "Imam problema s postavkama pristupa obitelji. Dopustite mi da to riješim za vas."
    },
    "will": {
      "generation_failed": "Trenutno nisam mogao izraditi vašu oporuku. Ne brinite – sve vaše odluke su spremljene i pokušat ću ponovno.",
      "save_failed": "Trenutno nisam mogao spremiti promjene u oporuci. Vaša prethodna verzija je sigurna i nastavit ću pokušavati.",
      "legal_check_failed": "Trenutno nisam mogao provjeriti pravne zahtjeve. Dopustite mi da pokušam ponovno ili da zatražimo pomoć našeg pravnog tima."
    }
  },
  "emotional_support": {
    "frustration": "Znam da je frustrirajuće kada pokušavate učiniti nešto važno za svoju obitelj. Ovdje sam da vam pomognem da uspijete.",
    "time_pressure": "Razumijem da nemate puno vremena za tehničke probleme. Dopustite mi da to brzo riješim za vas.",
    "overwhelm": "Tehnički problemi mogu biti preplavljujući kada se već bavite važnim obiteljskim planiranjem. Udahnite duboko – ja ću to riješiti.",
    "discouragement": "Nemojte dopustiti da vas ovaj tehnički problem obeshrabri. Ono što radite za svoju obitelj previše je važno da biste odustali."
  },
  "solutions": {
    "refresh_page": "Ponekad pomaže osvježiti stranicu. Vaš rad je spremljen, tako da nećete izgubiti ništa.",
    "try_different_browser": "Ako se ovo nastavi događati, pokušajte koristiti drugi preglednik. Chrome ili Firefox obično rade najbolje.",
    "check_internet": "Možete li provjeriti svoju internetsku vezu? Ponekad je to sve što treba.",
    "contact_support": "Rado ću vam osobno pomoći. Možete kontaktirati naš tim za podršku koji će se dobro pobrinuti za vas.",
    "try_later": "Ako žurite, možete pokušati ponovno kasnije. Sve što ste učinili je sigurno spremljeno.",
    "alternative_approach": "Dopustite mi da predložim drugi način da ovo učinite koji bi mogao bolje funkcionirati."
  },
  "recovery": {
    "auto_save_worked": "Dobra vijest je da je sve što ste unijeli automatski spremljeno.",
    "backup_available": "Imam sigurnosnu kopiju vašeg rada od prije nekoliko minuta ako vam zatreba.",
    "progress_preserved": "Sav vaš napredak je očuvan – nećete morati početi ispočetka.",
    "data_secure": "Podaci vaše obitelji ostaju potpuno sigurni unatoč ovom tehničkom problemu."
  }
}
