{
  "general": {
    "something_wrong": "Quelque chose n’a pas tout à fait fonctionné, mais ne vous inquiétez pas – vos informations importantes sont en sécurité.",
    "try_again": "Laissez-moi réessayer pour vous",
    "contact_support": "Je suis là pour vous aider si vous avez besoin d’assistance",
    "no_data_lost": "La bonne nouvelle est qu’aucune de vos données n’a été perdue",
    "temporary_issue": "Il semble que ce soit un problème temporaire qui devrait se résoudre rapidement"
  },
  "network": {
    "connection_lost": "Il semble que votre connexion Internet ait été interrompue. Votre travail est enregistré et nous allons nous reconnecter automatiquement.",
    "slow_connection": "Votre connexion semble un peu lente aujourd’hui. J’attendrai patiemment que tout se charge.",
    "server_busy": "Nos serveurs sont un peu occupés en ce moment, mais je continuerai à essayer de vous aider.",
    "timeout": "Cela a pris plus de temps que prévu. Laissez-moi essayer une autre approche."
  },
  "validation": {
    "required_field": "Votre famille aura besoin de cette information – pouvez-vous m’aider à la remplir ?",
    "invalid_email": "Cette adresse e-mail ne semble pas correcte. Pourriez-vous la vérifier à nouveau ?",
    "invalid_phone": "J’ai du mal avec le format de ce numéro de téléphone. Pourriez-vous essayer de l’entrer différemment ?",
    "invalid_date": "Ce format de date ne fonctionne pas pour moi. Pouvez-vous essayer JJ/MM/AAAA ?",
    "password_weak": "Renforçons un peu votre mot de passe pour protéger encore mieux les informations de votre famille.",
    "file_too_large": "Ce fichier est un peu trop volumineux pour que je puisse le traiter. Pouvez-vous essayer une version plus petite ?",
    "unsupported_file": "Je ne peux pas travailler avec ce type de fichier. Pouvez-vous essayer un PDF ou une image à la place ?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Je n’ai pas pu enregistrer les informations de cet actif pour le moment, mais je vais continuer à essayer. Les informations de votre famille sont importantes pour moi.",
      "load_failed": "J’ai des difficultés à charger vos actifs pour le moment. Laissez-moi réessayer dans un instant.",
      "delete_failed": "Je n’ai pas pu supprimer cet élément maintenant. Voulez-vous que j’essaie à nouveau ?"
    },
    "documents": {
      "upload_failed": "Ce document ne s’est pas téléchargé correctement. Ne vous inquiétez pas – je vais vous aider à réessayer.",
      "processing_failed": "J’ai eu un problème lors du traitement de ce document. Le fichier est en sécurité et je vais réessayer.",
      "access_failed": "Je ne peux pas accéder à ce document pour le moment. Laissez-moi voir ce que je peux faire pour vous aider."
    },
    "family": {
      "save_failed": "Je n’ai pas pu enregistrer les informations de cette personne pour le moment. Réessayons – votre cercle de confiance est important.",
      "invite_failed": "Je n’ai pas pu envoyer cette invitation maintenant. Je vous aiderai à réessayer lorsque vous serez prêt.",
      "access_failed": "J’ai des difficultés avec les paramètres d’accès de la famille. Laissez-moi m’en occuper pour vous."
    },
    "will": {
      "generation_failed": "Je n’ai pas pu créer votre testament pour le moment. Ne vous inquiétez pas – toutes vos décisions sont enregistrées et je vais réessayer.",
      "save_failed": "Je n’ai pas pu enregistrer les modifications du testament pour le moment. La version précédente est en sécurité et je vais continuer à essayer.",
      "legal_check_failed": "Je n’ai pas pu vérifier les exigences légales pour le moment. Laissez-moi réessayer, ou nous pouvons demander de l’aide à notre équipe juridique."
    }
  },
  "emotional_support": {
    "frustration": "Je sais que c’est frustrant lorsque vous essayez de faire quelque chose d’important pour votre famille. Je suis là pour vous aider à y parvenir.",
    "time_pressure": "Je comprends que vous n’ayez pas beaucoup de temps pour des problèmes techniques. Laissez-moi m’en occuper rapidement pour vous.",
    "overwhelm": "Les problèmes techniques peuvent sembler accablants lorsque vous êtes déjà occupé par la planification familiale. Respirez – je m’en charge.",
    "discouragement": "Ne laissez pas ce contretemps technique vous décourager. Ce que vous faites pour votre famille est trop important pour abandonner."
  },
  "solutions": {
    "refresh_page": "Parfois, actualiser la page aide. Votre travail est enregistré, vous ne perdrez donc rien.",
    "try_different_browser": "Si cela continue, essayez d’utiliser un autre navigateur. Chrome ou Firefox fonctionnent généralement le mieux.",
    "check_internet": "Pouvez-vous vérifier votre connexion Internet ? Parfois, il ne faut que ça.",
    "contact_support": "Je serais heureux de vous aider personnellement. Vous pouvez contacter notre équipe d’assistance qui prendra bien soin de vous.",
    "try_later": "Si vous êtes pressé, vous pouvez réessayer plus tard. Tout ce que vous avez fait est enregistré en toute sécurité.",
    "alternative_approach": "Laissez-moi vous suggérer une autre façon de procéder qui pourrait mieux fonctionner."
  },
  "recovery": {
    "auto_save_worked": "La bonne nouvelle est que tout ce que vous avez saisi a été enregistré automatiquement.",
    "backup_available": "J’ai une sauvegarde de votre travail datant d’il y a quelques minutes, si vous en avez besoin.",
    "progress_preserved": "Tout votre progrès est conservé – vous n’aurez pas à recommencer depuis le début.",
    "data_secure": "Les informations de votre famille restent entièrement sécurisées malgré ce problème technique."
  }
}
