{
  "general": {
    "something_wrong": "Nešto nije radilo baš kako treba, ali ne brinite – vaši važni podaci su sigurni.",
    "try_again": "Dozvolite mi da pokušam ponovo za vas",
    "contact_support": "Ovde sam da vam pomognem ako vam je potrebna podrška",
    "no_data_lost": "Dobra vest je da ništa od onoga na čemu ste radili nije izgubljeno",
    "temporary_issue": "Izgleda da je ovo privremeni problem koji bi trebalo brzo da se reši"
  },
  "network": {
    "connection_lost": "Izgleda da je vaša internet veza prekinuta. Vaš rad je sačuvan i automatski ćemo se ponovo povezati.",
    "slow_connection": "Vaša veza danas izgleda malo spora. Strpljivo ću sačekati dok se sve ne učita.",
    "server_busy": "Naši serveri su trenutno malo zauzeti, ali nastaviću da pokušavam da vam pomognem.",
    "timeout": "Ovo je trajalo duže nego što sam očekivao. Dozvolite mi da pokušam drugačiji pristup."
  },
  "validation": {
    "required_field": "Vašoj porodici će biti potrebne ove informacije – možete li mi pomoći da ih popunim?",
    "invalid_email": "Ta email adresa ne izgleda baš ispravno. Možete li je još jednom proveriti?",
    "invalid_phone": "Imam poteškoća sa ovim formatom broja telefona. Možete li ga uneti na drugačiji način?",
    "invalid_date": "Taj format datuma mi ne odgovara. Možete li probati MM/DD/GGGG?",
    "password_weak": "Hajde da učinimo vašu lozinku malo jačom kako bismo dodatno zaštitili podatke vaše porodice.",
    "file_too_large": "Taj fajl je malo prevelik za mene. Možete li probati manju verziju?",
    "unsupported_file": "Ne mogu da radim sa tom vrstom fajla. Možete li probati PDF ili sliku?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Nisam mogao da sačuvam te podatke o imovini sada, ali nastaviću da pokušavam. Podaci vaše porodice su mi važni.",
      "load_failed": "Imam poteškoća sa učitavanjem vaše imovine sada. Dozvolite mi da pokušam ponovo za trenutak.",
      "delete_failed": "Nisam mogao da obrišem tu stavku sada. Želite li da pokušam ponovo?"
    },
    "documents": {
      "upload_failed": "Taj dokument se nije pravilno učitao. Ne brinite – pomoći ću vam da pokušate ponovo.",
      "processing_failed": "Imao sam problema sa obradom tog dokumenta. Fajl je bezbedan i pokušaću ponovo.",
      "access_failed": "Ne mogu da pristupim tom dokumentu sada. Dozvolite mi da vidim šta mogu da uradim."
    },
    "family": {
      "save_failed": "Nisam mogao da sačuvam podatke o toj osobi sada. Dozvolite mi da pokušam ponovo – vaš krug poverenja je važan.",
      "invite_failed": "Nisam mogao da pošaljem taj poziv sada. Pomoći ću vam da pokušate ponovo kada budete spremni.",
      "access_failed": "Imam poteškoća sa podešavanjima pristupa porodici. Dozvolite mi da to rešim za vas."
    },
    "will": {
      "generation_failed": "Nisam mogao da napravim vaš testament sada. Ne brinite – sve vaše odluke su sačuvane i pokušaću ponovo.",
      "save_failed": "Nisam mogao da sačuvam te izmene testamenta sada. Vaša prethodna verzija je sigurna i nastaviću da pokušavam.",
      "legal_check_failed": "Nisam mogao da proverim pravne zahteve sada. Dozvolite mi da pokušam ponovo ili da potražimo pomoć našeg pravnog tima."
    }
  },
  "emotional_support": {
    "frustration": "Znam da je frustrirajuće kada pokušavate da uradite nešto važno za svoju porodicu. Tu sam da vam pomognem da ovo funkcioniše.",
    "time_pressure": "Razumem da nemate puno vremena za tehničke probleme. Dozvolite mi da ovo brzo rešim za vas.",
    "overwhelm": "Tehnički problemi mogu da budu opterećujući kada se već bavite važnim planiranjem za porodicu. Udahnite – ja ću ovo rešiti.",
    "discouragement": "Nemojte dozvoliti da vas ovaj tehnički problem obeshrabri. Ono što radite za svoju porodicu je previše važno da biste odustali."
  },
  "solutions": {
    "refresh_page": "Ponekad osvežavanje stranice pomaže. Vaš rad je sačuvan, tako da nećete ništa izgubiti.",
    "try_different_browser": "Ako se ovo nastavi, pokušajte da koristite drugi pregledač. Chrome ili Firefox obično najbolje rade.",
    "check_internet": "Možete li proveriti svoju internet vezu? Ponekad je to sve što je potrebno.",
    "contact_support": "Voleo bih lično da vam pomognem. Možete kontaktirati naš tim podrške koji će se dobro pobrinuti za vas.",
    "try_later": "Ako žurite, možete ovo pokušati ponovo kasnije. Sve što ste uradili je bezbedno sačuvano.",
    "alternative_approach": "Dozvolite mi da predložim drugi način da ovo uradite koji bi mogao bolje da funkcioniše."
  },
  "recovery": {
    "auto_save_worked": "Dobra vest je da je sve što ste uneli automatski sačuvano.",
    "backup_available": "Imam rezervnu kopiju vašeg rada od pre nekoliko minuta ako vam zatreba.",
    "progress_preserved": "Sav vaš napredak je sačuvan – nećete morati da počinjete ispočetka.",
    "data_secure": "Podaci vaše porodice ostaju potpuno sigurni uprkos ovom tehničkom problemu."
  }
}
