{
  "tos": {
    "title": "Þjónustuskilmálar",
    "effectiveDate": "Gildistími: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Samþykki skilmála",
        "body": "Með því að fá aðgang að eða nota LegacyGuard Heritage Vault samþykkir þú að vera bundinn af þessum þjónustuskilmálum."
      },
      "service": {
        "title": "2. Lýsing þjónustu",
        "body": "LegacyGuard Heritage Vault veitir stafræna arfstjórnunarþjónustu, þar á meðal geymslu skjala, gerð erfðaskráa og örugga miðlun mikilvægra upplýsinga til tilgreindra rétthafa."
      },
      "responsibilities": {
        "title": "3. Ábyrgð notanda",
        "body": "Þú berð ábyrgð á að halda leynd lykilorða og annarra aðgangsupplýsinga að þínum reikningi og fyrir allar aðgerðir sem fara fram undir honum."
      },
      "privacy": {
        "title": "4. Persónuvernd og gagnavernd",
        "body": "Persónuvernd þín er okkur mikilvæg. Vinsamlegast lestu persónuverndarstefnu okkar til að skilja hvernig við söfnum, notum og verjum upplýsingar þínar."
      },
      "liability": {
        "title": "5. Takmörkun ábyrgðar",
        "body": "LegacyGuard Heritage Vault ber ekki ábyrgð á óbeinum, tilviljanakenndum, sérstökum, afleiddum eða refsiverðum tjónum sem kunna að hljótast af notkun þjónustunnar."
      }
    },
    "disclaimer": "[Þetta er staðgengill texti. Hafðu samband við lögfræðing til að útbúa fullkomna þjónustuskilmála.]"
  },
  "refund": {
    "title": "Endurgreiðslustefna",
    "effectiveDate": "Gildistími: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Yfirlit",
        "body": "Ánægja viðskiptavina er forgangsverkefni okkar. Þessi endurgreiðslustefna lýsir skilyrðum og ferli til að óska eftir endurgreiðslu."
      },
      "eligibility": {
        "title": "2. Réttur til endurgreiðslu",
        "body": "Þú gætir átt rétt á endurgreiðslu innan 30 daga frá upphafskaupum ef þú hefur ekki notað aukaaðgerðir að miklu leyti. Endurgreiðslur eru veittar að okkar geðþótta."
      },
      "process": {
        "title": "3. Ferli endurgreiðslu",
        "body": "Til að hefja beiðni um endurgreiðslu skaltu hafa samband við þjónustuteymið okkar á support@legacyguard.com innan 30 daga frá kaupum. Láttu fylgja með netfang reikningsins og ástæðu beiðninnar."
      },
      "nonRefundable": {
        "title": "4. Þjónusta sem ekki er endurgreidd",
        "intro": "Eftirfarandi þjónusta er ekki endurgreidd:",
        "items": {
          "item1": "Mánaðaráskriftir eftir fyrstu 30 dagana",
          "item2": "Eingreiðslugjöld fyrir skjalaafgreiðslu",
          "item3": "Þjónusta lögbókanda og lögfræðiráðgjöf"
        }
      },
      "processingTime": {
        "title": "5. Afgreiðslutími",
        "body": "Samþykktar endurgreiðslur verða afgreiddar innan 5–10 virkra daga og lagðar inn á upprunalega greiðslumáta."
      }
    },
    "disclaimer": "[Þetta er staðgengill texti. Hafðu samband við lögfræðing til að útbúa fullkomna endurgreiðslustefnu.]"
  }
}
