{
  "general": {
    "something_wrong": "Etwas hat nicht ganz richtig funktioniert, aber keine Sorge – Ihre wichtigen Informationen sind sicher.",
    "try_again": "Lassen Sie mich es noch einmal für Sie versuchen",
    "contact_support": "Ich bin hier, um zu helfen, falls Sie Unterstützung benötigen",
    "no_data_lost": "Die gute Nachricht ist, dass nichts von Ihrer Arbeit verloren gegangen ist",
    "temporary_issue": "Dies scheint ein vorübergehendes Problem zu sein, das bald behoben sein sollte"
  },
  "network": {
    "connection_lost": "Es scheint, dass Ihre Internetverbindung unterbrochen wurde. Ihre Arbeit ist gespeichert, und wir stellen automatisch wieder eine Verbindung her.",
    "slow_connection": "Ihre Verbindung scheint heute etwas langsam zu sein. Ich warte geduldig, während alles geladen wird.",
    "server_busy": "Unsere Server sind im Moment etwas ausgelastet, aber ich werde weiterhin versuchen, Ihnen zu helfen.",
    "timeout": "Das hat länger gedauert als erwartet. Lassen Sie mich einen anderen Ansatz versuchen."
  },
  "validation": {
    "required_field": "Ihre Familie wird diese Information benötigen – könnten Sie mir helfen, sie auszufüllen?",
    "invalid_email": "Diese E-Mail-Adresse sieht nicht ganz richtig aus. Könnten Sie sie bitte noch einmal überprüfen?",
    "invalid_phone": "Ich habe Schwierigkeiten mit diesem Telefonnummernformat. Versuchen Sie bitte, es anders einzugeben.",
    "invalid_date": "Dieses Datumsformat funktioniert nicht für mich. Könnten Sie es mit MM/TT/JJJJ versuchen?",
    "password_weak": "Lassen Sie uns Ihr Passwort etwas stärker machen, um die Daten Ihrer Familie besonders gut zu schützen.",
    "file_too_large": "Diese Datei ist etwas zu groß für mich. Könnten Sie eine kleinere Version versuchen?",
    "unsupported_file": "Mit diesem Dateityp kann ich nicht arbeiten. Versuchen Sie es bitte mit einer PDF oder einem Bild."
  },
  "contextual": {
    "assets": {
      "save_failed": "Ich konnte die Informationen zu diesem Vermögenswert gerade nicht speichern, werde es aber weiterhin versuchen. Die Daten Ihrer Familie sind mir wichtig.",
      "load_failed": "Ich habe momentan Probleme beim Laden Ihrer Vermögenswerte. Lassen Sie mich es gleich noch einmal versuchen.",
      "delete_failed": "Ich konnte dieses Element gerade nicht entfernen. Möchten Sie, dass ich es erneut versuche?"
    },
    "documents": {
      "upload_failed": "Dieses Dokument wurde nicht korrekt hochgeladen. Keine Sorge – ich helfe Ihnen, es erneut zu versuchen.",
      "processing_failed": "Ich hatte Probleme bei der Verarbeitung dieses Dokuments. Die Datei ist sicher und ich werde es noch einmal versuchen.",
      "access_failed": "Ich kann momentan nicht auf dieses Dokument zugreifen. Lassen Sie mich sehen, was ich tun kann, um zu helfen."
    },
    "family": {
      "save_failed": "Ich konnte die Informationen zu dieser Person gerade nicht speichern. Lassen Sie es mich noch einmal versuchen – Ihr enger Kreis ist wichtig.",
      "invite_failed": "Ich konnte diese Einladung gerade nicht versenden. Ich helfe Ihnen, es erneut zu versuchen, wenn Sie bereit sind.",
      "access_failed": "Ich habe Probleme mit den Zugriffseinstellungen für die Familie. Lassen Sie mich das für Sie übernehmen."
    },
    "will": {
      "generation_failed": "Ich konnte Ihr Testament gerade nicht erstellen. Keine Sorge – alle Ihre Entscheidungen sind gespeichert, und ich werde es erneut versuchen.",
      "save_failed": "Ich konnte die Änderungen am Testament gerade nicht speichern. Die vorherige Version ist sicher, und ich werde es weiterhin versuchen.",
      "legal_check_failed": "Ich konnte die rechtlichen Anforderungen gerade nicht überprüfen. Lassen Sie es mich erneut versuchen oder wir holen Hilfe von unserem Rechtsteam."
    }
  },
  "emotional_support": {
    "frustration": "Ich weiß, dass es frustrierend ist, wenn Sie etwas Wichtiges für Ihre Familie erledigen wollen. Ich bin hier, um Ihnen zu helfen, es umzusetzen.",
    "time_pressure": "Ich verstehe, dass Sie nicht viel Zeit für technische Probleme haben. Lassen Sie mich das schnell für Sie erledigen.",
    "overwhelm": "Technische Probleme können überwältigend wirken, wenn Sie sich bereits mit wichtiger Familienplanung beschäftigen. Atmen Sie durch – ich habe das im Griff.",
    "discouragement": "Lassen Sie sich von diesem technischen Problem nicht entmutigen. Was Sie für Ihre Familie tun, ist zu wichtig, um aufzugeben."
  },
  "solutions": {
    "refresh_page": "Manchmal hilft es, die Seite neu zu laden. Ihre Arbeit ist gespeichert, sodass Sie nichts verlieren.",
    "try_different_browser": "Wenn dies weiterhin passiert, versuchen Sie es mit einem anderen Browser. Chrome oder Firefox funktionieren meist am besten.",
    "check_internet": "Könnten Sie Ihre Internetverbindung überprüfen? Manchmal reicht das schon.",
    "contact_support": "Ich helfe Ihnen gerne persönlich. Sie können unser Support-Team kontaktieren, das sich gut um Sie kümmern wird.",
    "try_later": "Falls Sie es eilig haben, können Sie es später noch einmal versuchen. Alles, was Sie getan haben, ist sicher gespeichert.",
    "alternative_approach": "Lassen Sie mich Ihnen eine andere Vorgehensweise vorschlagen, die besser funktionieren könnte."
  },
  "recovery": {
    "auto_save_worked": "Die gute Nachricht ist, dass alles, was Sie eingegeben haben, automatisch gespeichert wurde.",
    "backup_available": "Ich habe eine Sicherung Ihrer Arbeit von vor wenigen Minuten, falls Sie sie benötigen.",
    "progress_preserved": "Ihr gesamter Fortschritt ist erhalten – Sie müssen nicht von vorne beginnen.",
    "data_secure": "Die Informationen Ihrer Familie bleiben trotz dieses technischen Problems vollständig geschützt."
  }
}
