{
  "general": {
    "something_wrong": "Qualcosa non ha funzionato correttamente, ma non preoccuparti: le tue informazioni importanti sono al sicuro.",
    "try_again": "Lascia che ci riprovi per te",
    "contact_support": "Sono qui per aiutarti se hai bisogno di assistenza",
    "no_data_lost": "La buona notizia è che nulla del tuo lavoro è andato perso",
    "temporary_issue": "Sembra essere un problema temporaneo che dovrebbe risolversi presto"
  },
  "network": {
    "connection_lost": "Sembra che la tua connessione Internet sia stata interrotta. Il tuo lavoro è stato salvato e ci ricollegheremo automaticamente.",
    "slow_connection": "La tua connessione sembra un po' lenta oggi. Aspetterò pazientemente mentre tutto si carica.",
    "server_busy": "I nostri server sono un po' occupati in questo momento, ma continuerò a cercare di aiutarti.",
    "timeout": "Ci è voluto più tempo del previsto. Lascia che provi un approccio diverso."
  },
  "validation": {
    "required_field": "La tua famiglia avrà bisogno di questa informazione – puoi aiutarmi a compilarla?",
    "invalid_email": "Questo indirizzo email non sembra corretto. Puoi ricontrollarlo per me?",
    "invalid_phone": "Ho difficoltà con questo formato di numero di telefono. Puoi provare a inserirlo in modo diverso?",
    "invalid_date": "Questo formato di data non funziona per me. Puoi provare con MM/GG/AAAA?",
    "password_weak": "Rendiamo la tua password un po' più forte per proteggere al meglio le informazioni della tua famiglia.",
    "file_too_large": "Questo file è un po' troppo grande per me da gestire. Puoi provare una versione più piccola?",
    "unsupported_file": "Non posso lavorare con questo tipo di file. Puoi provare con un PDF o un'immagine?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Non sono riuscito a salvare le informazioni su questo bene in questo momento, ma continuerò a provare. Le informazioni della tua famiglia sono importanti per me.",
      "load_failed": "Sto avendo difficoltà a caricare i tuoi beni in questo momento. Lascia che riprovi tra poco.",
      "delete_failed": "Non sono riuscito a rimuovere questo elemento ora. Vuoi che riprovi?"
    },
    "documents": {
      "upload_failed": "Questo documento non è stato caricato correttamente. Non preoccuparti – ti aiuterò a riprovare.",
      "processing_failed": "Ho avuto problemi nell'elaborare questo documento. Il file è al sicuro e riproverò.",
      "access_failed": "Non riesco ad accedere a questo documento in questo momento. Lascia che veda cosa posso fare per aiutarti."
    },
    "family": {
      "save_failed": "Non sono riuscito a salvare le informazioni su questa persona in questo momento. Riproviamo – la tua cerchia di fiducia è importante.",
      "invite_failed": "Non sono riuscito a inviare questo invito ora. Ti aiuterò a riprovare quando sarai pronto.",
      "access_failed": "Sto avendo difficoltà con le impostazioni di accesso della famiglia. Lascia che me ne occupi per te."
    },
    "will": {
      "generation_failed": "Non sono riuscito a creare il tuo testamento ora. Non preoccuparti – tutte le tue decisioni sono state salvate e riproverò.",
      "save_failed": "Non sono riuscito a salvare le modifiche al testamento in questo momento. La versione precedente è al sicuro e continuerò a provare.",
      "legal_check_failed": "Non sono riuscito a verificare i requisiti legali in questo momento. Lascia che riprovi o possiamo chiedere aiuto al nostro team legale."
    }
  },
  "emotional_support": {
    "frustration": "So che è frustrante quando cerchi di fare qualcosa di importante per la tua famiglia. Sono qui per aiutarti a farlo funzionare.",
    "time_pressure": "Capisco che tu non abbia molto tempo per problemi tecnici. Lascia che lo risolva rapidamente per te.",
    "overwhelm": "I problemi tecnici possono sembrare travolgenti quando stai già affrontando una pianificazione familiare importante. Fai un respiro – ci penso io.",
    "discouragement": "Non lasciare che questo intoppo tecnico ti scoraggi. Quello che stai facendo per la tua famiglia è troppo importante per rinunciare."
  },
  "solutions": {
    "refresh_page": "A volte aggiornare la pagina aiuta. Il tuo lavoro è salvato, quindi non perderai nulla.",
    "try_different_browser": "Se questo continua a succedere, prova a usare un browser diverso. Chrome o Firefox di solito funzionano meglio.",
    "check_internet": "Puoi controllare la tua connessione Internet? A volte basta questo.",
    "contact_support": "Sarei felice di aiutarti personalmente. Puoi contattare il nostro team di supporto che si prenderà cura di te.",
    "try_later": "Se hai fretta, puoi riprovare più tardi. Tutto ciò che hai fatto è salvato in modo sicuro.",
    "alternative_approach": "Lascia che ti suggerisca un altro modo per farlo che potrebbe funzionare meglio."
  },
  "recovery": {
    "auto_save_worked": "La buona notizia è che tutto ciò che hai inserito è stato salvato automaticamente.",
    "backup_available": "Ho un backup del tuo lavoro di pochi minuti fa, se ne hai bisogno.",
    "progress_preserved": "Tutti i tuoi progressi sono stati preservati – non dovrai ricominciare da capo.",
    "data_secure": "Le informazioni della tua famiglia rimangono completamente sicure nonostante questo problema tecnico."
  }
}
