{
  "tos": {
    "title": "Termini di Servizio",
    "effectiveDate": "Data di entrata in vigore: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Accettazione dei Termini",
        "body": "Accedendo o utilizzando LegacyGuard Heritage Vault, accetti di essere vincolato dai presenti Termini di Servizio."
      },
      "service": {
        "title": "2. Descrizione del Servizio",
        "body": "LegacyGuard Heritage Vault fornisce servizi di gestione dell'eredità digitale, inclusi archiviazione di documenti, creazione di testamenti e condivisione sicura di informazioni importanti con i beneficiari designati."
      },
      "responsibilities": {
        "title": "3. Responsabilità dell'Utente",
        "body": "Sei responsabile del mantenimento della riservatezza delle credenziali del tuo account e di tutte le attività svolte tramite il tuo account."
      },
      "privacy": {
        "title": "4. Privacy e Protezione dei Dati",
        "body": "La tua privacy è importante per noi. Ti invitiamo a consultare la nostra Informativa sulla Privacy per capire come raccogliamo, utilizziamo e proteggiamo le tue informazioni."
      },
      "liability": {
        "title": "5. Limitazione di Responsabilità",
        "body": "LegacyGuard Heritage Vault non sarà responsabile per danni indiretti, accidentali, speciali, consequenziali o punitivi derivanti dall'utilizzo del servizio."
      }
    },
    "disclaimer": "[Questo è un testo segnaposto. Si prega di consultare un legale per redigere Termini di Servizio completi.]"
  },
  "refund": {
    "title": "Politica di Rimborso",
    "effectiveDate": "Data di entrata in vigore: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Panoramica",
        "body": "La soddisfazione del cliente è la nostra priorità. Questa Politica di Rimborso delinea i criteri e il processo per richiedere un rimborso."
      },
      "eligibility": {
        "title": "2. Idoneità al Rimborso",
        "body": "Potresti avere diritto a un rimborso entro 30 giorni dall'acquisto iniziale se non hai utilizzato ampiamente le funzionalità premium. I rimborsi sono concessi a nostra discrezione."
      },
      "process": {
        "title": "3. Procedura di Rimborso",
        "body": "Per avviare una richiesta di rimborso, contatta il nostro team di supporto all'indirizzo support@legacyguard.com entro 30 giorni dall'acquisto. Includi l'e-mail del tuo account e il motivo della richiesta."
      },
      "nonRefundable": {
        "title": "4. Servizi Non Rimborsabili",
        "intro": "I seguenti servizi non sono rimborsabili:",
        "items": {
          "item1": "Abbonamenti mensili dopo i primi 30 giorni",
          "item2": "Tariffe una tantum per l'elaborazione dei documenti",
          "item3": "Servizi notarili e di consulenza legale"
        }
      },
      "processingTime": {
        "title": "5. Tempo di Elaborazione",
        "body": "I rimborsi approvati saranno elaborati entro 5–10 giorni lavorativi e accreditati sul metodo di pagamento originale."
      }
    },
    "disclaimer": "[Questo è un testo segnaposto. Si prega di consultare un legale per redigere una Politica di Rimborso completa.]"
  }
}
