{
  "tos": {
    "title": "Hizmet Şartları",
    "effectiveDate": "Yürürlük Tarihi: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Şartların Kabulü",
        "body": "LegacyGuard Heritage Vault'a erişerek veya onu kullanarak, bu Hizmet Şartları'na bağlı kalmayı kabul etmiş olursunuz."
      },
      "service": {
        "title": "2. Hizmet Açıklaması",
        "body": "LegacyGuard Heritage Vault, belge depolama, vasiyet oluşturma ve belirlenen yararlanıcılarla önemli bilgilerin güvenli bir şekilde paylaşılması da dahil olmak üzere dijital miras yönetimi hizmetleri sağlar."
      },
      "responsibilities": {
        "title": "3. Kullanıcı Sorumlulukları",
        "body": "Hesap bilgilerinizin ve hesabınız altında gerçekleşen tüm faaliyetlerin gizliliğini korumaktan siz sorumlusunuz."
      },
      "privacy": {
        "title": "4. Gizlilik ve Veri Koruması",
        "body": "Gizliliğiniz bizim için önemlidir. Bilgilerinizi nasıl topladığımızı, kullandığımızı ve koruduğumuzu anlamak için lütfen Gizlilik Politikamızı inceleyin."
      },
      "liability": {
        "title": "5. Sorumluluğun Sınırlandırılması",
        "body": "LegacyGuard Heritage Vault, hizmeti kullanımınızdan kaynaklanan hiçbir dolaylı, tesadüfi, özel, sonuçsal veya cezai zarardan sorumlu tutulamaz."
      }
    },
    "disclaimer": "[Bu bir geçici hükümdür. Kapsamlı Hizmet Şartları oluşturmak için lütfen hukuk müşavirinize danışın.]"
  },
  "refund": {
    "title": "İade Politikası",
    "effectiveDate": "Yürürlük Tarihi: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Genel Bakış",
        "body": "Müşteri memnuniyeti önceliğimizdir. Bu İade Politikası, iade talep etme kriterlerini ve sürecini açıklamaktadır."
      },
      "eligibility": {
        "title": "2. Geri Ödeme Uygunluğu",
        "body": "Premium özellikleri kapsamlı bir şekilde kullanmadıysanız, ilk satın alma işleminizden itibaren 30 gün içinde geri ödeme almaya hak kazanabilirsiniz. Geri ödemeler takdirimize bağlıdır."
      },
      "process": {
        "title": "3. İade Süreci",
        "body": "İade talebinde bulunmak için lütfen satın alma tarihinden itibaren 30 gün içinde support@legacyguard.com adresinden destek ekibimizle iletişime geçin. Hesap e-postanızı ve iade talebinizin nedenini belirtin."
      },
      "nonRefundable": {
        "title": "4. İade Edilemeyen Hizmetler",
        "intro": "Aşağıdaki hizmetler iade edilmez:",
        "items": {
          "item1": "İlk 30 günden sonra aylık abonelikler",
          "item2": "Tek seferlik belge işleme ücretleri",
          "item3": "Noter tasdik ve hukuki danışmanlık hizmetleri"
        }
      },
      "processingTime": {
        "title": "5. İşlem Süresi",
        "body": "Onaylanan iadeler 5-10 iş günü içerisinde işleme alınacak ve orijinal ödeme yönteminize yatırılacaktır."
      }
    },
    "disclaimer": "[Bu bir geçici çözümdür. Kapsamlı bir İade Politikası oluşturmak için lütfen hukuk müşavirinize danışın.]"
  }
}
