{
  "general": {
    "something_wrong": "Diçka nuk funksionoi siç duhet, por mos u shqetësoni – informacionet tuaja të rëndësishme janë të sigurta.",
    "try_again": "Më lejoni ta provoj përsëri për ju",
    "contact_support": "Jam këtu për t'ju ndihmuar nëse keni nevojë për asistencë",
    "no_data_lost": "Lajmi i mirë është që asgjë nga ajo që keni punuar nuk është humbur",
    "temporary_issue": "Duket se është një problem i përkohshëm që duhet të zgjidhet shpejt"
  },
  "network": {
    "connection_lost": "Duket se lidhja juaj e internetit u ndërpre. Puna juaj është ruajtur dhe do të rilidhemi automatikisht.",
    "slow_connection": "Lidhja juaj duket pak e ngadaltë sot. Do të pres me durim derisa të ngarkohet gjithçka.",
    "server_busy": "Serverët tanë janë pak të zënë për momentin, por do të vazhdoj të përpiqem t'ju ndihmoj.",
    "timeout": "Kjo zgjati më shumë nga sa pritej. Më lejoni të provoj një qasje tjetër."
  },
  "validation": {
    "required_field": "Familja juaj do të ketë nevojë për këtë informacion – mund të më ndihmoni ta plotësoj?",
    "invalid_email": "Kjo adresë email nuk duket plotësisht e saktë. Mund ta kontrolloni edhe një herë?",
    "invalid_phone": "Po has vështirësi me këtë format numri telefoni. Mund të provoni ta shkruani ndryshe?",
    "invalid_date": "Ky format date nuk po funksionon për mua. Mund të provoni MM/DD/VVVV?",
    "password_weak": "Le ta bëjmë fjalëkalimin tuaj pak më të fortë për të mbajtur informacionin e familjes tuaj edhe më të sigurt.",
    "file_too_large": "Kjo skedar është paksa shumë e madhe për mua. Mund të provoni një version më të vogël?",
    "unsupported_file": "Nuk mund të punoj me këtë lloj skedari. Mund të provoni një PDF ose imazh?"
  },
  "contextual": {
    "assets": {
      "save_failed": "Nuk munda të ruaj informacionin e këtij aktivi tani, por do të vazhdoj të përpiqem. Informacioni i familjes suaj është i rëndësishëm për mua.",
      "load_failed": "Po kam vështirësi në ngarkimin e aktiveve tuaja tani. Më lejoni të provoj përsëri pas pak.",
      "delete_failed": "Nuk munda ta fshij këtë element tani. Dëshironi të provoj përsëri?"
    },
    "documents": {
      "upload_failed": "Ky dokument nuk u ngarkua siç duhet. Mos u shqetësoni – do t'ju ndihmoj ta provoni përsëri.",
      "processing_failed": "Pata vështirësi në përpunimin e këtij dokumenti. Skedari është i sigurt dhe do të provoj përsëri.",
      "access_failed": "Nuk mund të hyj në këtë dokument tani. Më lejoni të shoh çfarë mund të bëj."
    },
    "family": {
      "save_failed": "Nuk munda të ruaj informacionin për këtë person tani. Më lejoni të provoj përsëri – rrethi juaj i besuar është i rëndësishëm.",
      "invite_failed": "Nuk munda ta dërgoj këtë ftesë tani. Do t'ju ndihmoj ta provoni përsëri kur të jeni gati.",
      "access_failed": "Po kam vështirësi me cilësimet e aksesit të familjes. Më lejoni ta rregulloj këtë për ju."
    },
    "will": {
      "generation_failed": "Nuk munda të krijoj testamentin tuaj tani. Mos u shqetësoni – të gjitha vendimet tuaja janë ruajtur dhe do të provoj përsëri.",
      "save_failed": "Nuk munda të ruaj ndryshimet e testamentit tani. Versioni i mëparshëm është i sigurt dhe do të vazhdoj të përpiqem.",
      "legal_check_failed": "Nuk munda të verifikoj kërkesat ligjore tani. Më lejoni të provoj përsëri, ose mund të kërkojmë ndihmë nga ekipi ynë ligjor."
    }
  },
  "emotional_support": {
    "frustration": "E di që është zhgënjyese kur përpiqeni të bëni diçka të rëndësishme për familjen tuaj. Jam këtu për t'ju ndihmuar ta bëni këtë të funksionojë.",
    "time_pressure": "E kuptoj që nuk keni shumë kohë për probleme teknike. Më lejoni ta rregulloj shpejt për ju.",
    "overwhelm": "Problemet teknike mund të ndihen të rënda kur tashmë po merreni me planifikimin e rëndësishëm familjar. Merrni frymë – unë do ta zgjidh këtë.",
    "discouragement": "Mos lejoni që ky problem teknik t'ju dekurajojë. Ajo që po bëni për familjen tuaj është shumë e rëndësishme për të hequr dorë."
  },
  "solutions": {
    "refresh_page": "Ndonjëherë rifreskimi i faqes ndihmon. Puna juaj është ruajtur, kështu që nuk do të humbni asgjë.",
    "try_different_browser": "Nëse kjo vazhdon të ndodhë, provoni një shfletues tjetër. Chrome ose Firefox zakonisht funksionojnë më mirë.",
    "check_internet": "Mund të kontrolloni lidhjen tuaj të internetit? Ndonjëherë kjo është gjithçka që duhet.",
    "contact_support": "Do të doja t'ju ndihmoja personalisht. Mund të kontaktoni ekipin tonë të mbështetjes që do të kujdeset mirë për ju.",
    "try_later": "Nëse jeni me nxitim, mund ta provoni përsëri më vonë. Gjithçka që keni bërë është e ruajtur në mënyrë të sigurt.",
    "alternative_approach": "Më lejoni të sugjeroj një mënyrë tjetër për ta bërë këtë që mund të funksionojë më mirë."
  },
  "recovery": {
    "auto_save_worked": "Lajmi i mirë është që gjithçka që keni futur është ruajtur automatikisht.",
    "backup_available": "Kam një kopje rezervë të punës suaj nga disa minuta më parë nëse ju duhet.",
    "progress_preserved": "I gjithë progresi juaj është ruajtur – nuk do t'ju duhet të filloni nga e para.",
    "data_secure": "Informacioni i familjes suaj mbetet plotësisht i sigurt pavarësisht këtij problemi teknik."
  }
}

