{
  "tos": {
    "title": "Paslaugų teikimo sąlygos",
    "effectiveDate": "Įsigaliojimo data: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Sąlygų priėmimas",
        "body": "Prisijungdami prie LegacyGuard Heritage Vault ar jį naudodami, sutinkate laikytis šių Paslaugų teikimo sąlygų."
      },
      "service": {
        "title": "2. Paslaugos aprašymas",
        "body": "LegacyGuard Heritage Vault teikia skaitmeninio paveldo valdymo paslaugas, įskaitant dokumentų saugojimą, testamentų kūrimą ir saugų svarbios informacijos dalijimąsi su paskirtais gavėjais."
      },
      "responsibilities": {
        "title": "3. Vartotojo atsakomybė",
        "body": "Esate atsakingi už savo paskyros duomenų konfidencialumą ir už visą veiklą, vykdomą jūsų paskyroje."
      },
      "privacy": {
        "title": "4. Privatumas ir duomenų apsauga",
        "body": "Jūsų privatumas mums svarbus. Perskaitykite mūsų privatumo politiką, kad suprastumėte, kaip renkame, naudojame ir saugome jūsų informaciją."
      },
      "liability": {
        "title": "5. Atsakomybės apribojimas",
        "body": "LegacyGuard Heritage Vault neatsako už netiesioginę, atsitiktinę, ypatingą, pasekminę ar baudžiamąją žalą, atsiradusią dėl paslaugos naudojimo."
      }
    },
    "disclaimer": "[Tai yra pavyzdinis tekstas. Pasitarkite su teisininku dėl išsamių Paslaugų teikimo sąlygų parengimo.]"
  },
  "refund": {
    "title": "Grąžinimo politika",
    "effectiveDate": "Įsigaliojimo data: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Apžvalga",
        "body": "Klientų pasitenkinimas yra mūsų prioritetas. Ši grąžinimo politika apibrėžia kriterijus ir procesą, kaip pateikti grąžinimo prašymą."
      },
      "eligibility": {
        "title": "2. Tinkamumas grąžinimui",
        "body": "Jūs galite turėti teisę į grąžinimą per 30 dienų nuo pradinio pirkimo, jei plačiai nenaudojote aukščiausios kokybės funkcijų. Grąžinimai suteikiami mūsų nuožiūra."
      },
      "process": {
        "title": "3. Grąžinimo procesas",
        "body": "Norėdami pradėti grąžinimo prašymą, susisiekite su mūsų palaikymo komanda adresu support@legacyguard.com per 30 dienų nuo pirkimo. Įtraukite savo paskyros el. pašto adresą ir prašymo priežastį."
      },
      "nonRefundable": {
        "title": "4. Negrąžinamos paslaugos",
        "intro": "Šios paslaugos nėra grąžinamos:",
        "items": {
          "item1": "Mėnesinės prenumeratos po pirmųjų 30 dienų",
          "item2": "Vienkartiniai dokumentų apdorojimo mokesčiai",
          "item3": "Notaro ir teisinės konsultacijos paslaugos"
        }
      },
      "processingTime": {
        "title": "5. Apdorojimo laikas",
        "body": "Patvirtinti grąžinimai bus apdoroti per 5–10 darbo dienų ir pervesti į pradinį mokėjimo būdą."
      }
    },
    "disclaimer": "[Tai yra pavyzdinis tekstas. Pasitarkite su teisininku dėl išsamios grąžinimo politikos parengimo.]"
  }
}
