{
  "welcome": {
    "firstTime": "Dobrý deň! Som tu, aby som Vám pomohol usporiadať všetko dôležité pre Vašu rodinu. Pôjdeme krok za krokom a môžete postupovať vlastným tempom.",
    "returning": "Vitajte späť! Pokračujme v príprave budúcnosti Vašej rodiny. Robíte skvelý pokrok.",
    "afterBreak": "Rád Vás opäť vidím. Prestávky sú úplne v poriadku – ide o dôležitú prácu, ktorá si zaslúži Váš čas a pozornosť."
  },
  "contextual": {
    "dashboard": {
      "empty": "Pripravil som niekoľko návrhov podľa toho, čo ste nám povedali. Začnime tým, čo Vašej rodine pomôže najviac.",
      "progress": "Darí sa Vám výborne! Vaša rodina je už teraz omnoho lepšie pripravená ako na začiatku.",
      "nearComplete": "Už ste takmer v cieli! Vaša rodina bude mať všetko potrebné, aby sa cítila istá a pripravená."
    },
    "assets": {
      "firstAsset": "Začnime tým, že mi poviete o niečom skutočne dôležitom pre Vašu rodinu – možno o Vašom dome alebo významnom účte.",
      "addingMore": "Výborne! Každá vec, ktorú pridáte, uľahčí Vašej rodine pochopiť, na čom Vám záleží.",
      "organizing": "Vidím, že pre svoju rodinu vytvárate jasný obraz. Táto organizácia pre nich bude veľmi cenná."
    },
    "family": {
      "noTrustedPeople": "Teraz sa zamyslime nad ľuďmi, ktorí by mohli Vašej rodine pomôcť, keby to bolo potrebné. Komu by ste dôverovali, aby prevzal úlohu?",
      "addingPeople": "Je skvelé, že máte ľudí, na ktorých sa môžete spoľahnúť. Vaša rodina sa tak bude cítiť oveľa viac podporená.",
      "definingRoles": "Pomôcť ľuďom pochopiť, ako môžu pomôcť, je veľmi ohľaduplný a láskavý krok."
    },
    "documents": {
      "firstUpload": "Usporiadajme Vaše najdôležitejšie dokumenty, aby ich Vaša rodina ľahko našla.",
      "organizing": "Vytvárate veľmi prehľadný systém. Vaša rodina nebude musieť hádať, kde čo je.",
      "categorizing": "Táto organizácia ušetrí Vašej rodine veľa času a stresu, keď tieto dokumenty bude potrebovať."
    },
    "will": {
      "starting": "Vypracovanie závetu ukazuje, ako veľmi Vám záleží na budúcnosti Vašej rodiny. Budem Vás sprevádzať každým rozhodnutím.",
      "inProgress": "Ide o dôležité rozhodnutia a je prirodzené, že si na ich premyslenie necháte čas.",
      "reviewing": "Urobili ste premyslené rozhodnutia. Vaša rodina presne pochopí, čo ste si priali."
    }
  },
  "emotional": {
    "overwhelmed": {
      "message": "Môže sa Vám zdať, že je toho veľa na premýšľanie. To je úplne normálne – venujete sa dôležitým a citlivým témam.",
      "suggestion": "Chcete si dať pauzu, alebo sa dnes zameriame len na jednu malú vec?",
      "reassurance": "Pamätajte, nemusíte urobiť všetko naraz. Každý malý krok pomáha Vašej rodine."
    },
    "procrastinating": {
      "message": "Všimol(a) som si, že od Vašej poslednej návštevy ubehlo viac času. Život je rušný a premýšľať o týchto témach nie je vždy jednoduché.",
      "suggestion": "Chcete dnes venovať len 5 minút niečomu jednoduchému?",
      "encouragement": "Aj malý pokrok je významný pokrok pre Vašu rodinu."
    },
    "accomplished": {
      "message": "Pozrite sa, čo všetko ste dosiahli! Vaša rodina je vďaka Vašej práci oveľa lepšie pripravená.",
      "celebration": "Môžete byť hrdý(á) na to, že robíte tieto dôležité kroky na ochranu svojich blízkych.",
      "nextSteps": "Keď budete pripravený(á), mám pre Vás niekoľko nápadov, ktoré môžu Vašej rodine pomôcť ešte viac."
    }
  },
  "guidance": {
    "priorities": {
      "high": "Toto je jedna z najdôležitejších vecí, o ktorých by Vaša rodina mala vedieť.",
      "medium": "Toto Vašej rodine určite pomôže a stojí za to to urobiť, keď budete mať čas.",
      "low": "Je dobré mať toto usporiadané, ale nevadí, ak sa chcete najprv venovať iným veciam."
    },
    "timeEstimates": {
      "quick": "Toto by malo trvať len pár minút.",
      "moderate": "Môže to trvať 10–15 minút, ale stojí to za to.",
      "involved": "Je to zložitejšia úloha, ale môžete si uložiť postup a vrátiť sa k tomu neskôr."
    },
    "familyBenefit": {
      "immediate": "Vaša rodina bude môcť túto informáciu použiť okamžite, ak to bude potrebné.",
      "planning": "Toto Vašej rodine uľahčí plánovanie a rozhodovanie.",
      "peace": "Dá to Vašej rodine istotu, že rozumie Vašim prianiam."
    }
  },
  "suggestions": {
    "smart": {
      "basedOnAnswers": "Na základe toho, čo ste mi povedali o svojej situácii, si myslím, že Vaša rodina z toho bude mať veľký úžitok.",
      "basedOnProgress": "Keďže pracujete na {{area}}, toto by bol prirodzený ďalší krok.",
      "basedOnTime": "Spomenuli ste, že máte málo času, preto som uprednostnil to, čo Vašej rodine najviac pomôže."
    },
    "encouraging": {
      "smallStep": "Toto je malý krok, ktorý urobí pre Vašu rodinu veľký rozdiel.",
      "buildingOn": "Týmto nadväzujete na výbornú prácu, ktorú ste už urobili.",
      "almostThere": "Ste veľmi blízko k tomu, aby ste mali túto oblasť úplne usporiadanú pre svoju rodinu."
    }
  },
  "actions": {
    "primary": {
      "continue": "Pokračujme",
      "startThis": "Začnime",
      "helpMe": "Pomôžte mi s týmto",
      "showMe": "Ukážte mi ako"
    },
    "secondary": {
      "later": "Urobím to neskôr",
      "skip": "Preskočiť zatiaľ",
      "moreInfo": "Povedzte mi viac",
      "different": "Niečo iné namiesto toho"
    },
    "supportive": {
      "takeBreak": "Dajte si prestávku",
      "getHelp": "Potrebujem pomoc",
      "notReady": "Ešte nie som pripravený(á)",
      "overwhelmed": "Je to na mňa priveľa"
    }
  }
}
