{
  "tos": {
    "title": "Условия обслуживания",
    "effectiveDate": "Дата вступления в силу: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Принятие условий",
        "body": "Получая доступ к LegacyGuard Heritage Vault или используя его, вы соглашаетесь с настоящими Условиями обслуживания."
      },
      "service": {
        "title": "2. Описание услуги",
        "body": "LegacyGuard Heritage Vault предоставляет услуги по управлению цифровым наследием, включая хранение документов, создание завещаний и безопасный обмен важной информацией с назначенными получателями."
      },
      "responsibilities": {
        "title": "3. Обязанности пользователя",
        "body": "Вы несете ответственность за сохранение конфиденциальности данных вашей учетной записи и за все действия, выполняемые через нее."
      },
      "privacy": {
        "title": "4. Конфиденциальность и защита данных",
        "body": "Ваша конфиденциальность важна для нас. Пожалуйста, ознакомьтесь с нашей Политикой конфиденциальности, чтобы понять, как мы собираем, используем и защищаем вашу информацию."
      },
      "liability": {
        "title": "5. Ограничение ответственности",
        "body": "LegacyGuard Heritage Vault не несет ответственности за косвенные, случайные, особые, последующие или штрафные убытки, возникшие в результате использования вами услуги."
      }
    },
    "disclaimer": "[Это текст-заглушка. Пожалуйста, проконсультируйтесь с юристом, чтобы создать полные Условия обслуживания.]"
  },
  "refund": {
    "title": "Политика возврата средств",
    "effectiveDate": "Дата вступления в силу: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Обзор",
        "body": "Удовлетворенность клиентов является нашим приоритетом. Настоящая Политика возврата средств описывает критерии и процесс подачи запроса на возврат."
      },
      "eligibility": {
        "title": "2. Право на возврат средств",
        "body": "Вы можете иметь право на возврат в течение 30 дней с момента первоначальной покупки, если вы не использовали функции премиум в значительной степени. Возвраты предоставляются по нашему усмотрению."
      },
      "process": {
        "title": "3. Процесс возврата",
        "body": "Чтобы инициировать запрос на возврат, свяжитесь с нашей службой поддержки по адресу support@legacyguard.com в течение 30 дней с момента покупки. Укажите адрес электронной почты вашей учетной записи и причину запроса."
      },
      "nonRefundable": {
        "title": "4. Невозвратные услуги",
        "intro": "Следующие услуги не подлежат возврату:",
        "items": {
          "item1": "Ежемесячные подписки по истечении первых 30 дней",
          "item2": "Единовременные сборы за обработку документов",
          "item3": "Нотариальные и юридические консультационные услуги"
        }
      },
      "processingTime": {
        "title": "5. Время обработки",
        "body": "Одобренные возвраты будут обработаны в течение 5–10 рабочих дней и зачислены на исходный способ оплаты."
      }
    },
    "disclaimer": "[Это текст-заглушка. Пожалуйста, проконсультируйтесь с юристом, чтобы создать полную Политику возврата средств.]"
  }
}
