{
  "tos": {
    "title": "Términos del Servicio",
    "effectiveDate": "Fecha de entrada en vigor: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Aceptación de los Términos",
        "body": "Al acceder o utilizar LegacyGuard Heritage Vault, usted acepta quedar sujeto a estos Términos del Servicio."
      },
      "service": {
        "title": "2. Descripción del Servicio",
        "body": "LegacyGuard Heritage Vault ofrece servicios de gestión de legado digital, incluyendo almacenamiento de documentos, generación de testamentos y uso compartido seguro de información importante con beneficiarios designados."
      },
      "responsibilities": {
        "title": "3. Responsabilidades del Usuario",
        "body": "Usted es responsable de mantener la confidencialidad de las credenciales de su cuenta y de todas las actividades que ocurran bajo su cuenta."
      },
      "privacy": {
        "title": "4. Privacidad y Protección de Datos",
        "body": "Su privacidad es importante para nosotros. Por favor, revise nuestra Política de Privacidad para entender cómo recopilamos, usamos y protegemos su información."
      },
      "liability": {
        "title": "5. Limitación de Responsabilidad",
        "body": "LegacyGuard Heritage Vault no será responsable de daños indirectos, incidentales, especiales, consecuentes o punitivos que resulten del uso del servicio."
      }
    },
    "disclaimer": "[Este es un texto de ejemplo. Consulte con un abogado para crear Términos del Servicio completos.]"
  },
  "refund": {
    "title": "Política de Reembolso",
    "effectiveDate": "Fecha de entrada en vigor: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Visión General",
        "body": "La satisfacción del cliente es nuestra prioridad. Esta Política de Reembolso describe los criterios y el proceso para solicitar un reembolso."
      },
      "eligibility": {
        "title": "2. Elegibilidad para Reembolsos",
        "body": "Puede ser elegible para un reembolso dentro de los 30 días posteriores a su compra inicial si no ha utilizado extensamente las funciones premium. Los reembolsos se otorgan a nuestra discreción."
      },
      "process": {
        "title": "3. Proceso de Reembolso",
        "body": "Para iniciar una solicitud de reembolso, comuníquese con nuestro equipo de soporte en support@legacyguard.com dentro de los 30 días posteriores a la compra. Incluya el correo electrónico de su cuenta y el motivo de la solicitud."
      },
      "nonRefundable": {
        "title": "4. Servicios No Reembolsables",
        "intro": "Los siguientes servicios no son reembolsables:",
        "items": {
          "item1": "Suscripciones mensuales después de los primeros 30 días",
          "item2": "Tarifas únicas de procesamiento de documentos",
          "item3": "Servicios de notarización y asesoría legal"
        }
      },
      "processingTime": {
        "title": "5. Tiempo de Procesamiento",
        "body": "Los reembolsos aprobados se procesarán en un plazo de 5 a 10 días hábiles y se acreditarán a su método de pago original."
      }
    },
    "disclaimer": "[Este es un texto de ejemplo. Consulte con un abogado para crear una Política de Reembolso completa.]"
  }
}
