{
  "tos": {
    "title": "Podmienky služby",
    "effectiveDate": "Platné od: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Prijatie podmienok",
        "body": "Prístupom alebo používaním LegacyGuard Heritage Vault súhlasíte s tým, že budete viazaní týmito Podmienkami služby."
      },
      "service": {
        "title": "2. Popis služby",
        "body": "LegacyGuard Heritage Vault poskytuje služby správy digitálneho dedičstva, vrátane ukladania dokumentov, generovania závetov a bezpečného zdieľania dôležitých informácií s určenými príjemcami."
      },
      "responsibilities": {
        "title": "3. Povinnosti používateľa",
        "body": "Zodpovedáte za zachovanie dôvernosti prihlasovacích údajov k svojmu účtu a za všetky aktivity, ktoré sa v rámci účtu vykonajú."
      },
      "privacy": {
        "title": "4. Ochrana súkromia a údajov",
        "body": "Vaše súkromie je pre nás dôležité. Prečítajte si, prosím, naše Zásady ochrany osobných údajov, aby ste pochopili, ako zhromažďujeme, používame a chránime vaše údaje."
      },
      "liability": {
        "title": "5. Obmedzenie zodpovednosti",
        "body": "LegacyGuard Heritage Vault nenesie zodpovednosť za nepriame, náhodné, osobitné, následné alebo sankčné škody vyplývajúce z používania služby."
      }
    },
    "disclaimer": "[Toto je vzorový text. Pre vytvorenie úplných Podmienok služby sa, prosím, poraďte s právnikom.]"
  },
  "refund": {
    "title": "Zásady vrátenia peňazí",
    "effectiveDate": "Platné od: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Prehľad",
        "body": "Spokojnosť zákazníkov je našou prioritou. Tieto zásady vrátenia peňazí popisujú kritériá a postup na podanie žiadosti o vrátenie peňazí."
      },
      "eligibility": {
        "title": "2. Nárok na vrátenie peňazí",
        "body": "Na vrátenie peňazí môžete mať nárok do 30 dní od počiatočného nákupu, ak ste prémiové funkcie nevyužívali rozsiahlo. Vrátenie peňazí poskytujeme podľa vlastného uváženia."
      },
      "process": {
        "title": "3. Proces vrátenia peňazí",
        "body": "Ak chcete začať proces vrátenia peňazí, kontaktujte, prosím, náš tím podpory na adrese support@legacyguard.com do 30 dní od nákupu. Uveďte e-mail svojho účtu a dôvod žiadosti."
      },
      "nonRefundable": {
        "title": "4. Nevratné služby",
        "intro": "Nasledujúce služby nie sú vratné:",
        "items": {
          "item1": "Mesačné predplatné po prvých 30 dňoch",
          "item2": "Jednorazové poplatky za spracovanie dokumentov",
          "item3": "Notárske a právne poradenské služby"
        }
      },
      "processingTime": {
        "title": "5. Čas spracovania",
        "body": "Schválené vratky budú spracované do 5–10 pracovných dní a pripísané na pôvodný spôsob platby."
      }
    },
    "disclaimer": "[Toto je vzorový text. Pre vytvorenie úplnej politiky vrátenia peňazí sa, prosím, poraďte s právnikom.]"
  }
}
