{
  "tos": {
    "title": "Téarmaí Seirbhíse",
    "effectiveDate": "Dáta Éifeachtach: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Glacadh le Téarmaí",
        "body": "Trí rochtain a fháil ar nó úsáid a bhaint as LegacyGuard Heritage Vault, aontaíonn tú a bheith faoi cheangal ag na Téarmaí Seirbhíse seo."
      },
      "service": {
        "title": "2. Cur Síos ar an tSeirbhís",
        "body": "Soláthraíonn LegacyGuard Heritage Vault seirbhísí bainistíochta oidhreachta dhigiteach, lena n-áirítear stóráil doiciméad, giniúint uachtanna agus comhroinnt shlán faisnéise tábhachtacha le tairbhithe ainmnithe."
      },
      "responsibilities": {
        "title": "3. Freagrachtaí an Úsáideora",
        "body": "Tá tú freagrach as rúndacht do dhintiúir chuntais a chothabháil agus as gach gníomhaíocht a tharlaíonn faoi do chuntas."
      },
      "privacy": {
        "title": "4. Príobháideachas agus Cosaint Sonraí",
        "body": "Tá do phríobháideachas tábhachtach dúinn. Léigh ár bPolasaí Príobháideachais le tuiscint a fháil ar conas a bhailímid, a úsáidimid agus a chosnaímid do chuid faisnéise."
      },
      "liability": {
        "title": "5. Teorainn Dliteanais",
        "body": "Ní bheidh LegacyGuard Heritage Vault freagrach as damáistí indíreacha, teagmhasacha, speisialta, iarmhartacha ná pionósacha a eascraíonn as do úsáid den tseirbhís."
      }
    },
    "disclaimer": "[Is téacs ionadach é seo. Téigh i gcomhairle le dlíodóir chun Téarmaí Seirbhíse cuimsitheacha a chruthú.]"
  },
  "refund": {
    "title": "Polasaí Aisíocaíochta",
    "effectiveDate": "Dáta Éifeachtach: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Forbhreathnú",
        "body": "Is tosaíocht dúinn sástacht an chustaiméara. Leagtar amach sa Pholasaí Aisíocaíochta seo na critéir agus an próiseas chun iarratas ar aisíocaíocht a dhéanamh."
      },
      "eligibility": {
        "title": "2. Incháilitheacht d'Aisíocaíochtaí",
        "body": "B'fhéidir go mbeidh tú i dteideal aisíocaíochta laistigh de 30 lá ó do chéad cheannach má tá na gnéithe préimhe nár úsáideadh go fairsing agat. Cuirtear aisíocaíochtaí ar fáil ag ár rogha féin."
      },
      "process": {
        "title": "3. Próiseas Aisíocaíochta",
        "body": "Chun iarratas ar aisíocaíocht a thosú, déan teagmháil lenár bhfoireann tacaíochta ag support@legacyguard.com laistigh de 30 lá ón gceannach. Cuir isteach ríomhphost do chuntais agus an chúis leis an iarratas."
      },
      "nonRefundable": {
        "title": "4. Seirbhísí Neamh-Inaisíoctha",
        "intro": "Ní aisíocfar na seirbhísí seo a leanas:",
        "items": {
          "item1": "Síntiúis mhíosúla tar éis an chéad 30 lá",
          "item2": "Táillí aonuaire próiseála doiciméad",
          "item3": "Seirbhísí nótaireachta agus comhairliúcháin dlí"
        }
      },
      "processingTime": {
        "title": "5. Am Próiseála",
        "body": "Déantar aisíocaíochtaí formheasta a phróiseáil laistigh de 5–10 lá oibre agus creidtear iad chuig do mhodh íocaíochta bunaidh."
      }
    },
    "disclaimer": "[Is téacs ionadach é seo. Téigh i gcomhairle le dlíodóir chun Polasaí Aisíocaíochta cuimsitheach a chruthú.]"
  }
}
