{
  "general": {
    "something_wrong": "Щось пішло не зовсім так, але не хвилюйтеся – ваша важлива інформація в безпеці.",
    "try_again": "Дозвольте, я спробую ще раз для вас",
    "contact_support": "Я тут, щоб допомогти, якщо вам потрібна підтримка",
    "no_data_lost": "Гарна новина – нічого з того, над чим ви працювали, не було втрачено",
    "temporary_issue": "Схоже, це тимчасова проблема, яка швидко вирішиться"
  },
  "network": {
    "connection_lost": "Схоже, ваше інтернет-з'єднання перервалось. Ваша робота збережена, і ми автоматично відновимо з'єднання.",
    "slow_connection": "Сьогодні з'єднання здається трохи повільним. Я терпляче зачекаю, поки все завантажиться.",
    "server_busy": "Наші сервери зараз трохи завантажені, але я продовжу намагатися допомогти вам.",
    "timeout": "Це зайняло більше часу, ніж очікувалось. Дозвольте мені спробувати інший підхід."
  },
  "validation": {
    "required_field": "Вашій родині знадобиться ця інформація – чи можете ви допомогти мені її заповнити?",
    "invalid_email": "Ця адреса електронної пошти виглядає некоректно. Чи могли б ви перевірити її ще раз?",
    "invalid_phone": "Мені важко розпізнати цей формат номера телефону. Чи могли б ви ввести його по-іншому?",
    "invalid_date": "Цей формат дати мені не підходить. Спробуйте MM/DD/YYYY.",
    "password_weak": "Зробімо ваш пароль трохи надійнішим, щоб інформація вашої родини була максимально захищена.",
    "file_too_large": "Цей файл занадто великий для обробки. Спробуйте меншу версію.",
    "unsupported_file": "Я не можу працювати з цим типом файлу. Спробуйте PDF або зображення."
  },
  "contextual": {
    "assets": {
      "save_failed": "Мені не вдалося зберегти цю інформацію про актив зараз, але я продовжу спроби. Інформація вашої родини для мене важлива.",
      "load_failed": "У мене виникли труднощі з завантаженням ваших активів. Дозвольте спробувати знову за мить.",
      "delete_failed": "Я не зміг видалити цей елемент зараз. Хочете, щоб я спробував ще раз?"
    },
    "documents": {
      "upload_failed": "Цей документ не завантажився належним чином. Не хвилюйтеся – я допоможу вам спробувати ще раз.",
      "processing_failed": "Під час обробки цього документа виникли труднощі. Файл у безпеці, і я спробую ще раз.",
      "access_failed": "Зараз я не можу отримати доступ до цього документа. Дозвольте мені перевірити, як можу допомогти."
    },
    "family": {
      "save_failed": "Мені не вдалося зберегти інформацію про цю особу зараз. Дозвольте спробувати ще раз – ваше коло довіри важливе.",
      "invite_failed": "Мені не вдалося надіслати це запрошення зараз. Я допоможу вам повторити спробу, коли будете готові.",
      "access_failed": "Виникли труднощі з налаштуваннями доступу для сім'ї. Дозвольте мені це вирішити."
    },
    "will": {
      "generation_failed": "Мені не вдалося створити ваш заповіт зараз. Не хвилюйтеся – усі ваші рішення збережені, і я спробую ще раз.",
      "save_failed": "Мені не вдалося зберегти зміни у заповіті зараз. Попередня версія у безпеці, і я продовжу спроби.",
      "legal_check_failed": "Мені не вдалося перевірити юридичні вимоги зараз. Дозвольте спробувати ще раз або звернутися до нашої юридичної команди."
    }
  },
  "emotional_support": {
    "frustration": "Я знаю, що це неприємно, коли ви намагаєтеся зробити щось важливе для своєї родини. Я тут, щоб допомогти вам.",
    "time_pressure": "Я розумію, що у вас немає багато часу на технічні проблеми. Дозвольте швидко це вирішити для вас.",
    "overwhelm": "Технічні проблеми можуть здаватися надто складними, коли ви вже займаєтесь важливим плануванням для родини. Зробіть вдих – я все владнаю.",
    "discouragement": "Не дозволяйте цій технічній проблемі зупинити вас. Те, що ви робите для своєї родини, занадто важливо, щоб здаватися."
  },
  "solutions": {
    "refresh_page": "Іноді допомагає оновлення сторінки. Ваша робота збережена, тож ви нічого не втратите.",
    "try_different_browser": "Якщо це продовжиться, спробуйте інший браузер. Зазвичай Chrome або Firefox працюють найкраще.",
    "check_internet": "Чи могли б ви перевірити інтернет-з'єднання? Іноді цього достатньо.",
    "contact_support": "Я буду радий особисто допомогти. Ви можете зв'язатися з нашою службою підтримки, яка добре про вас подбає.",
    "try_later": "Якщо ви поспішаєте, спробуйте ще раз пізніше. Усе, що ви зробили, безпечно збережено.",
    "alternative_approach": "Дозвольте запропонувати інший спосіб, який може працювати краще."
  },
  "recovery": {
    "auto_save_worked": "Гарна новина – усе, що ви ввели, було автоматично збережено.",
    "backup_available": "У мене є резервна копія вашої роботи кількахвилинної давності, якщо вам потрібно.",
    "progress_preserved": "Увесь ваш прогрес збережено – вам не доведеться починати заново.",
    "data_secure": "Інформація вашої родини залишається повністю захищеною, незважаючи на цю технічну проблему."
  }
}

