{
  "general": {
    "networkError": "Проблема з мережевим підключенням. Перевірте підключення до Інтернету.",
    "serverError": "Виникли технічні проблеми. Будь ласка, спробуйте ще раз пізніше.",
    "timeoutError": "Час очікування запиту минув. Будь ласка, спробуйте ще раз.",
    "maintenanceMode": "Наразі ми проводимо технічне обслуговування. Будь ласка, спробуйте ще раз через кілька хвилин.",
    "something_wrong": "Щось пішло не так, як треба, але не хвилюйтеся — ваша важлива інформація в безпеці.",
    "try_again": "Дозволь мені спробувати ще раз для тебе",
    "contact_support": "Я тут, щоб допомогти, якщо вам потрібна допомога",
    "no_data_lost": "Гарна новина полягає в тому, що нічого, над чим ви працювали, не втрачено",
    "temporary_issue": "Здається, це тимчасова проблема, яка має швидко вирішитися"
  },
  "authentication": {
    "sessionExpired": "Ваш сеанс закінчився. Будь ласка, увійдіть знову.",
    "invalidCredentials": "Недійсна електронна адреса або пароль. Спробуйте ще раз.",
    "accountLocked": "Ваш обліковий запис тимчасово заблоковано з міркувань безпеки.",
    "accountDisabled": "Ваш обліковий запис вимкнено. Зверніться до служби підтримки.",
    "emailNotVerified": "Будь ласка, підтвердьте свою адресу електронної пошти, перш ніж продовжити.",
    "passwordResetRequired": "Потрібне скидання пароля. Будь ласка, перевірте свою електронну пошту."
  },
  "authorization": {
    "accessDenied": "У вас немає дозволу на доступ до цієї інформації.",
    "insufficientPermissions": "У вас недостатньо дозволів для цієї дії.",
    "subscriptionRequired": "Ця функція вимагає активної підписки.",
    "upgradeRequired": "Будь ласка, оновіть свій тарифний план, щоб отримати доступ до цієї функції."
  },
  "validation": {
    "invalidEmail": "Будь ласка, введіть дійсну адресу електронної пошти.",
    "invalidPhone": "Будь ласка, введіть дійсний номер телефону.",
    "invalidFormat": "Недійсний формат. Перевірте введені дані.",
    "passwordTooWeak": "Пароль має містити щонайменше 8 символів, включаючи великі, малі літери та цифри.",
    "passwordMismatch": "Паролі не збігаються.",
    "fileTooLarge": "Розмір файлу перевищує максимальне значення {{size}}МБ.",
    "unsupportedFileType": "Цей тип файлу не підтримується.",
    "required_field": "Вашій родині знадобиться ця інформація — чи не могли б ви допомогти мені її заповнити?",
    "invalid_email": "Ця адреса електронної пошти виглядає неправильною. Чи не могли б ви перевірити її ще раз?",
    "invalid_phone": "У мене виникли проблеми з цим форматом номера телефону. Чи не могли б ви спробувати ввести його по-іншому?",
    "invalid_date": "Цей формат дати мені не підходить. Чи не могли б ви спробувати ММ/ДД/РРРР?",
    "password_weak": "Давайте зробимо ваш пароль трохи сильнішим, щоб додатково захистити інформацію вашої родини.",
    "file_too_large": "Цей файл трохи завеликий для мене. Чи не могли б ви спробувати меншу версію?",
    "unsupported_file": "Я не можу працювати з таким типом файлу. Чи не могли б ви спробувати PDF або зображення?",
    "errors": {
      "assetNameRequired": "Назва ресурсу помилок обов'язкова",
      "assetTypeRequired": "Тип ресурсу помилок обов'язковий",
      "nameMinLength": "Назва помилки Мінімальна довжина",
      "allocationRequired": "Розподіл помилок. Необхідно",
      "allocationMustBeNumber": "Розподіл помилок має бути числом",
      "allocationRange": "Діапазон розподілу помилок",
      "requiredField": "Обов'язкове поле для помилок",
      "mustBeNumber": "Помилки мають бути числом",
      "countryRequired": "Країна помилок Обов'язково",
      "countryCodeLength": "Код країни помилок Довжина",
      "valueMustBeNumber": "Значення помилок має бути числом",
      "valueMustBePositive": "Значення помилок має бути додатним",
      "currencyCodeLength": "Код помилок валюти Довжина",
      "beneficiaryNameRequired": "Помилки бенефіціара Ім'я обов'язкове",
      "invalidEmail": "Помилки недійсної електронної пошти",
      "invalidPhone": "Помилки недійсного телефону",
      "documentNameRequired": "Назва документа з помилками обов'язкова",
      "documentTypeRequired": "Тип документа про помилки Обов'язковий",
      "expirationDateFuture": "Дата закінчення терміну дії помилок у майбутньому",
      "relationshipRequired": "Зв'язок помилок Обов'язковий",
      "unknownError": "Помилки невідомі Помилка",
      "dataNotFound": "Дані про помилки не знайдено",
      "connectionError": "Помилки підключення Помилка",
      "permissionDenied": "Помилки. Дозвіл відхилено.",
      "duplicateRecord": "Помилки дубліката запису"
    },
    "nameRequired": "Ім'я для перевірки (обов'язково)",
    "nameMinLength": "Ім'я для перевірки Мінімальна довжина",
    "jurisdictionRequired": "Необхідна юрисдикція перевірки",
    "dobRequired": "Дата народження обов'язкова для підтвердження",
    "addressRequired": "Адреса підтвердження обов'язкова",
    "allocationError": "Помилка розподілу перевірки",
    "beneficiaryRequired": "Бенефіціар підтвердження обов'язковий",
    "executorRequired": "Виконавець валідації обов'язковий"
  },
  "data": {
    "loadingFailed": "Не вдалося завантажити дані. Будь ласка, оновіть сторінку.",
    "savingFailed": "Не вдалося зберегти зміни. Спробуйте ще раз.",
    "deletingFailed": "Не вдалося видалити елемент. Спробуйте ще раз.",
    "uploadFailed": "Не вдалося завантажити файл. Спробуйте ще раз.",
    "exportFailed": "Не вдалося експортувати дані. Спробуйте ще раз пізніше.",
    "importFailed": "Не вдалося імпортувати дані. Перевірте формат файлу.",
    "syncFailed": "Синхронізація не вдалася. Деякі зміни можуть не бути збережені."
  },
  "payment": {
    "paymentFailed": "Не вдалося обробити платіж. Будь ласка, перевірте свій спосіб оплати.",
    "cardDeclined": "Вашу картку відхилено. Будь ласка, спробуйте інший спосіб оплати.",
    "insufficientFunds": "Недостатньо коштів. Будь ласка, перевірте баланс вашого рахунку.",
    "expiredCard": "Термін дії вашої картки закінчився. Будь ласка, оновіть свою платіжну інформацію.",
    "invalidCard": "Недійсна інформація про картку. Будь ласка, перевірте свої дані.",
    "paymentTimeout": "Час обробки платежу минув. Будь ласка, спробуйте ще раз."
  },
  "actions": {
    "tryAgain": "Спробуйте ще раз",
    "signInAgain": "Увійти знову",
    "updatePayment": "Оновити платіж",
    "upgradeAccount": "Оновити обліковий запис"
  },
  "debug": {
    "i18nDebug": {
      "current_lang_resources_7": "Поточні мовні ресурси 7",
      "has_resources_6": "Має ресурси 6",
      "i18n_debug_info_1": "Інформація про налагодження I18n 1",
      "resolved_language_3": "Вирішена мова 3",
      "test_translation_5": "Тестовий переклад 5"
    }
  },
  "test": {
    "environment": {
      "description": "Опис",
      "title": "Назва"
    }
  },
  "notfound": {
    "title": "Сторінку не знайдено",
    "description": "Сторінка, яку ви шукаєте, не існує або була переміщена.",
    "goHome": "Додому",
    "goBack": "Назад"
  },
  "network": {
    "connection_lost": "Схоже, ваше інтернет-з’єднання перервалося. Вашу роботу збережено, і ми автоматично відновимо з’єднання.",
    "slow_connection": "Ваше з’єднання сьогодні виглядає трохи повільним. Я терпляче почекаю, поки все завантажиться.",
    "server_busy": "Наші сервери зараз трохи перевантажені, але я продовжуватиму намагатися вам допомогти.",
    "timeout": "Це зайняло більше часу, ніж очікувалося. Дозвольте мені спробувати інший підхід."
  },
  "contextual": {
    "assets": {
      "save_failed": "Мені не вдалося зберегти цю інформацію про актив зараз, але я продовжуватиму спробувати. Інформація про вашу родину важлива для мене.",
      "load_failed": "У мене зараз виникли проблеми із завантаженням ваших ресурсів. Спробую ще раз за мить.",
      "delete_failed": "Мені щойно не вдалося видалити цей елемент. Хочете, щоб я спробував ще раз?"
    },
    "documents": {
      "upload_failed": "Цей документ не завантажився належним чином. Не хвилюйтеся, я допоможу вам спробувати ще раз.",
      "processing_failed": "У мене виникли проблеми з обробкою цього документа. Файл безпечний, я спробую ще раз.",
      "access_failed": "Зараз я не маю доступу до цього документа. Подивлюся, чим можу допомогти."
    },
    "family": {
      "save_failed": "Мені щойно не вдалося зберегти інформацію про цю людину. Спробую ще раз – ваше довірене коло важливе.",
      "invite_failed": "Мені не вдалося надіслати це запрошення зараз. Я допоможу вам спробувати ще раз, коли ви будете готові.",
      "access_failed": "У мене виникли проблеми з налаштуваннями сімейного доступу. Дозвольте мені над цим впоратися."
    },
    "will": {
      "generation_failed": "Мені не вдалося створити ваш заповіт щойно. Не хвилюйтеся — усі ваші рішення збережено, і я спробую ще раз.",
      "save_failed": "Мені не вдалося зберегти ці зміни заповіту зараз. Ваша попередня версія безпечна, і я продовжуватиму спроби.",
      "legal_check_failed": "Мені не вдалося перевірити юридичні вимоги. Спробую ще раз або звернуся за допомогою до нашої юридичної команди."
    }
  },
  "emotional_support": {
    "frustration": "Я знаю, що це неприємно, коли ти намагаєшся зробити щось важливе для своєї родини. Я тут, щоб допомогти тобі впоратися.",
    "time_pressure": "Я розумію, що у вас небагато часу на технічні проблеми. Дозвольте мені швидко вирішити це за вас.",
    "overwhelm": "Технічні проблеми можуть здатися непосильними, коли ви вже маєте справу з важливим плануванням сім'ї. Зробіть глибокий вдих — я цим займуся.",
    "discouragement": "Не дозволяйте цій технічній проблемі знеохотити вас. Те, що ви робите для своєї родини, надто важливо, щоб від цього відмовлятися."
  },
  "solutions": {
    "refresh_page": "Іноді допомагає оновлення сторінки. Ваша робота зберігається, тому ви нічого не втратите.",
    "try_different_browser": "Якщо це трапляється й надалі, спробуйте скористатися іншим браузером. Chrome або Firefox зазвичай працюють найкраще.",
    "check_internet": "Чи не могли б ви перевірити своє інтернет-з’єднання? Іноді цього достатньо.",
    "contact_support": "Я б із задоволенням допоміг вам особисто. Ви можете звернутися до нашої служби підтримки, яка чудово про вас подбає.",
    "try_later": "Якщо ви поспішаєте, можете спробувати це пізніше. Усе, що ви зробили, безпечно збережено.",
    "alternative_approach": "Дозвольте мені запропонувати інший спосіб зробити це, який може спрацювати краще."
  },
  "recovery": {
    "auto_save_worked": "Гарна новина полягає в тому, що все, що ви ввели, було автоматично збережено.",
    "backup_available": "У мене є резервна копія вашої роботи кілька хвилин тому, якщо вона вам потрібна.",
    "progress_preserved": "Весь ваш прогрес зберігається — вам не доведеться починати спочатку.",
    "data_secure": "Інформація вашої родини залишається повністю захищеною, незважаючи на цю технічну проблему."
  },
  "errors": {
    "notAuthenticated": "Помилки не підтверджено",
    "generic": "Загальні помилки",
    "savingSettings": "Помилки збереження налаштувань",
    "loadingSettings": "Помилки завантаження налаштувань",
    "networkError": "Помилки мережі Помилка",
    "permissionDenied": "Помилки. Дозвіл відхилено.",
    "dataNotFound": "Дані про помилки не знайдено",
    "unknown": "Помилки невідомі",
    "uploadFailed": "Помилки завантаження Не вдалося",
    "accessDenied": "Помилки доступу заборонено",
    "reassurance": {
      "data_safe": "Безпека даних для заспокоєння",
      "try_again": "Заспокоєння, спробуйте ще раз"
    },
    "loadingAssets": "Помилки завантаження ресурсів",
    "failedToFetchStatus": "Помилки. Не вдалося отримати статус.",
    "validationFailed": "Не вдалося перевірити помилки",
    "generationFailed": "Не вдалося створити помилки",
    "duplicateRecord": "Помилки дубліката запису"
  },
  "generic": {
    "title": "[TRANSLATE] Something went wrong",
    "message": "[TRANSLATE] We ran into an unexpected error. Your data is safe."
  }
}