{
  "general": {
    "something_wrong": "Niečo nefungovalo celkom správne, ale nebojte sa – vaše dôležité údaje sú v bezpečí.",
    "try_again": "Skúsim to pre vás znova",
    "contact_support": "Som tu, aby som vám pomohol, ak budete potrebovať podporu",
    "no_data_lost": "Dobrá správa je, že nič z toho, na čom ste pracovali, sa nestratilo",
    "temporary_issue": "Vyzerá to na dočasný problém, ktorý by sa mal čoskoro vyriešiť"
  },
  "network": {
    "connection_lost": "Zdá sa, že vaše internetové pripojenie bolo prerušené. Vaša práca je uložená a pripojenie sa obnoví automaticky.",
    "slow_connection": "Vaše pripojenie je dnes trochu pomalé. Počkám, kým sa všetko načíta.",
    "server_busy": "Naše servery sú momentálne trochu zaneprázdnené, ale budem sa snažiť vám pomôcť.",
    "timeout": "Trvalo to dlhšie, než som očakával. Skúsim iný postup."
  },
  "validation": {
    "required_field": "Vaša rodina bude tieto informácie potrebovať – pomôžete mi ich vyplniť?",
    "invalid_email": "Táto e-mailová adresa nevyzerá správne. Mohli by ste ju prosím ešte raz skontrolovať?",
    "invalid_phone": "Mám problém s formátom tohto telefónneho čísla. Skúste ho zadať inak.",
    "invalid_date": "Tento formát dátumu mi nevyhovuje. Skúste MM/DD/RRRR.",
    "password_weak": "Poďme heslo urobiť o niečo silnejšie, aby boli údaje vašej rodiny ešte bezpečnejšie.",
    "file_too_large": "Tento súbor je príliš veľký. Skúste menšiu verziu.",
    "unsupported_file": "S týmto typom súboru neviem pracovať. Skúste PDF alebo obrázok."
  },
  "contextual": {
    "assets": {
      "save_failed": "Nepodarilo sa uložiť informácie o tomto majetku, ale budem to skúšať ďalej. Údaje vašej rodiny sú pre mňa dôležité.",
      "load_failed": "Momentálne mám problém načítať vaše majetky. Skúsim to znova o chvíľu.",
      "delete_failed": "Nepodarilo sa odstrániť túto položku. Chcete, aby som to skúsil znova?"
    },
    "documents": {
      "upload_failed": "Tento dokument sa nenahral správne. Nebojte sa – pomôžem vám to skúsiť znova.",
      "processing_failed": "Mal som problém so spracovaním dokumentu. Súbor je v bezpečí, skúsim to znova.",
      "access_failed": "Momentálne nemám prístup k tomuto dokumentu. Pozriem sa, čo môžem urobiť."
    },
    "family": {
      "save_failed": "Nepodarilo sa uložiť informácie o tejto osobe. Skúsim to znova – váš okruh dôvery je dôležitý.",
      "invite_failed": "Nepodarilo sa odoslať pozvánku. Skúsime to znovu, keď budete pripravení.",
      "access_failed": "Mám problém s nastavením prístupu pre rodinu. Postarám sa o to za vás."
    },
    "will": {
      "generation_failed": "Nepodarilo sa vytvoriť vašu závetnú listinu. Nebojte sa – všetky vaše rozhodnutia sú uložené, skúsim to znova.",
      "save_failed": "Nepodarilo sa uložiť zmeny v závete. Predchádzajúca verzia je v bezpečí a budem to skúšať ďalej.",
      "legal_check_failed": "Nepodarilo sa overiť právne požiadavky. Skúsim to znova alebo požiadame o pomoc našich právnikov."
    }
  },
  "emotional_support": {
    "frustration": "Chápem, že je to frustrujúce, keď sa snažíte urobiť niečo dôležité pre svoju rodinu. Som tu, aby som vám pomohol.",
    "time_pressure": "Rozumiem, že nemáte veľa času na technické problémy. Rýchlo to pre vás vyriešim.",
    "overwhelm": "Technické problémy môžu pôsobiť zahlcujúco, keď sa už venujete plánovaniu pre rodinu. Nadýchnite sa – postarám sa o to.",
    "discouragement": "Nedovoľte, aby vás táto technická chyba odradila. To, čo robíte pre rodinu, je príliš dôležité, aby ste sa vzdali."
  },
  "solutions": {
    "refresh_page": "Niekedy pomôže obnoviť stránku. Vaša práca je uložená, nič nestratíte.",
    "try_different_browser": "Ak sa to opakuje, skúste iný prehliadač. Chrome alebo Firefox zvyčajne fungujú najlepšie.",
    "check_internet": "Skontrolujte internetové pripojenie – niekedy to stačí.",
    "contact_support": "Rád vám pomôžem osobne. Môžete kontaktovať náš tím podpory, ktorý sa o vás dobre postará.",
    "try_later": "Ak sa ponáhľate, môžete to skúsiť neskôr. Všetko, čo ste urobili, je uložené.",
    "alternative_approach": "Mám návrh na iný spôsob, ktorý by mohol fungovať lepšie."
  },
  "recovery": {
    "auto_save_worked": "Dobrá správa – všetko, čo ste zadali, bolo automaticky uložené.",
    "backup_available": "Mám zálohu vašej práce z pred pár minút, ak ju budete potrebovať.",
    "progress_preserved": "Váš pokrok je zachovaný – nemusíte začínať odznova.",
    "data_secure": "Údaje vašej rodiny zostávajú úplne v bezpečí napriek tejto technickej chybe."
  }
}

