{
  "tos": {
    "title": "Podmienky služby",
    "effectiveDate": "Dátum účinnosti: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Súhlas s podmienkami",
        "body": "Prístupom k službe LegacyGuard Heritage Vault alebo jej používaním súhlasíte s tým, že budete viazaní týmito Podmienkami služby."
      },
      "service": {
        "title": "2. Popis služby",
        "body": "LegacyGuard Heritage Vault poskytuje digitálne služby správy dedičstva vrátane ukladania dokumentov, generovania závetov a bezpečného zdieľania dôležitých informácií s určenými beneficientmi."
      },
      "responsibilities": {
        "title": "3. Zodpovednosti používateľa",
        "body": "Ste zodpovedný/á za zachovanie dôvernosti údajov k vášmu účtu a za všetky aktivity, ktoré sa v rámci vášho účtu vyskytnú."
      },
      "privacy": {
        "title": "4. Ochrana súkromia a údajov",
        "body": "Vaše súkromie je pre nás dôležité. Prečítajte si, prosím, naše Zásady ochrany osobných údajov, aby ste pochopili, ako zhromažďujeme, používame a chránime vaše informácie."
      },
      "liability": {
        "title": "5. Obmedzenie zodpovednosti",
        "body": "Spoločnosť LegacyGuard Heritage Vault nezodpovedá za žiadne nepriame, náhodné, mimoriadne, následné ani represívne škody vyplývajúce z vášho používania služby."
      }
    },
    "disclaimer": "[Toto je zástupný symbol. Pre vytvorenie komplexných zmluvných podmienok sa poraďte s právnym poradcom.]"
  },
  "refund": {
    "title": "Zásady vrátenia peňazí",
    "effectiveDate": "Dátum účinnosti: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Prehľad",
        "body": "Spokojnosť zákazníkov je našou prioritou. Tieto Zásady vrátenia peňazí stanovujú kritériá a postup pre žiadosť o vrátenie peňazí."
      },
      "eligibility": {
        "title": "2. Nárok na vrátenie peňazí",
        "body": "Ak ste prémiové funkcie dostatočne nevyužívali, môžete mať nárok na vrátenie peňazí do 30 dní od pôvodného nákupu. Vrátenie peňazí sa poskytuje na základe nášho uváženia."
      },
      "process": {
        "title": "3. Proces vrátenia peňazí",
        "body": "Ak chcete požiadať o vrátenie peňazí, kontaktujte náš tím podpory na adrese support@legacyguard.com do 30 dní od nákupu. Uveďte e-mailovú adresu vášho účtu a dôvod žiadosti o vrátenie peňazí."
      },
      "nonRefundable": {
        "title": "4. Nevratné služby",
        "intro": "Nasledujúce služby sú nevratné:",
        "items": {
          "item1": "Mesačné predplatné po prvých 30 dňoch",
          "item2": "Jednorazové poplatky za spracovanie dokumentov",
          "item3": "Notárske overovacie služby a právne poradenstvo"
        }
      },
      "processingTime": {
        "title": "5. Čas spracovania",
        "body": "Schválené vrátenie peňazí bude spracované do 5 až 10 pracovných dní a pripísané na váš pôvodný spôsob platby."
      }
    },
    "disclaimer": "[Toto je zástupný symbol. Pre vytvorenie komplexných Zásad vrátenia peňazí sa poraďte s právnym poradcom.]"
  }
}
