{
  "tos": {
    "title": "Conditions d'utilisation",
    "effectiveDate": "Date d'entrée en vigueur : {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Acceptation des conditions",
        "body": "En accédant à ou en utilisant LegacyGuard Heritage Vault, vous acceptez d'être lié par les présentes conditions d'utilisation."
      },
      "service": {
        "title": "2. Description du service",
        "body": "LegacyGuard Heritage Vault fournit des services de gestion d'héritage numérique, y compris le stockage de documents, la création de testaments et le partage sécurisé d'informations importantes avec les bénéficiaires désignés."
      },
      "responsibilities": {
        "title": "3. Responsabilités de l'utilisateur",
        "body": "Vous êtes responsable de la confidentialité de vos identifiants de compte et de toutes les activités effectuées sous votre compte."
      },
      "privacy": {
        "title": "4. Confidentialité et protection des données",
        "body": "Votre vie privée est importante pour nous. Veuillez consulter notre politique de confidentialité pour comprendre comment nous collectons, utilisons et protégeons vos informations."
      },
      "liability": {
        "title": "5. Limitation de responsabilité",
        "body": "LegacyGuard Heritage Vault ne sera pas responsable des dommages indirects, accessoires, spéciaux, consécutifs ou punitifs résultant de votre utilisation du service."
      }
    },
    "disclaimer": "[Ceci est un texte provisoire. Veuillez consulter un conseiller juridique pour rédiger des conditions d'utilisation complètes.]"
  },
  "refund": {
    "title": "Politique de remboursement",
    "effectiveDate": "Date d'entrée en vigueur : {{date}}",
    "sections": {
      "overview": {
        "title": "1. Aperçu",
        "body": "La satisfaction du client est notre priorité. Cette politique de remboursement décrit les critères et le processus pour demander un remboursement."
      },
      "eligibility": {
        "title": "2. Conditions d'éligibilité au remboursement",
        "body": "Vous pouvez être éligible à un remboursement dans les 30 jours suivant votre achat initial si vous n'avez pas utilisé de manière significative les fonctionnalités premium. Les remboursements sont accordés à notre discrétion."
      },
      "process": {
        "title": "3. Procédure de remboursement",
        "body": "Pour initier une demande de remboursement, veuillez contacter notre équipe d'assistance à support@legacyguard.com dans les 30 jours suivant l'achat. Incluez l'adresse e-mail de votre compte et la raison de la demande."
      },
      "nonRefundable": {
        "title": "4. Services non remboursables",
        "intro": "Les services suivants ne sont pas remboursables :",
        "items": {
          "item1": "Abonnements mensuels après les 30 premiers jours",
          "item2": "Frais uniques de traitement de documents",
          "item3": "Services de notarisation et de conseil juridique"
        }
      },
      "processingTime": {
        "title": "5. Délai de traitement",
        "body": "Les remboursements approuvés seront traités dans un délai de 5 à 10 jours ouvrables et crédités sur votre mode de paiement d'origine."
      }
    },
    "disclaimer": "[Ceci est un texte provisoire. Veuillez consulter un conseiller juridique pour rédiger une politique de remboursement complète.]"
  }
}
