{
  "general": {
    "something_wrong": "Nekaj ni delovalo čisto pravilno, a brez skrbi – vaši pomembni podatki so na varnem.",
    "try_again": "Naj poskusim znova za vas",
    "contact_support": "Tukaj sem, da vam pomagam, če potrebujete podporo",
    "no_data_lost": "Dobra novica je, da se nič od vašega dela ni izgubilo",
    "temporary_issue": "Videti je, da gre za začasno težavo, ki bi se morala hitro odpraviti"
  },
  "network": {
    "connection_lost": "Videti je, da je bila vaša internetna povezava prekinjena. Vaše delo je shranjeno, povezava pa se bo obnovila samodejno.",
    "slow_connection": "Vaša povezava je danes nekoliko počasna. Potrpežljivo bom počakal, da se vse naloži.",
    "server_busy": "Naši strežniki so trenutno nekoliko zasedeni, a bom še naprej poskušal pomagati.",
    "timeout": "To je trajalo dlje, kot sem pričakoval. Naj poskusim drugačen pristop."
  },
  "validation": {
    "required_field": "Vaša družina bo potrebovala te informacije – mi jih lahko pomagate izpolniti?",
    "invalid_email": "Ta e-poštni naslov ne izgleda povsem pravilen. Bi ga lahko še enkrat preverili?",
    "invalid_phone": "Imam težave s tem formatom telefonske številke. Poskusite jo vnesti drugače.",
    "invalid_date": "Ta format datuma mi ne ustreza. Poskusite MM/DD/LLLL.",
    "password_weak": "Naj naredimo geslo nekoliko močnejše, da bodo podatki vaše družine še dodatno varni.",
    "file_too_large": "Ta datoteka je nekoliko prevelika. Poskusite z manjšo različico.",
    "unsupported_file": "S tem tipom datoteke ne morem delati. Poskusite raje PDF ali sliko."
  },
  "contextual": {
    "assets": {
      "save_failed": "Podatkov o tem premoženju trenutno ni bilo mogoče shraniti, a bom poskušal znova. Podatki vaše družine so mi pomembni.",
      "load_failed": "Trenutno imam težave pri nalaganju vašega premoženja. Naj poskusim znova čez trenutek.",
      "delete_failed": "Tega elementa zdaj ni bilo mogoče odstraniti. Želite, da poskusim znova?"
    },
    "documents": {
      "upload_failed": "Ta dokument se ni naložil pravilno. Brez skrbi – pomagal vam bom poskusiti znova.",
      "processing_failed": "Imel sem težave pri obdelavi tega dokumenta. Datoteka je na varnem, poskusil bom znova.",
      "access_failed": "Trenutno nimam dostopa do tega dokumenta. Naj preverim, kaj lahko storim."
    },
    "family": {
      "save_failed": "Podatkov o tej osebi zdaj ni bilo mogoče shraniti. Naj poskusim znova – vaš krog zaupanja je pomemben.",
      "invite_failed": "Te povabila trenutno ni bilo mogoče poslati. Pomagal vam bom, ko boste pripravljeni.",
      "access_failed": "Imam težave z nastavitvami dostopa za družino. Naj to uredim za vas."
    },
    "will": {
      "generation_failed": "Vaše oporoke trenutno ni bilo mogoče ustvariti. Brez skrbi – vse vaše odločitve so shranjene, poskusil bom znova.",
      "save_failed": "Sprememb oporoke zdaj ni bilo mogoče shraniti. Prejšnja različica je na varnem in bom poskušal znova.",
      "legal_check_failed": "Pravnih zahtev trenutno ni bilo mogoče preveriti. Naj poskusim znova ali pa se obrnemo na našo pravno ekipo."
    }
  },
  "emotional_support": {
    "frustration": "Vem, da je to frustrirajoče, ko poskušate narediti nekaj pomembnega za svojo družino. Tukaj sem, da vam pomagam.",
    "time_pressure": "Razumem, da nimate veliko časa za tehnične težave. Naj to hitro uredim za vas.",
    "overwhelm": "Tehnične težave so lahko preobremenjujoče, ko se že ukvarjate z načrtovanjem za družino. Globoko vdihnite – jaz bom poskrbel za to.",
    "discouragement": "Ne dovolite, da vas ta tehnična napaka odvrne. To, kar počnete za družino, je preveč pomembno, da bi odnehali."
  },
  "solutions": {
    "refresh_page": "Včasih pomaga osvežitev strani. Vaše delo je shranjeno, zato ne boste ničesar izgubili.",
    "try_different_browser": "Če se to ponavlja, poskusite drug brskalnik. Chrome ali Firefox običajno delujeta najbolje.",
    "check_internet": "Lahko preverite svojo internetno povezavo? Včasih je to vse, kar je potrebno.",
    "contact_support": "Z veseljem vam bom osebno pomagal. Lahko se obrnete na našo podporno ekipo, ki bo dobro poskrbela za vas.",
    "try_later": "Če se vam mudi, lahko poskusite znova kasneje. Vse, kar ste naredili, je shranjeno.",
    "alternative_approach": "Naj predlagam drugačen način, ki bi lahko deloval bolje."
  },
  "recovery": {
    "auto_save_worked": "Dobra novica – vse, kar ste vnesli, je bilo samodejno shranjeno.",
    "backup_available": "Imam varnostno kopijo vašega dela izpred nekaj minut, če jo boste potrebovali.",
    "progress_preserved": "Vaš napredek je ohranjen – ne bo vam treba začeti znova.",
    "data_secure": "Podatki vaše družine ostajajo popolnoma varni kljub tej tehnični težavi."
  }
}
