{
  "tos": {
    "title": "Uvjeti pružanja usluge",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. Prihvaćanje uvjeta",
        "body": "Pristupom ili korištenjem LegacyGuard Heritage Vaulta pristajete na ove Uvjete pružanja usluge."
      },
      "service": {
        "title": "2. Opis usluge",
        "body": "LegacyGuard Heritage Vault pruža usluge digitalnog upravljanja ostavštinom, uključujući pohranu dokumenata, izradu oporuka i sigurno dijeljenje važnih informacija s određenim korisnicima."
      },
      "responsibilities": {
        "title": "3. Odgovornosti korisnika",
        "body": "Odgovorni ste za održavanje povjerljivosti podataka vašeg računa i za sve aktivnosti koje se događaju na vašem računu."
      },
      "privacy": {
        "title": "4. Privatnost i zaštita podataka",
        "body": "Vaša privatnost nam je važna. Molimo vas da pregledate našu Politiku privatnosti kako biste razumjeli kako prikupljamo, koristimo i štitimo vaše podatke."
      },
      "liability": {
        "title": "5. Ograničenje odgovornosti",
        "body": "LegacyGuard Heritage Vault neće biti odgovoran za bilo kakvu neizravnu, slučajnu, posebnu, posljedičnu ili kaznenu štetu nastalu korištenjem usluge."
      }
    },
    "disclaimer": "[Ovo je rezervirano mjesto. Za izradu sveobuhvatnih Uvjeta pružanja usluge obratite se pravnom savjetniku.]"
  },
  "refund": {
    "title": "Pravila povrata novca",
    "effectiveDate": "Datum stupanja na snagu: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Pregled",
        "body": "Zadovoljstvo kupaca nam je prioritet. Ova Pravila povrata opisuju kriterije i postupak za podnošenje zahtjeva za povrat novca."
      },
      "eligibility": {
        "title": "2. Pravo na povrat novca",
        "body": "Možda imate pravo na povrat novca u roku od 30 dana od početne kupnje ako niste intenzivno koristili premium značajke. Povrat novca vršimo prema vlastitom nahođenju."
      },
      "process": {
        "title": "3. Postupak povrata novca",
        "body": "Za pokretanje zahtjeva za povrat novca, obratite se našem timu za podršku na support@legacyguard.com u roku od 30 dana od kupnje. Navedite e-poštu svog računa i razlog zahtjeva za povrat novca."
      },
      "nonRefundable": {
        "title": "4. Usluge bez mogućnosti povrata novca",
        "intro": "Sljedeće usluge se ne vraćaju:",
        "items": {
          "item1": "Mjesečne pretplate nakon prvih 30 dana",
          "item2": "Jednokratne naknade za obradu dokumenata",
          "item3": "Usluge ovjere i pravnog savjetovanja"
        }
      },
      "processingTime": {
        "title": "5. Vrijeme obrade",
        "body": "Odobreni povrati bit će obrađeni u roku od 5-10 radnih dana i uplaćeni na vaš izvorni način plaćanja."
      }
    },
    "disclaimer": "[Ovo je rezervirano mjesto. Za izradu sveobuhvatnih Pravila povrata novca obratite se pravnom savjetniku.]"
  }
}
