{
  "general": {
    "something_wrong": "Algo no ha salido del todo bien, pero no te preocupes: tu información importante está segura.",
    "try_again": "Déjame intentarlo de nuevo por ti",
    "contact_support": "Estoy aquí para ayudarte si necesitas asistencia",
    "no_data_lost": "La buena noticia es que no se ha perdido nada de lo que has hecho",
    "temporary_issue": "Parece que es un problema temporal que debería resolverse pronto"
  },
  "network": {
    "connection_lost": "Parece que tu conexión a internet se ha interrumpido. Tu trabajo está guardado y nos reconectaremos automáticamente.",
    "slow_connection": "Tu conexión parece un poco lenta hoy. Esperaré pacientemente mientras todo se carga.",
    "server_busy": "Nuestros servidores están un poco ocupados en este momento, pero seguiré intentando ayudarte.",
    "timeout": "Esto ha tardado más de lo esperado. Déjame probar un enfoque diferente."
  },
  "validation": {
    "required_field": "Tu familia necesitará esta información, ¿puedes ayudarme a completarla?",
    "invalid_email": "Esa dirección de correo electrónico no parece correcta. ¿Podrías revisarla de nuevo?",
    "invalid_phone": "Tengo problemas con el formato de ese número de teléfono. ¿Puedes probar a introducirlo de otra manera?",
    "invalid_date": "Ese formato de fecha no me funciona. ¿Podrías probar con MM/DD/AAAA?",
    "password_weak": "Hagamos tu contraseña un poco más fuerte para mantener la información de tu familia aún más segura.",
    "file_too_large": "Ese archivo es un poco grande para que lo maneje. ¿Podrías probar con una versión más pequeña?",
    "unsupported_file": "No puedo trabajar con ese tipo de archivo. ¿Podrías probar con un PDF o una imagen?"
  },
  "contextual": {
    "assets": {
      "save_failed": "No pude guardar la información de este activo en este momento, pero seguiré intentándolo. La información de tu familia es importante para mí.",
      "load_failed": "Tengo problemas para cargar tus activos en este momento. Déjame intentarlo de nuevo en un momento.",
      "delete_failed": "No pude eliminar este elemento ahora. ¿Quieres que lo intente otra vez?"
    },
    "documents": {
      "upload_failed": "Ese documento no se subió correctamente. No te preocupes, te ayudaré a intentarlo de nuevo.",
      "processing_failed": "Tuve problemas para procesar ese documento. El archivo está seguro y lo intentaré de nuevo.",
      "access_failed": "No puedo acceder a ese documento en este momento. Déjame ver qué puedo hacer para ayudarte."
    },
    "family": {
      "save_failed": "No pude guardar la información de esta persona ahora. Intentémoslo de nuevo: tu círculo de confianza es importante.",
      "invite_failed": "No pude enviar esa invitación en este momento. Te ayudaré a intentarlo de nuevo cuando estés listo.",
      "access_failed": "Tengo problemas con la configuración de acceso familiar. Déjame encargarme de esto por ti."
    },
    "will": {
      "generation_failed": "No pude crear tu testamento ahora. No te preocupes: todas tus decisiones están guardadas y lo intentaré de nuevo.",
      "save_failed": "No pude guardar los cambios en el testamento en este momento. La versión anterior está segura y seguiré intentándolo.",
      "legal_check_failed": "No pude verificar los requisitos legales ahora. Déjame intentarlo de nuevo o podemos pedir ayuda a nuestro equipo legal."
    }
  },
  "emotional_support": {
    "frustration": "Sé que es frustrante cuando intentas hacer algo importante para tu familia. Estoy aquí para ayudarte a que funcione.",
    "time_pressure": "Entiendo que no tienes mucho tiempo para problemas técnicos. Déjame encargarme de esto rápidamente por ti.",
    "overwhelm": "Los problemas técnicos pueden resultar abrumadores cuando ya estás lidiando con una planificación familiar importante. Respira hondo: yo me ocupo.",
    "discouragement": "No dejes que este contratiempo técnico te desanime. Lo que haces por tu familia es demasiado importante para rendirte."
  },
  "solutions": {
    "refresh_page": "A veces, actualizar la página ayuda. Tu trabajo está guardado, así que no perderás nada.",
    "try_different_browser": "Si esto sigue ocurriendo, prueba a usar un navegador diferente. Chrome o Firefox suelen funcionar mejor.",
    "check_internet": "¿Puedes comprobar tu conexión a internet? A veces eso es todo lo que se necesita.",
    "contact_support": "Me encantaría ayudarte personalmente. Puedes contactar con nuestro equipo de soporte, que te atenderá muy bien.",
    "try_later": "Si tienes prisa, puedes intentarlo de nuevo más tarde. Todo lo que has hecho está guardado de forma segura.",
    "alternative_approach": "Déjame sugerirte una forma diferente de hacer esto que podría funcionar mejor."
  },
  "recovery": {
    "auto_save_worked": "La buena noticia es que todo lo que introdujiste se guardó automáticamente.",
    "backup_available": "Tengo una copia de seguridad de tu trabajo de hace unos minutos, por si la necesitas.",
    "progress_preserved": "Todo tu progreso está guardado: no tendrás que empezar de nuevo.",
    "data_secure": "La información de tu familia sigue completamente segura a pesar de este problema técnico."
  }
}
