{
  "tos": {
    "title": "Szolgáltatási feltételek",
    "effectiveDate": "Hatálybalépés dátuma: {{date}}",
    "sections": {
      "acceptance": {
        "title": "1. A feltételek elfogadása",
        "body": "A LegacyGuard Heritage Vault használatával vagy ahhoz való hozzáféréssel elfogadja a jelen Szolgáltatási feltételeket."
      },
      "service": {
        "title": "2. Szolgáltatás leírása",
        "body": "A LegacyGuard Heritage Vault digitális örökségkezelési szolgáltatásokat nyújt, beleértve a dokumentumtárolást, végrendelet készítést és a fontos információk biztonságos megosztását a kijelölt kedvezményezettekkel."
      },
      "responsibilities": {
        "title": "3. Felhasználói felelősségek",
        "body": "Ön felelős a fiókja bejelentkezési adatainak titkosságáért, valamint minden, a fiókjában végzett tevékenységért."
      },
      "privacy": {
        "title": "4. Adatvédelem és adatbiztonság",
        "body": "Az Ön adatainak védelme fontos számunkra. Kérjük, olvassa el Adatvédelmi irányelveinket, hogy megértse, hogyan gyűjtjük, használjuk és védjük adatait."
      },
      "liability": {
        "title": "5. Felelősség korlátozása",
        "body": "A LegacyGuard Heritage Vault nem vállal felelősséget semmilyen közvetett, véletlenszerű, különleges, következményi vagy büntető jellegű kárért, amely a szolgáltatás használatából ered."
      }
    },
    "disclaimer": "[Ez egy helyőrző szöveg. Kérjük, konzultáljon jogi tanácsadóval a teljes Szolgáltatási feltételek kidolgozásához.]"
  },
  "refund": {
    "title": "Visszatérítési szabályzat",
    "effectiveDate": "Hatálybalépés dátuma: {{date}}",
    "sections": {
      "overview": {
        "title": "1. Áttekintés",
        "body": "Az ügyfél-elégedettség számunkra prioritás. Ez a Visszatérítési szabályzat ismerteti a visszatérítés kérelmezésének feltételeit és folyamatát."
      },
      "eligibility": {
        "title": "2. Jogosultság visszatérítésre",
        "body": "A vásárlástól számított 30 napon belül jogosult lehet visszatérítésre, ha a prémium funkciókat nem használta jelentős mértékben. A visszatérítés megítélése saját belátásunk szerint történik."
      },
      "process": {
        "title": "3. Visszatérítési folyamat",
        "body": "Visszatérítési kérelem indításához kérjük, vegye fel a kapcsolatot ügyfélszolgálatunkkal a support@legacyguard.com címen a vásárlástól számított 30 napon belül. Adja meg a fiókjához tartozó e-mail címet és a kérelem okát."
      },
      "nonRefundable": {
        "title": "4. Nem visszatéríthető szolgáltatások",
        "intro": "A következő szolgáltatások nem visszatéríthetők:",
        "items": {
          "item1": "Havi előfizetések az első 30 nap után",
          "item2": "Egyszeri dokumentumfeldolgozási díjak",
          "item3": "Közjegyzői és jogi tanácsadási szolgáltatások"
        }
      },
      "processingTime": {
        "title": "5. Feldolgozási idő",
        "body": "A jóváhagyott visszatérítéseket 5–10 munkanapon belül feldolgozzuk és az eredeti fizetési módra jóváírjuk."
      }
    },
    "disclaimer": "[Ez egy helyőrző szöveg. Kérjük, konzultáljon jogi tanácsadóval a teljes Visszatérítési szabályzat kidolgozásához.]"
  }
}
